{
  "list": [
    {
      "id": "sweet-trip-a-tiny-house-in-secret-speeches-polar-equals",
      "cover": "https://e.snmc.io/i/600/w/93db4489cee8d30fbcd949a753693cf6/8991155/sweet-trip-a-tiny-house-in-secret-speeches-polar-equals-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Sweet Trip",
      "album": "A Tiny House, in Secret Speeches, Polar Equals",
      "year": 2021,
      "title": "At Last a Truth That Is Real",
      "review": "Sweet Trip returns after a 12-year break by doing essentially what they were doing before and yet not sounding even a bit outdated. Dream Pop aged well, but the subtle changes made the difference as well. I like the production and the vocals, and the soundscapes work well too. Also, keeping up with the group's signature sound, this is one of the few albums in which the glitch works harmonically with the track and feels stimulating instead of taking control of the song and ruining it. This is slightly too long, and maybe it isn't as great as their previous albums, but it still is a really decent album and an impressive comeback.",
      "highlights": [
        "Surviving a Smile",
        "At Last a Truth That Is Real"
      ],
      "honorable": 1
    },
    {
      "id": "silk-sonic-an-evening-with-silk-sonic",
      "cover": "https://e.snmc.io/i/600/w/f60703c4e60be5e6024dcd62ccd4c26a/9382297/silk-sonic-an-evening-with-silk-sonic-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Silk Sonic",
      "album": "An Evening With Silk Sonic",
      "year": 2021,
      "title": "The only thing worth smiling for was you",
      "review": "I must admit I don't know much about Anderson Paak. However, looking at Bruno Mars' career, this album is not much different from what he did before. In my opinion, it only shows how good he is as a songwriter. But this record is at a higher level. Here, Mars took a new approach to his songs' arrangements, sounding like 70s Soul, Funk, and Disco music. Adding actual instruments instead of programmed ones was a smart increment since his songs work better with a more classic approach. The production is also way above the average. In the end, this is a consistent album, with great instrumentation, grooves, guitar solos, and the well-known vocal melodies Mars has made his name with. It is slightly short, which might sound like a problem, but it's actually positive because the songs are a tad repetitive. It's a bit cheesy sometimes, and the lyrics are overall pretty weak. Still, it's a good album and a great surprise.",
      "highlights": [
        "Put on a Smile"
      ],
      "honorable": 1
    },
    {
      "id": "wolf-alice-blue-weekend",
      "cover": "https://e.snmc.io/i/600/w/c4216dea978bd3492b54b49cdbda7b89/8817275/wolf-alice-blue-weekend-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Wolf Alice",
      "album": "Blue Weekend",
      "year": 2021,
      "title": "Safe from heartbreak if I never fall in love",
      "review": "Wolf Alice migrates from their noisier Indie Rock sound to a more palatable, mainstream variation of Alternative Rock, and that's a change I don't completely enjoy. I mean, the vocals are still pretty good, but the band didn't prove they can make that change, even if the change is not that drastic. There are still some remnants of what the band once was, in songs like Play the Greatest Hits. Also, this album has a lot of influences from Dream Pop, which is the best thing here. The Last Man on Earth and Safe From Heartbreak (If You Never Fall in Love) are the best songs on the album, and they both follow this Dream Pop aesthetic. In between all the qualities and weaknesses, the album seems to be a little pretentious, with a concept plot that certainly is not as good as they think it is, and a change in direction that doesn't fit the band yet. Even so, it still is an enjoyable release with some really strong highlights from a band that is fantastic at making beautiful melodies.",
      "highlights": [
        "Safe From Heartbreak (If You Never Fall in Love)",
        "The Last Man on Earth"
      ],
      "honorable": 0
    },
    {
      "id": "arlo-parks-collapsed-in-sunbeams",
      "cover": "https://e.snmc.io/i/600/w/3d7d0273a0e24846e7b62c11007daaa3/8522274/arlo-parks-collapsed-in-sunbeams-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Arlo Parks",
      "album": "Collapsed in Sunbeams",
      "year": 2021,
      "title": "You're not alone like you think you are",
      "review": "Smooth and comfortable. In Arlo Park's debut, she blends Neo-Soul and Bedroom Pop in a very interesting and characteristic way. The combination ends up being very pleasant, and the album as a whole works as a very soft, smooth sound. Moreover, the lyrics are very introspective, to the point that sometimes they sound a bit forced. Still, most of them work well. Also, her voice skills are curious: at the same time her vocals seem to be depressing, they also seem confident, and that's quite unique.",
      "highlights": [
        "Hurt",
        "Hope"
      ],
      "honorable": 0
    },
    {
      "id": "asian-glow-cull-ficle",
      "cover": "https://e.snmc.io/i/600/w/78a1b15bb9b22f1d8511f6ac6cb8b108/9418065/asian-glow-cull-ficle-Cover-Art.png",
      "score": "7.7",
      "artist": "Asian Glow",
      "album": "Cull Ficle",
      "year": 2021,
      "title": "All the signs say I'm not good enough for everything",
      "review": "Asian Glow's most recognized release this year was his collab album with Parannoul and sonhos tomam conta. Even if I liked his contributions to the split record, In believe this album is much better (probably because I don't have to hear Parannoul). This has some of the most gorgeous melodies I've heard in a long time, showcasing great, catchy songwriting, good instrumentation, and hearty vocal delivery. The calm before the tempest formula of emo music is mastered here. Even so, I must say the production is weak. I know this is a lo-fi record, but the mixing is very poor, even for the aesthetic. The vocals are too low in the mix, and the instruments make a hazy, over-processed sound that makes them unrecognizable sometimes (to the point I can't even say if the drums are electronic or just remarkably processed in the mixing). Even when you can hear them all, it seems like the song would get much better if it had a cleaner production. Also, the album has some noisy tracks that fall hard on the ears. Still, songs like Yes It Is and Piglet make this a great record that puts Asian Glow in my sight, even if I tend to find most of the emo sweeties in RYM very overrated.",
      "highlights": [
        "Yes It Is",
        "Piglet"
      ],
      "honorable": 0
    },
    {
      "id": "brandi-carlile-in-these-silent-days",
      "cover": "https://e.snmc.io/i/600/w/49bcb5cbba1e8aca49ac64eb064c97ee/9180879/brandi-carlile-in-these-silent-days-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Brandi Carlile",
      "album": "In These Silent Days",
      "year": 2021,
      "title": "You know it's always okay to cry",
      "review": "It's a beautiful Americana record. There's not much to say about it. The songs are very well written, Brandi's performances are great, the instrumentation is top-notch, and the lyrics are very sentimental and warm. Not all the songs are masterpieces, but the strongest ones are fantastic. Broken Horses has also that roots, country rock sound to it that is really cool to hear.",
      "highlights": [
        "Right on Time",
        "Broken Horses",
        "Letter to the Past"
      ],
      "honorable": 0
    },
    {
      "id": "hannah-frances-bedrock",
      "cover": "https://e.snmc.io/i/600/w/89566d1ceeee73e4c6d6fde77eda4cb5/9090184/hannah-frances-bedrock-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Hannah Frances",
      "album": "Bedrock",
      "year": 2021,
      "title": "Looking for a home amongst the willows to be alone, anywhere but here",
      "review": "Hannah Frances is a very unique artist in the current folk industry. She has a beautiful voice, but her music is moody and poetic, in a way that is long forgotten. Even if we still have some great lyricists and songwriters, the folk scene sounds too focused on songs and commercial appeal, which was never associated with the genre. Folk is one of the most representative genres of counter culture, so it's kind of sad to see the Mumford and Sons-fication of the genre. Here. however, we have a contemplative record, full of substance, and the beauty in her voice and words give us everything we expect from a folk record. The songs feel heavily inspired by Nick Drake and Tim Buckley, but they still sound modern and unique enough for them to be impressive on their own right. A very consistent record.",
      "highlights": [
        "Pilgrim"
      ],
      "honorable": 0
    },
    {
      "id": "nanasai-desculpa-mae-eu-sou-indie",
      "cover": "https://e.snmc.io/i/600/w/7939649e03d94e600e389f1f31d7f1b3/8811758/nanasai-desculpa-mae-eu-sou-indie-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Nanasai",
      "album": "Desculpa mãe, eu sou indie",
      "year": 2021,
      "title": "Pau no cu do kishimoto",
      "review": "A very laid-back record, full of simple, yet very catchy hooks and a pretty chill vibe. The lyrics are in-between between cringe, ironic, and emotional, but that's why I like it. I also enjoy the several references to pop culture and a very nostalgic sound reminiscent of the early 2010s (they're not so far away, but still). The guitar work is pretty nice as well.",
      "highlights": [
        "Cansei de Menina Indie",
        "Aborrescência",
        "Otaku Raiz"
      ],
      "honorable": 0
    },
    {
      "id": "armand-hammer-and-the-alchemist-haram",
      "cover": "https://e.snmc.io/i/600/w/a9b791a9bc1f662f72bd176f66dacbd7/8888669/armand-hammer-and-the-alchemist-haram-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Armand Hammer & The Alchemist",
      "album": "Haram",
      "year": 2021,
      "title": "I got so much left to undo",
      "review": "Alchemist is one of the best producers in Hip Hop. His jazz influences are shaped in abstract samples that build a beautiful sonic wall. This kind of musicality is rare in Hip Hop, and when even moderately talented rappers team up with him, the result is pretty good. billy woods's rapping is always off-beat and weird, but it worked really well with the amazing production here. It's his best project since Hiding Places. Even if it doesn't have many stand-outs, the mood is fantastic and the consistency is impressive. If you're a fan of any of the people involved here, this is paradise for you.Except for the cover, that's just horrible.",
      "highlights": [
        "Black Sunlight", 
        "Falling Out the Sky", 
        "Stonefruit"
      ],
      "honorable": 0
    },
    {
      "id": "papangu-holoceno",
      "cover": "https://e.snmc.io/i/600/w/4eb3e90638697366f70f8edd59700d63/9174520/papangu-holoceno-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Papangu",
      "album": "Holoceno",
      "year": 2021,
      "title": "No seio do negrume",
      "review": "If you told me there's a Brazilian Avant-Garde Metal band making an album influenced by Sludge-Metal, Prog-Metal, and typical Brazilian rhythms, I wouldn't believe you. Now, that's just what's happening here. Papangu's sound is so innovative and distinctive, yet so easy to get into that it's almost unbelievable. Even if the lyrics are pretty much generic mysticism, the songwriting and the performances are pretty good. Of course, it is inconsistent, and the title track is too long for what it has to show. However, this record is very inspired, unique, and promising, and I can't wait to see how this band will grow.",
      "highlights": [
        "Ave-Bala"
      ],
      "honorable": 0
    },
    {
      "id": "shame-drunk-tank-pink",
      "cover": "https://e.snmc.io/i/600/w/06ebcc1fa91ee453e6f4ed6fc7304bf3/8988459/shame-drunk-tank-pink-Cover-Art.jpg",
      "score": "7.7",
      "artist": "shame",
      "album": "Drunk Tank Pink",
      "year": 2021,
      "title": "I represent everything that I hate",
      "review": "Another album from this new wave of UK Post-Punk bands. While some criticize the band for being too basic and not pushing to extremes, that's just what I like in the group. This accessibility is something positive, and expecting everything to be extremely wild, experimental or heavy is what makes so many cult classics stuck on the underground scene. That said, I divide this album into two kinds of songs: the simple and catchy punk tunes, which are pretty good, and the experimental ones, which are slightly annoying to me. I like the basslines and guitar work in here too. In general, it's a pretty decent album, but with some flaws when trying to be more than they actually are.",
      "highlights": [
        "Alphabet",
        "March Day",
        "6/1"
      ],
      "honorable": 0
    },
    {
      "id": "psychedelic-porn-crumpets-shyga-the-sunlight-mound",
      "cover": "https://e.snmc.io/i/600/w/d322bd9cd3da91b74388090ea293c29d/8510379/psychedelic-porn-crumpets-shyga-the-sunlight-mound-Cover-Art.jpg",
      "score": "7.8",
      "artist": "Psychedelic Porn Crumpets",
      "album": "Shyga! the Sunlight Mound",
      "year": 2021,
      "title": "I feel ordinary, like I'm next in line for the meat costume",
      "review": "Good riffs, energetic instrumentation, songs with different sections, and pedal effects to death. Is it the new King Gizzard? Psychedelic Porn Crumpets is another Australian Psychedelic Garage Rock act emerging. The band never matched the level of quality of their great debut, and this album is not the exception. Even so, this was the closest they've ever been. The tight instrumentation, the creative and unique usage of pedal effects, and the energetic delivery of the songs make this a solid album. I think it lacks consistency and isn't at its best all the time, but the best songs here are extremely good and at the same level as the best tracks from the debut or from King Gizzard. Anyways, this is a solid record and it's much better than anything King Gizzard has been releasing in the recent years.",
      "highlights": [
        "Tally Ho",
        "Mango Terrarium"
      ],
      "honorable": 0
    },
    {
      "id": "olivia-rodrigo-sour",
      "cover": "https://e.snmc.io/i/600/w/2e3cbf2b570db861aef14d79c47260fd/8937386/olivia-rodrigo-sour-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Olivia Rodrigo",
      "album": "SOUR",
      "year": 2021,
      "title": "I'd rather be anyone else",
      "review": "Olivia Rodrigo is a product of the media. She's a Disney star, had that fight with Sabrina Carpenter over a guy, was accused of plagiarizing more than once, is allegedly the \"savior of rock\" by mainstream pop publications that never gave a shit for rock, and is a social media phenomenon. Her music career exploded because of this media overexposure, and no one can deny it. But that's not a bad thing, I'm actually happy for her massive success because if it weren't for it, I would never listen to this record. Though all the songs are about breakups and teenage problems, the record has a good variety of genres (from standard teen pop to indie, rock, and even folk-ish approaches), making it a very pleasant and diverse listen. I also liked those alternative-rock influences in songs like Brutal. Again, the media overreacted a lot about it, but it still is nice to see some cool guitar work in mainstream pop music. Also, she made a really solid debut that may change pop's direction at such a young age, and that's impressive by itself.",
      "highlights": [
        "Brutal",
        "Deja vu"
      ],
      "honorable": 0
    },
    {
      "id": "wednesday-twin-plagues",
      "cover": "https://e.snmc.io/i/600/w/4970218982d136c87a7a7c3053a4f310/12526629/wednesday-twin-plagues-Cover-Art.jpg",
      "score": "7.8",
      "artist": "Wednesday",
      "album": "Twin Plagues",
      "year": 2021,
      "title": "I never know exactly what to think of my life",
      "review": "Living in a small, dead-end city. You feel like your goals are unachievable dreams. That you can never develop yourself to your full potential. The morbid feeling that we will all fade away unnoticed and with no relevance whatsoever. Anger and sadness corrupts your soul. We are nobodies. That's the sensation this album is trying (and kind of succeeding) to evoke. As a young person growing up and trying to outgrow my destiny to fail, these topics are very touching, and I love the overall downbeat atmosphere of the record. It does have some more flawed songs, and the album is a bit too irregular, but several tunes are fantastic, and these moments are soul-crushing. The guitars are great, and Karly's vocals are pretty honest.",
      "highlights": [
        "Handsome Man",
        "The Burned Down Dairy Queen",
        "Cody's Only"
      ],
      "honorable": 0
    },
    {
      "id": "black-country-new-road-for-the-first-time",
      "cover": "https://e.snmc.io/i/600/w/6bd10c3d453bd5516e1472dca97d7fee/8538705/black-country-new-road-for-the-first-time-Cover-Art.jpg",
      "score": "7.8",
      "artist": "Black Country, New Road",
      "album": "For the First Time",
      "year": 2021,
      "title": "I told you I loved you in front of black midi",
      "review": "Black Country, New Road is a band formed after the ashes of Nervous Conditions after one of the members was accused of multiple sexual harassment charges. The remaining members wanted to separate themselves from him and founded this band. The group, often compared to Slint, makes an ambitious Post-Rock / Post-Punk album that shows all the artist's virtuosity. The band is, of course, rich in influences and experiments in many ways, which is pretty good. Isaac's vocals work perfectly in the more lush and beautiful tracks, but in the more experimental ones, it annoys me a little. Even if it isn't flawless, the band mixes all its influences in the right measure, having a very distinct sound. It is very atmospheric and a pleasant listen. Furthermore, it's a rare Post-Rock album that doesn't lengthen the songs until you can't stand it anymore. The album didn't click on me as it did for most people, but it still is a good album, and Athens, France and Track X are really beautiful tracks.",
      "highlights": [
        "Athens, France",
        "Track X"
      ],
      "honorable": 0
    },
    {
      "id": "fievel-is-glauque-god-s-trashmen-sent-to-right-the-mess",
      "cover": "https://e.snmc.io/i/600/w/48c241c7b374f8e03665c07b7591e858/9203088/fievel-is-glauque-gods-trashmen-sent-to-right-the-mess-Cover-Art.jpg",
      "score": "7.8",
      "artist": "Fievel Is Glauque",
      "album": "God's Trashmen Sent to Right the Mess",
      "year": 2021,
      "title": "Rain down tu ru tu tu ru",
      "review": "Fievel Is Glauque is a Belgian group that mixes Jazz and Pop in a way I've never seen before. To call it Jazz Pop seems wrong, calling it Bossa Nova seems wrong, and calling it Vocal Jazz seems even worse, but that's pretty much it. This is a very playful, soothing, and simple album at times, but it experiments once in a while to give some variety to the record. The production is very lo-fi, on the edge of being amateur and low quality, but it ends up being very pleasant. Moreover, the songs are pretty short, too short sometimes, not letting much development. The melodies are good, and the album is pretty unique. But there's still plenty of space for evolution, however.",
      "highlights": [
        "We're Lost",
        "Rain Down"
      ],
      "honorable": 0
    },
    {
      "id": "the-marias-cinema",
      "cover": "https://e.snmc.io/i/600/w/5091a1ff7746a775908f4b638e56528c/8971408/the-marias-cinema-Cover-Art.jpg",
      "score": "7.8",
      "artist": "The Marías",
      "album": "CINEMA",
      "year": 2021,
      "title": "Don't stop giving up",
      "review": "The Marías debut sounds like a never-ending aesthetic pinterest folder. Musically speaking, it's kinda of hard to describe the album. It's Alt-Pop that's somewhere between synthpop and alternative R&B, with several Dream Pop influences, but it doesn't sound much like the big names of these genres. The production is great, and her singing is beautiful. Some Latin pop influences also make their presence here, and the Spanish singing in some of the tracks gives some nice variety to the record. Though the lyrics are not perfect, they're better than most of their genre rivals as well. Even if this isn't a record I'd use as an example of consistency, its best moments are very engaging and definitely deserve your attention.",
      "highlights": [
        "Calling U Back",
        "Little by Little",
        "Talk to Her"
      ],
      "honorable": 0
    },
    {
      "id": "bruno-pernadas-private-reasons",
      "cover": "https://e.snmc.io/i/600/w/ddac8e30f0f5ec5d1c960e5f8b578509/9174517/bruno-pernadas-private-reasons-Cover-Art.jpg",
      "score": "7.8",
      "artist": "Bruno Pernadas",
      "album": "Private Reasons",
      "year": 2021,
      "title": "There's no sunlight through the window of your soul",
      "review": "Bruno Pernadas returns after 5 years of his masterwork's release with a good follow-up. In this album, the sonority lost some of its jazzy influences to focus more on pop melodies but kept the progressiveness and great crafting his other works had. I think this album is quite too long, with far too many songs - most of those don't add anything to the album - and tunes that lengthen themselves until they lose their appeal. Also, I liked the jazzy approach of the previous album better. Still, some songs are between Bruno's best, and the beauty of it is undeniable.",
      "highlights": [
        "Theme Vision",
        "Little Season I"
      ],
      "honorable": 0
    },
    {
      "id": "little-simz-sometimes-i-might-be-introvert",
      "cover": "https://e.snmc.io/i/600/w/d4fa47a7ef10f6a92166dec080ce908a/9491076/little-simz-sometimes-i-might-be-introvert-Cover-Art.jpg",
      "score": "7.8",
      "artist": "Little Simz",
      "album": "Sometimes I Might Be Introvert",
      "year": 2021,
      "title": "Please don't tell my mama I've been smoking marijuana",
      "review": "Little Simz's breakout record didn't impress me at all, so when I heard all that cult behind this album, I gave it a try intending to go against the wave. To my surprise, I was hugely mistaken, this album deserves all the praise it's getting. The neo-soul, jazzy and orchestral influences make the instrumentals more diverse, and the creativity in\neach song makes this a really distinct album in the genre. Moreover, the samples' choices are amazing. Simz's singing is also remarkable, her accent gives a good twist\nin the rapping, and having songs with actual singing and not just rapping is always a good thing in a rap album, even though it's uncommon. Even so, the album's\nirregular and too long. But, even if some songs are pretty bad (like Point and Kill and Fear No Man), most of it is extremely good. Some lyrics are also relatable for me in\nsome aspects. Two Worlds Apart, I Love, I Hate You, Little Q, Pt. 2, and Protect My Energy are the highlights here.",
      "highlights": [],
      "honorable": 0
    },
    {
      "id": "dry-cleaning-new-long-leg",
      "cover": "https://e.snmc.io/i/600/w/85eb459ebabbfecc8d031aa42bf0f859/10107886/dry-cleaning-new-long-leg-Cover-Art.jpg",
      "score": "7.8",
      "artist": "Dry Cleaning",
      "album": "New Long Leg",
      "year": 2021,
      "title": "Do everything and feel nothing",
      "review": "We're in a time in which being less inventive sometimes makes you more inventive. A lot of bands hide themselves behind quirky gimmicks and good concepts and forget that music is about writing good songs. Dry Cleaning, however, is direct to the point, and is creative in the little things. They have a very standard Indie Rock, Post-Punk sound, but blend that style with great Spoken Word vocals. The mood is consistent and the album feels more like an experience than just a bunch of songs. Also, the musicianship is really good, and I enjoy a lot the basslines and the guitar's pitch here. Sometimes this speak-singing annoys me a bit, but the lyrics are quite strong, so it works well in general.",
      "highlights": [
        "Scratchcard Lanyard",
        "More Big Birds"
      ],
      "honorable": 0
    },
    {
      "id": "hiatus-kaiyote-mood-valiant",
      "cover": "https://e.snmc.io/i/600/w/236e4dc1890ea56e5ad5a616d4afed4e/10107990/hiatus-kaiyote-mood-valiant-Cover-Art.jpg",
      "score": "7.8",
      "artist": "Hiatus Kaiyote",
      "album": "Mood Valiant",
      "year": 2021,
      "title": "Take me far away from myself",
      "review": "The Australian act comes again with another solid Neo-Soul record. This time, the group's creativity is at its peak, and Nai Palm's vocals are as excellent as ever. Also, the production is better than ever, and the synthesizers in this album are astoundingly charming. I wouldn't say this album is experimental, but it's certainly adventurous, as the songwriting is complex and dense. The rhythm sections are tight too. Moreover, the album is moody and consistent, and yet it never sounds repetitive.",
      "highlights": [
        "Sip Into Something Soft",
        "Chivalry Is Not Dead",
        "Stone or Lavender"
      ],
      "honorable": 0
    },
    {
      "id": "amyl-and-the-sniffers-comfort-to-me",
      "cover": "https://e.snmc.io/i/600/w/224dcc3cec0d0956b13f9aa7f6fe5cbf/9148408/amyl-and-the-sniffers-comfort-to-me-Cover-Art.jpg",
      "score": "7.8",
      "artist": "Amyl and The Sniffers",
      "album": "Comfort to Me",
      "year": 2021,
      "title": "I am still a smart girl when I earn my money",
      "review": "Retro-rock is a double-edged sword. Yes, everybody likes the nostalgia in it, but the thing is that this kind of music was made so many times that almost anything will sound either outdated or generic. Even so, Amyl and The Sniffers managed to release a great sophomore album, with many influences from 70s Punk Rock, but still being able to sound their own. Amy Taylor is a great frontwoman, full of attitude and energy, wildly delivering great, politcally charged lyrics. Also, Dec Martens' guitar has that 70s Hard Rock pitch that makes the solos here awesome. The album is not perfect, some songs are too short and don't develop anything, and others are too plain. Still, some riffs are pretty good, and this is a great collection of songs. It's a refreshing record for Retro-Rock scenery, and I'm looking forward to seeing what's next.",
      "highlights": [
        "Hertz",
        "Capital",
        "Laughing"
      ],
      "honorable": 0
    },
    {
      "id": "courtney-barnett-things-take-time-take-time",
      "cover": "https://e.snmc.io/i/600/w/459f6c34cf9511ecf42967d6c3d0cf07/9448562/courtney-barnett-things-take-time-take-time-Cover-Art.jpg",
      "score": "7.8",
      "artist": "Courtney Barnett",
      "album": "Things Take Time, Take Time",
      "year": 2021,
      "title": "If something were to happen, my dear, I wouldn't want the last words you hear to be unkind",
      "review": "Unfortunately, this is Courtney's weakest album so far, but it doesn't mean it's bad. The lyrics might be less inspired than they used to be, but they are still very touching and personal. Also, the more laid-back, smooth, tired approach is very welcome. It's maybe too basic, but the basics are what makes her music so charming, to begin with. Even though this album might be a downgrade, it's hazy and comfortable, and if appreciated in the right way, it can be remarkable. Rae Street, Before You Gotta Go, and Write a List of Things to Look Forward To are all fantastic songs that go between her other classics.",
      "highlights": [
        "Rae Street",
        "Before You Gotta Go",
        "Write a List of Things to Look Forward To"
      ],
      "honorable": 0
    },
    {
      "id": "genesis-owusu-smiling-with-no-teeth",
      "cover": "https://e.snmc.io/i/600/w/344da5c8dbf61de78b5a64d7c2e86292/8596014/genesis-owusu-smiling-with-no-teeth-Cover-Art.jpg",
      "score": "7.9",
      "artist": "Genesis Owusu",
      "album": "Smiling With No Teeth",
      "year": 2021,
      "title": "Everybody wants the help but they ain't lending a hand",
      "review": "Because of the internet, we had music democratization in a way that you have access to pretty much anything at any time and for free. That democratization allowed people to have a much more eclectic taste and have contact with much more genres than they could imagine. Genesis Owusu's Smiling With No Teeth is living proof of it. This album's influences are basically everything: Hip Hop, R&B, Funk, Soul, Psychedelia, Punk, Rock, and Experimental music. Changing between genres is a great thing, but when you try with too many genres, you end up unraveling your failures. I mean, you can't be good at everything, and if you put everything in an album, that includes the your weak spots. This way, this debut is irregular. But, even with the inconsistencies, the great songs here are just astonishing. The production, the singing, the songwriting, the experimentation, everything is just great. In the end, even if it is a bit irregular, Smiling With No Teeth is the best debut of the year and shows a lot of potential in the artist that I'm looking forward to.",
      "highlights": [
        "The Other Black Dog",
        "Waitin' on Ya",
        "Don't Need You",
        "Smiling With No Teeth",
        "No Looking Back"
      ],
      "honorable": 0
    },
    {
      "id": "badbadnotgood-talk-memory",
      "cover": "https://e.snmc.io/i/600/w/52597ebf14615e9babdea66bffff1855/9169804/badbadnotgood-talk-memory-Cover-Art.jpg",
      "score": "8.0",
      "artist": "BADBADNOTGOOD",
      "album": "Talk Memory",
      "year": 2021,
      "title": "GOODGOODNOTBAD",
      "review": "BADBADNOTGOOD is an unusual band. They have an indie-pop band name, the band members look like an experimental rock band, but they're a Jazz Fusion band\nwith huge hip-hop influences. And they're Canadian. Appearances aside, every musician here is great, but I must emphasize Alex Sowinski's drumming, which is the best thing here. Not only that, but in my opinion, Alex is the best drummer in the music industry right now. The Brazilian producer Arthur Verocai also makes his appearance here, and he's responsible for the excellent string arrangements and production. This album is also \"jazzier\" and has more rock influences than anything the band has ever done, diminishing the Hip Hop influences, which is an excellent thing for me. Fortunately or not, the group managed to release their best album and most of their fans didn't even notice it. I hope someday this album gets the recognition it deserves.",
      "highlights": [
        "City of Mirrors",
        "Beside April"
      ],
      "honorable": 0
    },
    {
      "id": "cassandra-jenkins-an-overview-on-phenomenal-nature",
      "cover": "https://e.snmc.io/i/600/w/b827469b50046d7b91cfdb353421b005/10107884/cassandra-jenkins-an-overview-on-phenomenal-nature-Cover-Art.jpg",
      "score": "8.1",
      "artist": "Cassandra Jenkins",
      "album": "An Overview on Phenomenal Nature",
      "year": 2021,
      "title": "New year. New you. Same me",
      "review": "Cassandra Jenkins evolves her indie-ish folk into something much more contemplative and peaceful. It's almost as if she reached Nirvana in here. With a more diverse sound palette, her sophomore album delves deeper into the peaceful nature of music, going to field recordings and soothing melodies that wrap your ears in a comfortable shack in the margin of a lake at sunset. The guitars are beautiful, her vocals are soft, and the synths add layers to the atmospheric sound. It's that kind of record that makes city people like me believe they'll like country life - they won't (or at least I won't). Still, it's great to listen to this playing Stardew Valley while pretending you would.",
      "highlights": [
        "Hard Drive",
        "Crosshairs",
        "Hailey"
      ],
      "honorable": 0
    },
    {
      "id": "no-buses-no-buses",
      "cover": "https://e.snmc.io/i/600/w/66bfb848fdfac85178e0bf5627bcad84/9033704/no-buses-no-buses-Cover-Art.jpg",
      "score": "8.1",
      "artist": "No Buses",
      "album": "No Buses",
      "year": 2021,
      "title": "Comparing whose life is worse now",
      "review": "Some context before the review: I found No Buses after YouTube recommended me the video clip of Pretty Old Man, and at that moment I knew I'd love the band. Now, if this album is so high on the list, this should mean I'm happy with it, but that's not the case. This is such a downgrade from what the band was doing before. Some might consider it a more mature record, an improvement. And maybe that's it, because the crafting of the songs has indeed improved. Also, the lyrics are finally making a bit of sense, which means a massive improvement in their English. Even so, I think the band lost the catchiness, the energy, the unpretentious songwriting that made their debut so good. That's more on me, but I miss spending the entire song trying to understand what Cwondo says and failing miserably too. The songwriting is pretty good, and so is the instrumentation. The band still has a very riff-based writing that I love. Consistency is likewise presented here, but this album shows a tired, controlled, self-aware band, not the No Buses I fell in love with. Still, that's a great album, and I enjoy the (short) guitar solos here a lot.",
      "highlights": [
        "Preparing",
        "Yellow Card",
        "Playground",
        "you won't regret it"
      ],
      "honorable": 0
    },
    {
      "id": "tricot-jodeki",
      "cover": "https://e.snmc.io/i/600/w/ac654ec4dbdc0e89852256fbcd4c977f/9413617/tricot-%E4%B8%8A%E5%87%BA%E6%9D%A5-Cover-Art.jpg",
      "score": "8.3",
      "artist": "tricot",
      "album": "上出来 [Jodeki]",
      "year": 2021,
      "title": "It's not like I understand a word in it to choose a quote.",
      "review": "This album is what happens when a Math-Rock band supposedly sells out. The group makes the best album of their career. The album is full of catchy hooks and pop-ish melodies, but the classic guitar work a Math-Rock artist is known for isn't lost. The creative tempos, unique tones, and interesting riffs are all still there. Also, the distance from the group's roots made it possible to experiment with Post-Hardcore and a more classic indie approach. The instrumentation here is very virtuous. I can't say much about the lyrics, but the delivery of the vocals is very sentimental and energetic. Moreover, this is maybe the most consistent album of the year, as almost every song is solid, with just a few fillers that are actually pretty decent tracks as well. To put the song names here wouldn't mean anything to me since they're all written in kanji, but I'll put the best tracks' numbers: Track 4, Track 5, and Track 9.",
      "highlights": [
        "Track 4", 
        "Track 5",
        "Track 9"
      ],
      "honorable": 0
    },
    {
      "id": "faye-webster-i-know-i-m-funny-haha",
      "cover": "https://e.snmc.io/i/600/w/7e68a24c3375de83ddb31f1f174905c5/10107956/faye-webster-i-know-im-funny-haha-Cover-Art.jpg",
      "score": "8.5",
      "artist": "Faye Webster",
      "album": "I Know I'm Funny haha",
      "year": 2021,
      "title": "haha",
      "review": "Faye Webster makes alt-country in a very distinctive way. Her music is minimalistic, to the point I barely have what to talk about here. The songs sound simple and soft, with clear melodies followed by melancholic vocals that lead to this soothing aesthetic. The lyrics are great, and Faye's voice is pretty emotional here. The guitar's pitch is serene, and the creativity here lies in the details. But the best thing here is the general mood of the album; it flows easily, with this laid-back, sunset aesthetic that makes my mind wonder. Though not complex indeed, it's a lovely album that stuck a whole lot with me.",
      "highlights": [
        "I Know I'm Funny haha",
        "A Dream With a Baseball Player",
        "Half of Me"
      ],
      "honorable": 0
    },
    {
      "id": "lil-ugly-mane-volcanic-bird-enemy-and-the-voiced-concern",
      "cover": "https://e.snmc.io/i/600/w/e9d7ab23294883512df27984b2340a3d/9420650/lil-ugly-mane-volcanic-bird-enemy-and-the-voiced-concern-Cover-Art.jpg",
      "score": "8.6",
      "artist": "Lil Ugly Mane",
      "album": "Volcanic Bird Enemy and the Voiced Concern",
      "year": 2021,
      "title": "I feel tired and I think I'm done with trying",
      "review": "Listening to the rest of Lil Ugly Mane's career showed me how this album is totally out of the curve. Though the Neo-Psychedelia is often repetitive here (not just because of the one-hour length but also because of the monotone vocals and the similarities between the songs), the songwriting is terrific. The previously mentioned monotone vocals are completely excusable due to the magnificent creative melodies and the inviting and unusual experimentation that fits perfectly the songs. The vocals actually work pretty well because they help to transmit the depressive tone of the album, which never sounds forced but is always genuine and sincere. Experimentation works really well in here, as a resource that brings variation and uniqueness to the songs. The lyrics are just as great as the instrumentation, and the depressive tone blends with a somehow nostalgic feeling that breaks me every listen. Benadryl Submarine, Human Fly, Cold In Here, Styrofoam, Headboard, and Cursor are all between the best of the year, and most of the album is pretty solid, with just a few weak tracks. Maybe a bit too long, yes, but it still is one of the best albums of the year and (maybe I'm stating this too early, but) probably one of the best of the decade that is unfolding.",
      "highlights": [
        "Benadryl Submarine",
        "Human Fly",
        "Cold In Here", 
        "Styrofoam", 
        "Headboard",
        "Cursor"
      ],
      "honorable": 0
    },
    {
      "id": "origami-angel-gami-gang",
      "cover": "https://e.snmc.io/i/600/w/88c91d1124af899157ed01816f00d375/8976042/origami-angel-gami-gang-Cover-Art.jpg",
      "score": "8.6",
      "artist": "Origami Angel",
      "album": "Gami Gang",
      "year": 2021,
      "title": "I wanna be the one that you turn to when everything is out of control",
      "review": "Somewhere City is undoubtedly the best modern Midwest Emo album, arguably the best Midwest Emo album ever, and likely the best album of the 2010s. That said, my expectations were pretty high for this album, and I initially thought it flopped. It's slightly heavier and more exploratory, flirting with a wider variety of genres, which resulted in more variation between the tracks, as well as variation in the quality of the tracks. The record has 20 songs and is almost one hour long. Many songs sound too much alike, and many are just too weak for what we know they can do. <br><br> Also, the fact that it doesn't follow such a strong concept like Somewhere City makes it less endearing. Of course, the lyrics are still fantastic and follow the same themes, but still. Nonetheless, their captivating changes between the melodic and heavier parts is one of the best things in music right now, and the nostalgic, sad, and yet optimistic lyrics are soul-crushing to me. Also, all the Pokémon, Star Trek, and other media references make the nerd inside me drown in joy. And as much as I hate this term, this album is a grower. These songs got stuck in my head and became literal anthems of mine, overcoming my first impression of this album as a less-focused Somewhere City. <br><br> In a way, I think this album feels a bit like The Beatles self-titled (or the White Album), as it explores several different sides of Emo music in a huge catalog of songs that are different but similar enough to fit the same record. They experiment with several different aspects of their music to let their creativity flow. And just like its comparison, the album has plenty of great tracks that are between the band's best material. The best tracks are Möbius Chicken Strip, Mach Bike (those two are strong contenders for my favorite song of the year), Noah Fence, Bossa Nova Corps, /trust, Kno U, Tom Holland Oates, Caught in the Moment and Blanket Statement.",
      "highlights": [
        "Möbius Chicken Strip", 
        "Mach Bike", 
        "Noah Fence", 
        "Bossa Nova Corps", 
        "/trust", 
        "Kno U", 
        "Tom Holland Oates", 
        "Caught in the Moment",
        "Blanket Statement"
      ],
      "honorable": 0
    },
    {
      "id": "sufjan-stevens-and-angelo-de-augustine-a-beginner-s-mind",
      "cover": "https://e.snmc.io/i/600/w/99b1baf87d9cd962f8cb28da97052af3/9569586/sufjan-stevens-and-angelo-de-augustine-a-beginners-mind-Cover-Art.jpg",
      "score": "8.9",
      "artist": "Sufjan Stevens & Angelo De Augustine",
      "album": "A Beginner's Mind",
      "year": 2021,
      "title": "I just wanted to love myself",
      "review": "Alongside Carrie & Lowell, this is Surfjan's best album so far. This guy revolutionized indie folk with clever, smooth, and moody instrumentation alongside deeply emotional lyrics and vocals. His low vocal range is used so smartly that it doesn't sound like a limitation but like an asset. Sufjan's voice carries so many feelings and sounds so sincere it fits perfectly the folky atmosphere in the songs. It's been twenty years since his debut and this guy still is one of the best active musical acts, and that's something you should respect. About Angelo De Augustine, the guy is also very talented. His career is like an extension of Carrie & Lowell, but that doesn't take his merits for the good instrumentation and his soft, calming voice. Now, about the album itself, it has the folkness all their other albums had, but with poppier hooks. This more pop approach allows the album to wander around more influences, causing more variety in songs and making this a less repetitive listen. So in my opinion, it's a slight upgrade. Angelo's addition is also helpful to give the album more variety, adding his unique voice and allowing Sufjan to harmonize with him, presenting us with som of the most beautiful melodies and harmonies to ever exist. The lyricism here is superb and among the best of both of their careers. Simply great.",
      "highlights": [
        "Reach Out", 
        "Back to Oz", 
        "Olympus", 
        "It's Your Own Body and Mind", 
        "Fictional California", 
        "Cimmerian Shade"
      ],
      "honorable": 0
    }
  ],
  "awards": [
    {
      "title": "Best Alternative Album of the Year",
      "nominees": [
        "Gami Gang - Origami Angel",
        "I Know I'm Funny haha - Faye Webster",
        "No Buses - No Buses",
        "Things Take Time, Take Time - Courtney Barnett",
        "CINEMA - The Marías"
      ],
      "winner-sentence": "gg",
      "prize-picture": "https://creativeloafing.com/dl60168?display&x=990&y=990"
    },
    {
      "title": "Best Electronic Album of the Year",
      "nominees": [
        "A Tiny House, in Secret Speeches, Polar Equals - Sweet Trip",
        "Far In - Helado Negro",
        "OK ORCHESTRA - AJR",
        "Menneskekollektivet - Lost Girls",
        "Fishmonger - Underscores"
      ],
      "winner-sentence": "Maybe Electronic fans will complain that Indietronica barely is an Electronic subgenre. Maybe that's why I like it.",
      "prize-picture": "https://upload.wikimedia.org/wikipedia/commons/a/a8/Sweet_Trip_Roby_Valy.jpg"
    },
    {
      "title": "Best Experimental Album",
      "nominees": [
        "Volcanic Bird Enemy and the Voiced Concern - Lil Ugly Mane",
        "For The First Time - Black Country, New Road",
        "HEY WHAT - Low"
      ],
      "winner-sentence": "Maybe not as experimental as some names in the industry, but maybe that's why I like it so much. Also, I think it's a good starting album for more in-depth, experimental listens.",
      "prize-picture": "https://i.scdn.co/image/ab67616100005174f8b444be27df300ff67bde10"
    },
    {
      "title": "Best Extreme Album",
      "nominees": [
        "Holoceno - Papangu",
        "Ultrapop - The Armed",
        "I Became Birds - Home Is Where"
      ],
      "winner-sentence": "LET'S GO BRAZIL.",
      "prize-picture": "https://bassdoom.home.blog/wp-content/uploads/2021/09/papangu-holoceno-paraiba-rym-rateyourmusic-metal-sludge-zeuhl-bandcamp.jpg"
    },
    {
      "title": "Best Folk Album of the Year",
      "nominees": [
        "A Beginner's Mind - Sufjan Stevens & Angelo De Augustine",
        "An Overview on Phenomenal Nature - Cassandra Jenkins",
        "In Silent Days - Brandi Carlile",
        "Bedrock - Hannah Frances",
        "Chemtrails Over The Country Club - Lana Del Rey"
      ],
      "winner-sentence": "Bet you didn't see that coming.",
      "prize-picture": "https://siterg.uol.com.br/wp-content/uploads/2021/08/SUFJAN-STEVENS-E-ANGELO-DE-AUGUSTINE-divulgacao.jpeg"
    },
    {
      "title": "Best Hip Hop Album of the Year",
      "nominees": [
        "Sometimes I Might Be Introvert - Little Simz",
        "Haram - Armand Hammer & The Alchemist",
        "\"Disco\" - MIKE",
        "Call Me If You Get Lost - Tyler, The Creator",
        "From Me to You - Quadeca"
      ],
      "winner-sentence": "Little Simz evolved a lot since her breakout album and dives more into introspection in a modern classic hip hop record. I already said pretty much everything I had to say, but I might also add that there are only a few Hip Hop albums I like better than this one.",
      "prize-picture": "https://www.nme.com/wp-content/uploads/2021/09/LittleSimz_19_HR-credit-Nwaka-Okparaeke.jpg"
    },
    {
      "title": "Best Jazz Album of the Year",
      "nominees": [
        "Talk Memory - BADBADNOTGOOD",
        "God's Trashmen Sent to Right the Mess - Fievel Is Glauque",
        "Promises - Floating Points, Pharoah Sanders & The London Symphony Orchestra"
      ],
      "winner-sentence": "It's been years since a modern jazz album got me like this one did.",
      "prize-picture": "https://lh3.googleusercontent.com/DJAUYHsApEUaSFjAuAzSfGrkFpN1RhE7bZ3UHan38vRqBmKUb1WdZ6yTLfz-t_l7GCxf3zRTbx8I8OUG=w1080-h450-p-l90-rj"
    },
    {
      "title": "Best Pop Album of the Year",
      "nominees": [
        "Private Reasons - Bruno Pernadas",
        "Sour - Olivia Rodrigo",
        "Collapsed In Sunbeams - Arlo Parks",
        "Happier Than Ever - Billie Eilish",
        "Jubilee - Japanese Breakfast"
      ],
      "winner-sentence": "\"Pernadas\" away from Jazz, but still great",
      "prize-picture": "https://www.festivalveraoazul.com/wp-content/uploads/2017/10/VA5_BP_%C2%A9-Vera-Marmelo.jpg"
    },
    {
      "title": "Best R&B Album of the Year",
      "nominees": [
        "Smiling WIth No Teeth - Genesis Owusu",
        "Mood Valient - Hiatus Kaiyote",
        "An Evening With Silk Sonic - Silk Sonic",
        "Juno - Remi Wolf",
        "Stand For Myself - Yola"
      ],
      "winner-sentence": "The album is just as good as the cover. Now take your own conclusions.",
      "prize-picture": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTYdDvrJgcpwNONyn9KKsdEPNQABJisD5Sa3A&s"
    },
    {
      "title": "Best Rock Album of the Year",
      "nominees": [
        "Jodeki - tricot",
        "Comfort To Me - Amyl and The Sniffers",
        "New Long Leg - Dry Cleaning",
        "Shyga! the Sunlight Mound - Psychedelic Porn Crumpets",
        "Drunk Tank Pink - Shame"
      ],
      "winner-sentence": "ランダムな漢字だと思います",
      "prize-picture": "https://consumedmagazine.com/wp-content/uploads/2023/04/tricot@2000x1270.jpg"
    },
    {
      "title": "Best Surprise of the year",
      "nominees": [
        "Volcanic Bird Enemy and the Voiced Concern - Lil Ugly Mane",
        "Sometimes I Might Be Introvert - Little Simz",
        "Happier Than Ever - Billie Eilish",
        "Desculpa Mãe, Eu Sou Indie - Nanasai",
        "30 - Adele"
      ],
      "winner-sentence": "This album was really surprising since it's the first Lil Ugly Mane's record that isn't trash =D.",
      "prize-picture": "https://i.pinimg.com/564x/ec/9b/f7/ec9bf7fd40556f0d9129fa341986259a.jpg"
    },
    {
      "title": "Best Foreign Album of the Year (Africa)",
      "nominees": [
        "Smiling With No Teeth - Genesis Owusu [Ghana]",
        "Afrique Victime - Mdou Moctar [Niger]"
      ],
      "winner-sentence": "Dude's pure style",
      "prize-picture": "https://collectiveartscreativity.com/cdn/shop/articles/1513.jpg?v=1634323389&width=1500"
    },
    {
      "title": "Best Foreign Album of the Year (Asia)",
      "nominees": [
        "Jodeki - tricot [Japan]",
        "No Buses - No Buses [Japan]",
        "Cull Ficle - Asian Glow [South Korea]",
        "Jikan - betcover!! [Japan]",
        "Jubilee - Japanese Breakfast [South Korea]"
      ],
      "winner-sentence": "When will tricot become an anime opening?",
      "prize-picture": "https://thefader-res.cloudinary.com/private_images/w_1440,c_limit,f_auto,q_auto:best/fader15_tricot-140-Edit-_ozy0vd/tricot-gen-f-interview.jpg"
    },
    {
      "title": "Best Foreign Album of the Year (Europe)",
      "nominees": [
        "Private Reasons - Bruno Pernadas [Portugal]",
        "God's Trashmen Sent to Right the Mess - Fievel Is Glauque [Belgium]",
        "Teatro d'ira - Vol. I - Måneskin [Italy]",
        "Space 1.8 - Nala Sinephro [Belgium]",
        "Menneskekollektivet - Lost Girls [Norway]"
      ],
      "winner-sentence": "Gorgeous album",
      "prize-picture": "https://images.mubicdn.net/images/cast_member/454114/cache-335408-1525390908/image-w856.jpg"
    },
    {
      "title": "Best Foreign Album of the Year (North America)",
      "nominees": [
        "Talk Memory - BADBADNOTGOOD [Canada]",
        "Un canto por México vol. 2 - Natalia Lafourcade [Mexico]",
        "Ignorance - The Weather Station [Canada]"
      ],
      "winner-sentence": "Distancing themselves a bit from Hip Hop, this is their best album to date",
      "prize-picture": "https://rollingstone.com.br/wp-content/uploads/badbadnotgood-fotodivulgao.jpg"
    },
    {
      "title": "Best Foreign Album of the Year (South America)",
      "nominees": [
        "Holoceno - Papangu [Brazil]",
        "Desculpa Mãe, Eu Sou Indie - Nanasai [Brazil]",
        "Sophia Chablau e Uma Enorme Perda de Tempo - Sophia Chablau e Uma Enorme Perda de Tempo [Brazil]",
        "Caos e cosmos 1 - Rogério Skylab [Brazil]",
        "Hypnagogia - sonhos tomam conta [Brazil]"
      ],
      "winner-sentence": "O Ave Sangria do metal",
      "prize-picture": "https://roadiecrew.com/wp-content/uploads/PAPANGU-1.jpg"
    },
    {
      "title": "Best Foreign Album of the Year (Oceania)",
      "nominees": [
        "Mood Valient - Hiatus Kaiyote [Australia]",
        "Things Take Time, Take Time - Courtney Barnett [Australia]",
        "Comfort To Me - Amyl and The Sniffers [Australia]",
        "Shyga! the Sunlight Mound - Psychedelic Porn Crumpets [Australia]",
        "L.W. - King Gizzard and The Lizard Wizard [Australia]"
      ],
      "winner-sentence": "Apparently chivalry is not dead",
      "prize-picture": "https://img.redbull.com/images/q_auto,f_auto/redbullcom/2014/11/15/1331690326434_2/hiatus-kaiyote"
    },
    {
      "title": "Best Debut of the Year",
      "nominees": [
        "Smiling With No Teeth - Genesis Owusu",
        "New Long Leg - Dry Cleaning",
        "CINEMA - The Marías",
        "Sour - Olivia Rodrigo",
        "Holoceno - Papangu"
      ],
      "winner-sentence": "Maybe not the most consistent but surely the most promising debut.",
      "prize-picture": "https://images.squarespace-cdn.com/content/v1/593070a42994cad2710a6439/1615549958990-PQTCGJZ7V10MFTZKZR79/ccc.jpg"
    },
    {
      "title": "Best EP of the Year",
      "nominees": [
        "Cobalt - Meaningful Stone",
        "Grand National - Courting",
        "6 Of A Billion - Claire Rosinkranz",
        "To Hell With It - PinkPantheress",
        "Blame Game - Beach Bunny"
      ],
      "winner-sentence": "Meaningful Stone takes a rockier approach than in her debut, but still retains the chill indie elements that made we all like her. I think it is a tad predictable, but it still has plenty of good songs, and Dancing in the rain is already a classic of hers.",
      "prize-picture": "https://lastfm.freetls.fastly.net/i/u/avatar170s/118238d8798f3d45c30b2a1e5b9fac64"
    },
    {
      "title": "Best Album of The Year",
      "nominees": [
        "A Beginner's Mind - Sufjan Stevens & Angelo De Augustine",
        "Gami Gang - Origami Angel",
        "Volcanic Bird Enemy and the Voiced Concern - Lil Ugly Mane",
        "I Know I'm Funny haha - Faye Webster",
        "Jodeki - tricot"
      ],
      "winner-sentence": "Gem.",
      "prize-picture": "https://dailynexus.s3.us-west-1.amazonaws.com/dailynexus/wp-content/uploads/2021/10/03164357/sufjan-stevens.jpg"
    }
  ]
}