{
    "list": [ 
        {
        
        "cover": "https://e.snmc.io/i/600/w/bd16531425d24f1d3a5bd242141a92c9/10321717/carly-rae-jepsen-the-loneliest-time-Cover-Art.jpg",
        "score": "7.7",
        "artist": "Carly Rae Jepsen",
        "album": "The Loneliest Time",
        "year": 2022,
        "title": "I get all my confidence from you",
        "review": "Another Dance-Pop record by Canadian singer Carly Rae Jepsen. Yes, it's more of the same, Carly doesn't change her style at all here. Still, and I don't know exactly why, the songs here are really catchy and fun to listen to. I could compare it to Happier Than Ever because of the weird similarities in these albums' covers, but I don't think that she matured her sound or anything like Billie did, she was just really inspired here. I somehow feel like someone who is enjoying an early 2010s party while listening to the music here, and I dislike either parties, early 2010s, and Dance-Pop. I can't explain why I like this album, but I think Carly made a very consistent and fun album. The more calm and sad pieces also diversify in a very good way here. I recommend Sideways, Beach House, and The Loneliest Time.",
        "highlights": ["Sideways", "Beach House", "The Loneliest Time"],
        "honorable": 1
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/14a87bf41fd814735ff8b775d1492695/10138620/%E6%98%8E%E6%97%A5%E3%81%AE%E5%8F%99%E6%99%AF-asunojokei-%E3%82%A2%E3%82%A4%E3%83%A9%E3%83%B3%E3%83%89-Cover-Art.jpg",
        "score": "7.7",
        "artist": "Asunojokei",
        "album": "Island",
        "year": 2022,
        "title": "What more do you wish for in this sinking paradise?",
        "review": "Blackgaze with J-Rock. An unusual combination, but that works really well. It has some gorgeous melodies, and the weight adds some more depth and body to the music, which is great. I do despise Black Metal guttural vocals and the double pedal drum patterns, but the album has great guitars, both in terms of riffs and textures, and the whole works really well. There are some very japanese choices in the song structures that result in some gorgeous, transcendental moments.",
        "highlights": ["Heavenward"],
        "honorable": 1
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/001849b144c7522aa0c3a2419def3eff/9777497/horsegirl-versions-of-modern-performance-Cover-Art.jpg",
        "score": "7.7",
        "artist": "Horsegirl",
        "album": "Versions of Modern Performance",
        "year": 2022,
        "title": "Sometimes I'm thinking that I lust you but I know it's only love",
        "review": "In their debut, Horesegirl makes a Slacker Rock album with beautiful melodies and nice melodies. The lo-fi production is kind of mediocre, and the songwriting is rather amateur, but this is also part of the charm that the girls' sound has. The songs are a bit too short and the album feels like it is doing too little, but it still is a good debut that shows a lot of space to grow. Beautiful Song and World of Pots and Pans are the standouts here.",
        "highlights": ["Beautiful Song", "World of Pots and Pans"],
        "honorable": 1
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/82f024c0db1632b17a7c8aed23ff214c/10114057/robyn-hitchcock-shufflemania-Cover-Art.jpg",
        "score": "7.7",
        "artist": "Robyn Hitchcock",
        "album": "Shufflemania!",
        "year": 2022,
        "title": "And one day the human race will not be run by bullies",
        "review": "Robyn has been in the best streak of albums in his life in his 60s, and this is something that has to be pointed. His ability to write catchy, yet inventive and emotional Pop Rock tunes only get better. His lyrics are as great as always, and with age, he learned to write lyrics that are just as clever and touchy, but more direct and easily understandable. Here, he has a psychedelic touch that makes those quite simple tracks something else. His voice is as great as ever, and though there is less consistency than in his previous two records, we still have some very inspired tracks, like the opener The Shuffle Man, Noirer Than Noir and One Day (It's Being Scheduled). Another great late record by an artist that is having his best works that late in his career.",
        "highlights": ["The Shuffle Man", "Noirer Than Noir", "One Day (It's Being Scheduled)"],
        "honorable": 1
        },

        {
        
        "cover": "https://e.snmc.io/i/600/w/dcdca8d70ddc47aba9a506710c0ce956/10468331/mike-beware-of-the-monkey-Cover-Art.jpg",
        "score": "7.7",
        "artist": "MIKE",
        "album": "Beware of the Monkey",
        "year": 2022,
        "title": "But perhaps if I sing you the tune, maybe you know the song I am talking about?",
        "review": "MIKE has been one of the most prominent and best rappers in the current scene. Drinking a lot from Earl's Abstract Jazz Rap style, he makes a name for himself by a very unique and charming usage of samples. I'm not the biggest fan of his voice, lyrics, nor flow, but his production is always very interesting, and I think this album is the one that better aligns with my taste, focusing on the jazzy and moody elements and less on rapping itself. Just exactly the kind of Hip Hop I enjoy and recommend. Nuthin I can do is Wrng and What do I do? are the best songs here.",
        "highlights": ["Nuthin I can do is Wrng", "What do I do?"],
        "honorable": 0
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/1da8cf2ed6f569fff85947eb2b450391/9779452/sweet-pill-where-the-heart-is-Cover-Art.jpg",
        "score": "7.7",
        "artist": "Sweet Pill",
        "album": "Where the Heart Is",
        "year": 2022,
        "title": "I am trying to be someone else",
        "review": "I've always had a soft spot for introspective Indie music and everything that comes with that bag. Sweet Pill shows a lot in that regard, with great instrumentation, ranging from Math Rock riffs to anthemic Paramore-like choruses, and the essentials of emo music. The album gets a tad repetitive at times, but it is mostly one good song after another. I think the lyrics could be much more intimate, but the performances from everyone make up for it. A very promising debut to a very interesting emo scene coming to form. Listen to High Hopes and Dog Song to have a taste of them.",
        "highlights": ["High Hopes", "Dog Song"],
        "honorable": 0
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/a3778187b74e6127c01b3ab66cc268bd/9831153/obongjayar-some-nights-i-dream-of-doors-Cover-Art.jpg",
        "score": "7.7",
        "artist": "Obongjayar",
        "album": "Some Nights I Dream of Doors",
        "year": 2022,
        "title": "I think it's time I stop running from myself",
        "review": "In his debut, Obongjayar brings a gorgeous multi-layered Art Pop record with touches of R&B and Soul music. His sound is very unique, as he adds some Ambient influences to the combination and makes this a very atmospheric record. The pianos here are very touchy and the lyrics very creative and self-reflecting. The album lacks a bit of highlights and the vocal performances lack a bit of emotion, but this is a really exciting, innovative, and promising debut. The title track and New Man are the best songs here.",
        "highlights": ["Some Nights I Dream of Doors", "New Man"],
        "honorable": 0
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/adbd71b6c2668adbe0ae16cfbecf299c/9666811/carly-cosgrove-see-you-in-chemistry-Cover-Art.jpg",
        "score": "7.7",
        "artist": "Carly Cosgrove",
        "album": "See You in Chemistry",
        "year": 2022,
        "title": "Once a week, to once a month to once we have the time",
        "review": "I'm not gonna lie: 90% of the reason I gave this album a shot is because of their name. But I'm glad I did it. The album is not a masterpiece by any means, and technically speaking, the band is one of the weakest in the math niche, the singer being really nothing impressive at all. Even so, the songwriting here is actually really impressive. Great melodies with rhythmic chanting choruses, gorgeous guitars, and good lyrics. There's something about them that reminds me a lot of my teenage years, so it brings me a melancholic nostalgia. The album does have a lot of weak tracks, but often they really hit you with a beautiful song accompanied by unnecessarily relatable lyrics. The chamber arrangements in Chowder are gorgeous and make the song even better. Give a chance to The Cooliest? Don't Ruin It, Headaches, and Chowder and see if they click with you as much as they did with me.",
        "highlights": ["The Cooliest? Don't Ruin It", "Headaches", "Chowder"],
        "honorable": 0
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/a28f25f418e6428e2f13badae3ba5f34/10442690/fievel-is-glauque-flaming-swords-Cover-Art.jpg",
        "score": "7.8",
        "artist": "Fievel Is Glauque",
        "album": "Flaming Swords",
        "year": 2022,
        "title": "To be here, to be written, to be gone",
        "review": "Much more intense than their debut, Flaming Swords brings a Rock perspective to the Jazz Pop of the Belgian group. Some really energetic rhythmic patterns, alongside the beautiful horn sessions and polished guitars, make this a much more complete album. Also, the songs are a bit longer, giving them more time to develop themselves. Ma Clément's voice is as pretty as ever, and the prog-ish nature of some songs is very welcome too. My biggest issue and complaint with this album is the problem that most prog albums suffer: they add complexity at expense of the effortless beauty in the simplicity of their previous album. In general, this is a fetching album, that blends its catchy songs with extremely well-structured instrumentation. My favorite tracks here are Flaming Swords, Save the Phenomenon, and To Be Gone.",
        "highlights": ["Flaming Swords", "Save the Phenomenon", "To Be Gone"],
        "honorable": 0
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/be21b311f20dbcf7585e9d1a190f7e4c/10357271/ninos-del-cerro-suave-pendiente-Cover-Art.jpg",
        "score": "7.8",
        "artist": "Niños del Cerro",
        "album": "Suave pendiente",
        "year": 2022,
        "title": "No sé cuánto tiempo es prudente contener el llanto",
        "review": "A very mellow, bittersweet Indie Rock album, with Neo-Psychedelia influences and all the Dream Pop and Shoegaze soundscapes that help to bring this dense, dreamy atmosphere. I really like the vocals here, as well as the creative melodies that make this a very creative record in this overly saturated genre. Some songs fall into repetition, and the album doesn't sustain the quality during the entirety of its 68-minute run, but when they hit it, they really do. I believe this is even better than Lance, more introspective and well-worked. Try Povidona, Tamarugal, and Frío frío.",
        "highlights": ["Povidona", "Tamarugal", "Frío frío"],
        "honorable": 0
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/dfa81865079d8419ec259c7011adbd4d/10282019/tulipa-ruiz-habilidades-extraordinarias-Cover-Art.jpg",
        "score": "7.8",
        "artist": "Tulipa Ruiz",
        "album": "Habilidades extraordinárias",
        "year": 2022,
        "title": "Não aguento mais essa gente se achando gente diferente da gente",
        "review": "The grooviest album I've heard in a long time. It's really hard to listen to Soul and Funk music nowadays that doesn't sound too outdated or too modern, but this is just in the right measure. Her vocals are pretty good, and the instrumentation is really tight ad jammy. I love the bass especially, good pitch and extremely well recorded. I admit that when she focuses on the MPB side of the record, it is very bland, not to say annoying. It weighs down the album, but the good moments, like Estardalhaço, Pluma Black, and Novelos are all great tracks.",
        "highlights": ["Estardalhaço", "Pluma Black", "Novelos"],
        "honorable": 0
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/4dee1aacbf8974afd10eac97068389e1/10242067/king-gizzard-and-the-lizard-wizard-ice-death-planets-lungs-mushrooms-and-lava-Cover-Art.jpg",
        "score": "7.9",
        "artist": "King Gizzard and The Lizard Wizard",
        "album": "Ice, Death, Planets, Lungs, Mushrooms and Lava",
        "year": 2022,
        "title": "The head is death, the tail is death",
        "review": "King Gizzard keeps their ever-changing discography with a jammy Jazz-Rock album. If your look at it, the themes here actually sound a lot like things they did previously in other albums, but much jazzier and jammier, with long improvisational or at least not-repeated parts. The themes are easy to get into and very nice to follow along, but it's hard not to mention the fact that the album often feels unfocused and too carefree for its own sake. I liked this new sound, and it is the best Gizzard album since Infest the Rats' Nest, but it still isn't as good as their prime records. Lava and Gliese 710 are my favorite songs here, but honestly, everything here works better as an album.",
        "highlights": ["Lava", "Gliese 710"],
        "honorable": 0
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/309590815c28eed833a97798f53459b2/10081058/steve-lacy-gemini-rights-Cover-Art.jpg",
        "score": "7.9",
        "artist": "Steve Lacy",
        "album": "Gemini Rights",
        "year": 2022,
        "title": "I wish I knew you wanted me",
        "review": "A huge evolution in comparison to his debut, Lacy made the best, and probably the only mainstream album that I actually enjoyed. His usage of psych guitars in Neo-Soul songs can easily be digested by any Pop fan. His explosion in Tik Tok with Bad Habit made this album be diminished by most music nerds and augmented by the media, but this is a very solid work, with some very intimate moments, good production, instrumentation and vocals, and a very nice pop-ish take on R&B music. Bad Habit is great and deserves its popularity, but Helmet and Amber are just as great.",
        "highlights": ["Bad Habit", "Helmet", "Amber"],
        "honorable": 0
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/915ffa4998ca1c4fd18cdfa2da808f03/9516273/wet-leg-wet-leg-Cover-Art.jpg",
        "score": "7.9",
        "artist": "Wet Leg",
        "album": "Wet Leg",
        "year": 2022,
        "title": "I feel so uninspired. I feel like giving up. But I kinda like it 'cause it feels like being in love",
        "review": "Wet Leg comes as an unexpected hit in the Indie Rock scene. They have the energy and attitude to be popular, of course, with their very sexual and progressive lyrics, but it doesn't really add up to me why they got so popular in the middle of so many groups with that kind of sound. Still, these girls are really good at making simple, catchy phrases and riffs, with monotone but captivating vocals. I think their compositions lack a bit in dynamics, but they nail the atmosphere, and the fantastic melodies in Being in Love, Wet Dream, and Piece of Shit cannot be denied. They have a lot of space for improvement, but this is a very promising debut.",
        "highlights": ["Being in Love", "Wet Dream", "Piece of Shit"],
        "honorable": 0
        },
            {
        
        "cover": "https://e.snmc.io/i/600/w/b39093bfada9aa98f80c4cc8dc7ee353/9723382/wallows-singles-collection-2017-2020-Cover-Art.jpg",
        "score": "8.0",
        "artist": "Wallows",
        "album": "Singles Collection 2017-2020",
        "year": 2022,
        "title": "Quite a people pleaser... If I could only please her",
        "review": "While technically a compilation, this record compiles releases that were only seen as singles (and one different version of an EP song). So, since 90% of the songs are new to album release, and the other one is a different version, I'll allow it. And what's great about this album is that it shows exactly what was good in the early days of Wallows: fantastic vocal melodies, some pretty decent guitar work, and interesting teenage maturing lyrics. The first half has a batch of their early singles, like the fantastic Pleaser and the captivating Pulling Leaves Off Trees. The second half of the album has some tracks that came after their debut EP and album, so it already shows them falling flat and directionless. Still, OK is a great track. Overall, it's not a very cohesive record, but it shows the early days of a band with a lot of potential to be developed.",
        "highlights": ["Pleaser", "Pulling Leaves Off Trees", "OK"],
        "honorable": 0
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/d02981371dfdd00230358fd6d756d48c/9990382/laufey-everything-i-know-about-love-Cover-Art.jpg",
        "score": "8.0",
        "artist": "Laufey",
        "album": "Everything I Know About Love",
        "year": 2022,
        "title": "Everybody's falling in love and I'm falling behind",
        "review": "In her debut, the Icelandic singer brings one album that I didn't think could exist in 2022: a Vocal Jazz album. Inspired by one of my favorite artists of all time, Chet Baker, and other huge names of the genre, she makes a very soothing record, with incredible consistency. The songs all have the same mood, but she manages to be creative and captivate in every single track. The instrumentation is simple but very tasteful, and her voice commands everything in such a nice, beautiful way. The album is a tad repetitive and does not make anything that different, but the stunning harmonies, arrangements, and vocals make this such a lovely, modern take on Vocal Jazz. I recommend Fragile, Dear Soulmate, Everything I Know About Love, and Falling Behind.",
        "highlights": ["Fragile", "Dear Soulmate", "Everything I Know About Love", "Falling Behind"],
        "honorable": 0
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/d86cede261cf73ce82541e4cdaed6cef/9626266/destroyer-labyrinthitis-Cover-Art.jpg",
        "score": "8.0",
        "artist": "Destroyer",
        "album": "LABYRINTHITIS",
        "year": 2022,
        "title": "The band don't need a singer, the band needs needs a helping hand",
        "review": "I love Dan Bejar. His voice is so unique and beautiful, in its own quirky way. In LABYRINTHITIS, the band return to form and release their best album since Kaputt. In this Art Rock and Synthpop album, we have some really touchy, heart-melting tracks, with great production, lyrics, and a consistent tracklist with creative melodies that keep the hazy mood without ever sounding repetitive. I admit that the electronic drumming here really annoys me and make tracks like Suffer much less impressive than it could've been. Still, the artistry here is lovely, and the best tracks here compete with the best of the band's catalog. It's in Your Heart Now, All My Pretty Dresses, and It Takes a Thief are highlights here.",
        "highlights": ["It's in Your Heart Now", "All My Pretty Dresses", "It Takes a Thief"],
        "honorable": 0
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/5cc7889396cf7bbf99b619a9d060282e/9934659/julia-jacklin-pre-pleasure-Cover-Art.jpg",
        "score": "8.0",
        "artist": "Julia Jacklin",
        "album": "PRE PLEASURE",
        "year": 2022,
        "title": "I quite like the person that I am",
        "review": "Julia Jacklin is one of the best songwriters of our generation, and she's back after Crushing with a much more Rock-centered record. Here she has an Indie Rock approach that works just as well. The production is much more naked, which makes the songs more haunting but also more repetitive. Even so, there are no filler tracks here, and the songwriting is consistently strong. Love, Try Not Let Go, I Was Neon, and Magic are masterpieces that rival her best work, and the album as a whole is very strong, even if a bit more tiring and less lush than Crushing.",
        "highlights": ["Love, Try Not Let Go", "I Was Neon", "Magic"],
        "honorable": 0
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/fe1aedd7b248a6544ef9278b50d59f18/10564635/yung-lixo-validation-Cover-Art.jpg",
        "score": "8.0",
        "artist": "Yun Li",
        "album": "Validation",
        "year": 2022,
        "title": "Musiquinha de youtuber? Ah, faça a porra do favor, né",
        "review": "If you told me that a Brazilian gaming Youtuber who also made comedy rap would ever be on my year-end list, I would frenetically laugh. But Yun Li changed his artistic name and made one of the most interesting and intimate Chipmunk Soul albums I know. His lyrics are very hurtful and personal, talking about validation, insecurities, love, family and faith. Yes, the transition between Portuguese and English verses is very weird, but the vocal performance and production are impressively great. Rumo à Vitória, Goddamn, and We Gold are all unbelievably great tracks.",
        "highlights": ["Rumo à Vitória", "Goddamn", "We Gold"],
        "honorable": 0
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/e6efcf346b01e2ea746452a6f043c0f3/9627267/fontaines-d_c-skinty-fia-Cover-Art.jpg",
        "score": "8.1",
        "artist": "Fontaines D.C.",
        "album": "Skinty Fia",
        "year": 2022,
        "title": "And I'll love you 'til the grass around my gravestone is deceased",
        "review": "Skinty Fia is a very somber record, with a permanently dark atmosphere and pessimistic reflections on life and the future. The lyrics are poetic and the instrumentation is tight, even if repetitive at times. It is a very dense and curious album, much more mature than anything I expected from the band. In ár gCroíthe go deo, Jackie Down the Line, The Couple Across the Way, and I Love You are some of the best tracks of the year, even if the album has some weak moments.",
        "highlights": ["In ár gCroíthe go deo", "Jackie Down the Line", "The Couple Across the Way", "I Love You"],
        "honorable": 0
        },
        {
            
            "cover": "https://e.snmc.io/i/600/w/3a44fe92856542e8a92b1cb386a38ded/10115807/kevin-morby-this-is-a-photograph-Cover-Art.png",
            "score": "8.1",
            "artist": "Kevin Morby",
            "album": "This Is a Photograph",
            "year": 2022,
            "title": "Best years of my life I spent dying next to you",
            "review": "As good as Kevin Morby's previous albums were, they felt too attached to Bob Dylan's influences. Here, Kevin makes a soft, tasteful, and cadenced album that keeps consistently interesting throughout its entire run. The lyrics are great and emotional, just like his vocals. He is not reinventing anything, but he gathers his influences and shamelessly makes it his own. His voice sounds like Alex Turner tried to sound in The Car, but with actual soul. Some songs sound too similar, but aside from that, Morby released his best work to date with one beautiful song after another.",
            "highlights": ["Rock Bottom", "A Coat of Butterflies", "Stop Before I Cry", "It's Over"],
            "honorable": 0
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/f4b1cfbc98c10522bbf04051fb7b6e93/9446922/spiritualized-everything-was-beautiful%E2%84%A2-Cover-Art.jpg",
        "score": "8.2",
        "artist": "Spiritualized",
        "album": "Everything Was Beautiful™",
        "year": 2022,
        "title": "If you want another world, I would be another world for you",
        "review": "Spiritualized is back to form with a Symphonic Rock album that resembles Ladies and Gentlemen We Are Floating in Space. They don't reinvent anything, but they use what made them so good in a solid and consistent way. The album has beautiful melodies and arrangements that instantly click with you. With only seven tracks, all of them contribute to the flow of the record. Always Together With You, Let It Bleed (For Iggy), Crazy, and The Mainline Song / The Lockdown Song are all great moments in this very consistent late-career effort.",
        "highlights": ["Always Together With You", "Let It Bleed (For Iggy)", "Crazy", "The Mainline Song / The Lockdown Song"],
        "honorable": 0
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/b41cd2f527f69e937005114c7a615022/9714949/wallows-tell-me-that-it%E2%80%99s-over-Cover-Art.jpg",
        "score": "8.2",
        "artist": "Wallows",
        "album": "Tell Me That It's Over",
        "year": 2022,
        "title": "I'm not alright, but I don't need comfort",
        "review": "In this album, Wallows take their Indie Rock to a whole other level. The songwriting and production improved drastically, with layered instrumentation, nostalgic filters, and even some noise influences. The lyrics are emotional and creative, and when the album hits, it does in a masterful way. There are weak tracks, but the highlights deliver some of the most bittersweet and catchy indie songs of the year. This record shows a great evolution of an unlikely good band.",
        "highlights": ["Hard to Believe", "I Don't Want to Talk", "Marvelous", "Guitar Romantic Search Adventure"],
        "honorable": 0
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/8810e0cdb30d7bf8b69b23d9462b5c53/9932087/black-midi-hellfire-Cover-Art.jpg",
        "score": "8.3",
        "artist": "black midi",
        "album": "Hellfire",
        "year": 2022,
        "title": "Eat Men Eat",
        "review": "I thought black midi was very overrated until I listened to Hellfire. Here they mix their experimental avant-prog with beautiful melodies, great riffs, and intelligent lyrics in a challenging yet accessible way. The chaotic sound astounds you from the first listen and only gets better with time. The transitions between chaotic tracks and jazzy ballads are incredible, especially in songs like 27 Questions. This is easily their best record to date.",
        "highlights": ["Sugar / Tzu", "Eat Men Eat", "Welcome to Hell", "27 Questions"],
        "honorable": 0
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/cdd9e66218c0ad103b44e05a2afb3004/9937079/gumshoes-mister-antigravity-Cover-Art.png",
        "score": "8.4",
        "artist": "Gumshoes",
        "album": "Mister Antigravity",
        "year": 2022,
        "title": "The world revolves around everyone. Everyone but you.",
        "review": "In his debut, Gumshoes makes a fantastic concept record, sounding like something between Destroyer, Fruit Bats, and The Mountain Goats. While the influences are obvious, the songwriting is perfect, with great melodies and emotional performances. The chamber arrangements and poetic lyrics elevate the whole experience, guided by a strong concept that makes everything feel grand and cohesive. Peace on Earth 2, From the Bottom of a Whirlpool, God of Good Harvest, Hermits, and I Don't Do Much Screaming Anymore are the highlights.",
        "highlights": ["Peace on Earth 2", "From the Bottom of a Whirlpool", "God of Good Harvest", "Hermits", "I Don't Do Much Screaming Anymore"],
        "honorable": 0
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/4f648a996a16992718dbfdad45c91b5d/10128558/alvvays-blue-rev-Cover-Art.jpg",
        "score": "8.4",
        "artist": "Alvvays",
        "album": "Blue Rev",
        "year": 2022,
        "title": "Heaven is a place on Earth, and so is hell",
        "review": "Alvvays keeps revolutionizing the industry by not doing anything different. Blue Rev is hazier and more sentimental, with shoegaze aspects, but still full of gorgeous melodies and nostalgic atmosphere. There are filler tracks and some weak guitar solos, but the highs are incredibly strong. Pharmacist, Easy on Your Own?, Many Mirrors, Pomeranian Spinster, and Belinda Says are some of the best indie pop tracks of the year.",
        "highlights": ["Pharmacist", "Easy on Your Own?", "Many Mirrors", "Pomeranian Spinster", "Belinda Says"],
        "honorable": 0
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/05d09bfad018301751bc0b2502df3b56/10442177/sobs-air-guitar-Cover-Art.jpg",
        "score": "8.6",
        "artist": "Sobs",
        "album": "Air Guitar",
        "year": 2022,
        "title": "I liked you better being silly with your air guitar",
        "review": "This Singapore trio is fantastic at creating catchy, youthful Power Pop tunes that sound nostalgic without feeling outdated. The production is great, the vocals are lovely, and the band is very detailed in their arrangements, making every listen rewarding. This is not revolutionary, but it's such a fun and carefully crafted album that it's impossible to resist.",
        "highlights": ["Air Guitar", "Dealbreaker", "Lucked Out", "Friday Night", "Burn Book", "LOML"],
        "honorable": 0
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/2674eba635f88c76c7266b473166df44/10090968/mj-lenderman-boat-songs-Cover-Art.png",
        "score": "8.6",
        "artist": "MJ Lenderman",
        "album": "Boat Songs",
        "year": 2022,
        "title": "All our heroes now are dead",
        "review": "MJ Lenderman's breakout record mixes Slowcore, Slacker Rock, and Alt-Country into one of the most touching albums of the year. His songwriting is emotional and distinctive, supported by lo-fi production and gorgeous melodies. The album is full of highlights and showcases his unique voice and introspective lyrics. You Are Every Girl to Me is one of my favorite songs of the year.",
        "highlights": ["Hangover Game", "TLC Cage Match", "Toontown", "SUV", "Under Control", "You Are Every Girl to Me"],
        "honorable": 0
        },
        {
        
        "cover": "https://e.snmc.io/i/600/w/d41fd89a34689afe2a3c392958a5d40e/9391518/black-country-new-road-ants-from-up-there-Cover-Art.jpg",
        "score": "9.4",
        "artist": "Black Country, New Road",
        "album": "Ants From Up There",
        "year": 2022,
        "title": "It's just been a weekend, but in my mind we summer in France with our genius daughters",
        "review": "February 4th and the discussions of the album of the year were over. This album is just majestic. Its mystic started 4 days prior to its release when frontman, singer, and guitarist Isaac Wood departed from the band to take care of his mental health. That statement was unfortunate, but what I didn't realize at the time was how much of a spoiler it was: Isaac's mind state led to one of the most powerful, emotionally charged albums of modern history. <br><br> In the first few notes of Intro it was already obvious how great this album would be. It was also visible that the band had drastically changed its sound, and I'm very happy they did it because this album sounds less like a collection of songs and more like a big piece of art, in which everything is connected and only achieves its full potential with the rest of the album. Instead of the Experimental Post-Punk of For the First Time, here they have an Indie-ish Post-Rock approach, rich in chamber arrangements, which led to a much more immersive and heartful record. And the tracklist is one gorgeous track after another. My favorites here are Chaos Space Marine, Concorde, Good Will Hunting, The Place Where He Inserted the Blade (probably my favorite songs of the year), and Basketball Shoes (which was the first written song and the ignition point of the album). I also want to note that, though Snow Globes is in its majority a pretty standard Post-Rock track (of course, boosted by all its sentiment), the chaotic drum session followed by the insane, intense, heartbreaking vocals in this song made it something spectacular and exploded all the confusion and desperation the album was building up until that point. <br><br> This album is truly one of a kind, that kind that takes a long time for something to achieve that greatness again. I wish Isaac the best and hope he gets better, and I'm also craving to see the next steps of the group without him. Georgia Ellery already proved to us that she can make good things on her own in I Love You Jennifer B, so let's just wait for what's to come for the band as whole.",
        "highlights": [
            "Chaos Space Marine", 
            "Concorde", 
            "Good Will Hunting", 
            "Mark's Theme",
            "The Place Where He Inserted the Blade",
            "Basketball Shoes"
        ],
        "honorable": 0
        }
    ],

    "awards": [
        {
            "title": "Best Alternative Album of the Year",
            "nominees": [
                "Boat Songs - MJ Lenderman",
                "Air Guitar - Sobs",
                "Blue Rev - Alvvays",
                "Tell Me That It's Over - Wallows",
                "PRE PLEASURE - Julia Jacklin"
            ],
            "winner-sentence": "Not a boat person, but surely a Boat Songs person",
            "prize-picture": "https://coffee-for-two.com/wp-content/uploads/2022/01/lenderman.jpeg"
        },
        {
            "title": "Best Electronic Album of the Year",
            "nominees": [
                "Crest - Bladee & Ecco2k",
                "I Didn't Mean to Haunt You - Quadeca",
                "Crash - Charli XCX",
                "Janky Star - Grace Ives",
                "Giving the World Away - Hatchie"
            ],
            "winner-sentence": "Two artists that I never thought could make something decent made something above decent",
            "prize-picture": "https://i1.sndcdn.com/artworks-000464973009-d53j5z-t500x500.jpg"
        },
        {
            "title": "Best Experimental Album of the Year",
            "nominees": [
                "Hellfire - black midi",
                "I Love You Jennifer B - Jockstrap",
                "While of Unsound Mind - nouns",
                "Ugly Season - Perfume Genius",
                "Church - billy woods x Messiah Musik"
            ],
            "winner-sentence": "The title describes the album well: it's hell, and it's fire.",
            "prize-picture": "https://gerenciador.popload.com.br/wp-content/uploads/2024/08/120824_blackmidi.jpg"
        },
        {
            "title": "Best Folk Album of the Year",
            "nominees": [
                "Mister Antigravity - Gumshoes",
                "This Is a Photograph - Kevin Morby",
                "Dragon New Warm Mountain I Believe in You - Big Thief",
                "Warm Chris - Aldous Harding",
                "Mil coisas invisíveis - Tim Bernardes"
            ],
            "winner-sentence": "You don't find peace, you make it. You make it by listening to this record.",
            "prize-picture": "https://f4.bcbits.com/img/a0737182357_16.jpg"
        },
        {
            "title": "Best Heavy Album of the Year",
            "nominees": [
                "アイランド [Island] - 明日の叙景 [Asunojokei]",
                "Hiss - Wormrot",
                "Baby - Petrol Girls",
                "Close - Messa",
                "Por nós da ventania - Vauruvã"
            ],
            "winner-sentence": "A metal album I like the least when being full-blown metal, but still a great metal album.",
            "prize-picture": "https://musicainstantanea.com.br/wp-content/uploads/2024/08/Asunojokei.jpeg"
        },
        {
            "title": "Best Hip Hop Album of the Year",
            "nominees": [
                "Validation - Yun Li",
                "Beware of the Monkey - MIKE",
                "Sexy - Coco & Clair Clair",
                "Drill Music in Zion - Lupe Fiasco",
                "The Forever Story - J.I.D."
            ],
            "winner-sentence": "Feel yourself validated.",
            "prize-picture": "https://image-cdn-ak.spotifycdn.com/image/ab67706c0000da842dda4334fed0b9ac4f43df7e"
        },
        {
            "title": "Best Jazz Album of the Year",
            "nominees": [
                "Everything I Know About Love - Laufey",
                "Ice, Death, Planets, Lungs, Mushrooms and Lava - King Gizzard and The Lizard Wizard",
                "Flaming Swords - Fievel Is Glauque",
                "Not Tight - DOMi & JD Beck",
                "Feeding the Machine - Binker and the Moses"
            ],
            "winner-sentence": "An interesting and surprisingly modern take on vocal jazz.",
            "prize-picture": "https://jazzoregon.org/sites/default/files/events/Laufey.JPG"
        },
        {
            "title": "Best Pop Album of the Year",
            "nominees": [
                "The Loneliest Time - Carly Rae Jepsen",
                "Special - Lizzo",
                "Beatopia - beabadoobee",
                "Duality - Luna Li",
                "Harry's House - Harry Styles"
            ],
            "winner-sentence": "Yeah I should definitely rethink my taste in music.",
            "prize-picture": "https://i.scdn.co/image/ab676161000051748272bf414106646e0e4a89f3"
        },
        {
            "title": "Best R&B Album of the Year",
            "nominees": [
                "Gemini Rights - Steve Lacy",
                "Habilidades extraordinárias - Tulipa Ruiz",
                "Some Nights I Dream of Doors - Obongjayar",
                "Black Tupi - Tim Soulman",
                "Natural Brown Prom Queen - Sudan Archives"
            ],
            "winner-sentence": "I beg you Tik Tok, stop making good music be labeled as \"that Tik Tok song\".",
            "prize-picture": "https://tecoapple.com/wp-content/uploads/2022/06/stevelacybadhabitv022.jpg"
        },
        {
            "title": "Best Rock Album of the Year",
            "nominees": [
                "Ants From Up There - Black Country, New Road",
                "Everything Was Beautiful - Spiritualized",
                "Skinty Fia - Fontaines D.C.",
                "LABYRINTHITIS - Destroyer",
                "Wet Leg - Wet Leg"
            ],
            "winner-sentence": "Guess it's time for me to convert myself into an Ant believer.",
            "prize-picture": "https://lh3.googleusercontent.com/proxy/MSbPzn2TEJ4YvNe14sAaymlpUnKutkIrA0HLi61U70i5jLZc8ZomRFnDO-J72-PveRLx-N5RLmMjKfGSqey1rkIerG7dzCgDj3NqliuJNn1X_-4kI7Lys1J1"
        },
        {
            "title": "Best Foreign Album of the Year (Africa)",
            "nominees": [
            "Some Nights I Dream of Doors - Obongjayar [Nigeria]",
            "Bronco - Orville Peck [South Africa]"
            ],
            "winner-sentence": "Don't let the lack of competition make you think that this is passable: it actually is great and deserves to be here.",
            "prize-picture": "https://hips.hearstapps.com/hmg-prod/images/obongjayar-esquire-24-10452-1651757216.jpg"
        },
        {
            "title": "Best Foreign Album of the Year (Asia)",
            "nominees": [
            "Air Guitar - Sobs [Singapore]",
            "Hiss - Wormrot [Singapore]",
            "Tamago - betcover!! [Japan]",
            "Beatopia - beabadoobee [Philippines]",
            "Vitamins and Apprehension - Della Zyr [South Korea]"
            ],
            "winner-sentence": "The only way it could be better is replacing all instruments here to air versions of them.",
            "prize-picture": "https://s9.limitedrun.com/images/1604679/v600_TaKXdT88.jpg"
        },
        {
            "title": "Best Foreign Album of the Year (Europe)",
            "nominees": [
            "Skinty Fia - Fontaines D.C. [Ireland]",
            "Everything I Know About Love - Laufey [Iceland]",
            "Flaming Swords - Fievel Is Glauque [Belgium]",
            "Crest - Bladee & Ecco2k [Sweden]",
            "Close - Messa [Italy]"
            ],
            "winner-sentence": "Not the path I wanted the band to take, but it is better than anything I thought they could've done.",
            "prize-picture": "https://www.tenhomaisdiscosqueamigos.com/wp-content/uploads/2020/08/fontaines-dc-ellius-grace.jpg"
        },
        {
            "title": "Best Foreign Album of the Year (North or Central America)",
            "nominees": [
            "Blue Rev - Alvvays [Canada]",
            "LABYRINTHITIS - Destroyer [Canada]",
            "The Loneliest Time - Carly Rae Jepsen [Canada]",
            "The Now Now and Never - what is your name? [Canada]",
            "De todas las flores - Natalia Lafourcade [Mexico]"
            ],
            "winner-sentence": "Not causing any rev in alternative music but still fantastic.",
            "prize-picture": "https://www.rollingstone.com/wp-content/uploads/2022/07/Untitled-5.jpg"
        },
        {
            "title": "Best Foreign Album of the Year (South America)",
            "nominees": [
            "Validation - Yun Li [Brazil]",
            "Habilidades extraordinárias - Tulipa Ruiz [Brazil]",
            "Suave pendiente - Niños del Cerro [Chile]",
            "Mil coisas invisíveis - Tim Bernardes [Brazil]",
            "Por nós da ventania - Vauruvã [Brazil]"
            ],
            "winner-sentence": "RUMO À VITÓRIA",
            "prize-picture": "https://image-cdn-ak.spotifycdn.com/image/ab67706c0000da8493a8e95cbe59a7f37dbed8a8"
        },
        {
            "title": "Best Foreign Album of the Year (Oceania)",
            "nominees": [
            "PRE PLEASURE - Julia Jacklin [Australia]",
            "Ice, Death, Planets, Lungs, Mushrooms and Lava - King Gizzard and The Lizard Wizard [Australia]",
            "Warm Chris - Aldous Harding [New Zealand]",
            "Flood - Stella Donnelly [Australia]",
            "Giving the World Away - Hatchie [Australia]"
            ],
            "winner-sentence": "I was expecting Stella Donnelly to be here, but she disappointed. Julia might not have reached the level of Crushing, but this is still extremely consistent.",
            "prize-picture": "https://www.coupdemainmagazine.com/sites/default/files/article/15373/hero-15373-712273749.jpg"
        },
        {
            "title": "Best Debut of the Year",
            "nominees": [
            "Mister Antigravity - Gumshoes",
            "Everything I Know About Love - Laufey",
            "Wet Leg - Wet Leg",
            "Some Nights I Dream of Doors - Obongjayar",
            "Where the Heart Is - Sweet Pill"
            ],
            "winner-sentence": "Frenetic dude yelling above beautiful layers of instrumentation for frenetic recluses.",
            "prize-picture": "https://f4.bcbits.com/img/a0737182357_16.jpg"
        },
        {
            "title": "Best EP of the Year",
            "nominees": [
            "Weatherglow - Asian Glow & Weatherday",
            "Guitar Songs - Billie Eilish",
            "Depart - Origami Angel",
            "Aérodynes - Fievel Is Glauque",
            "Op.22 Y-Waltz : in Major - Jo Yuri"
            ],
            "winner-sentence": "Weatherday's debut showed potential, but here, alongside Asian Glow, the noise pop reaches another level, mixing midwest emo and math rock into something emotional and weighty.",
            "prize-picture": "https://f4.bcbits.com/img/a0465346081_16.jpg"
        },
        {
            "title": "Best Album of the Year",
            "nominees": [
            "Ants From Up There - Black Country, New Road",
            "Boat Songs - MJ Lenderman",
            "Air Guitar - Sobs",
            "Blue Rev - Alvvays",
            "Hellfire - black midi"
            ],
            "winner-sentence": "Greatest album released in so many years, and, up until now, the best in the 2020s.",
            "prize-picture": "https://static01.nyt.com/images/2022/02/08/arts/07blackcountry-review1/merlin_201346224_3203bed0-0a63-43f4-aafc-d1a5d9ec0df9-superJumbo.jpg"
        }
    ],
  "last_modified":"January 11, 2026 at 00:19"
}