{
  "list": [
    {
      
      "cover": "https://e.snmc.io/i/600/w/9a823fa7b310cfe80c81a41113756502/10581686/tee-vee-repairmann-whats-on-tv-Cover-Art.jpg",
      "score": "7.6",
      "artist": "Tee Vee Repairmann",
      "album": "What's on TV",
      "year": 2023,
      "title": "Killing time or is time killing me?",
      "review": "The production is rough, even for the lo-fi aesthetic it's going for. Still, I love Power Pop, and the mix of this and Garage Punk made such an interesting sound. Some great guitar work and cool lyrics in some very catchy songs. It's short and direct to the point, but pretty good at doing it.",
      "highlights": [
        "Time to Kill",
        "I Can't Figure You Out"
      ],
      "honorable": 1
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/7cd9494c6c4b9a21c24a7675c716b71f/11298712/the-rolling-stones-hackney-diamonds-Cover-Art.jpg",
      "score": "7.6",
      "artist": "The Rolling Stones",
      "album": "Hackney Diamonds",
      "year": 2023,
      "title": "If we go separate ways don't get angry with me",
      "review": "C'mon. It's the Stones. They don't have anything to prove nor anything to add to music. Most of them are in their 80s. And still, they gifted us a new record, full of engaging tunes and their trademark sound, just because they can. Of course, Mick Jagger's vocals sound a little robotic - there's far too much filter in it. It's normal that someone his age is not in perfect tune, but they should know better. Ozzy Osbourne's new records sound the same, so I suppose it's a trend now. The songs are also not unique and unexpected by any means. But I wouldn't want it from them. I simply want a nice set of songs to reminisce about their prime phase, and this album does it perfectly. Angry is a fantastic song and is basically a definition of what they sound like, and the beautiful Sweet Sounds of Heaven is another highlight. If you are a fan of them, you should definitely check it out.",
      "highlights": [
        "Angry",
        "Sweet Sounds of Heaven"
      ],
      "honorable": 1
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/447f475e69192d7cd8fc9aef7dc35430/11000901/horrendous-ontological-mysterium-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Horrendous",
      "album": "Ontological Mysterium",
      "year": 2023,
      "title": "Teach me to tear chitin back, to flirt with fear",
      "review": "I'm not a huge fan of extreme metal. Still, every now and then, I find a band so good that I want to give a chance to a bunch of mediocre ones people say good stuff about. Horrendous is that band. Though very brutal and angsty, the guttering vocals are on the brink of being melodic, and I love the well-crafted guitar riffs that jam with these Prog Metal songs. They are a ferocious band, but they mix that energy pretty well with some interesting guitar work.",
      "highlights": [
        "Chrysopoeia (The Archaeology of Dawn)",
        "Ontological Mysterium"
      ],
      "honorable": 1
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/266e8f169760e4c6a07ca37811101000/11242170/dirty-honey-cant-find-the-brakes-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Dirty Honey",
      "album": "Can't Find the Brakes",
      "year": 2023,
      "title": "We'll drive this life into the ground",
      "review": "Dirty Honey is a retro Hard Rock band that has been making a name for years, and now they seem to be reaching even higher standards. Hugely inspired by Aerosmith, they made a record filled with great, catchy, heavy tunes that will captivate any fan of the genre. Sometimes they do lack some creativity, and the high-pitched vocals do get tiring by the end (even if I love them), but it's undeniable that these guys captured really well the essence of their influences and are full of great tunes. The instrumentation is pretty good too. Listen to Don't Put Out the Fire, with an AC/DC feel to the song, and Can't Find the Breaks.",
      "highlights": [
        "Don't Put Out the Fire",
        "Can't Find the Breaks"
      ],
      "honorable": 1
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/92f02d75b9f9a2849e9777e6702c11f2/10804688/roberto-niederauer-vol-01-1976-1977-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Roberto Niederauer",
      "album": "Vol. 01 1976-1977",
      "year": 2023,
      "title": "You know that love is an act of deceit",
      "review": "He is actually a family friend, so maybe I'm a little biased to include him on the list. Still, it's just a bunch of good old '60s/'70s rock. There's not much to miss here. He is a good songwriter and scraped together a very consistent album with good performances and nice variety. I like the guitar tone, and the recording is pretty good too. My favorites are How I Feel, which sounds like The Beatles meeting Glam Rock, and While I'm Still Here with the beautiful harmonica break.",
      "highlights": [
        "How I Feel",
        "While I'm Still Here"
      ],
      "honorable": 1
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/ccb77e4f7da2712ae451c60cb0317921/11625671/hurricanes-hurricanes-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Hurricanes",
      "album": "Hurricanes",
      "year": 2023,
      "title": "Baby please remember me",
      "review": "Ok, so another retro rock band. I promise the rest of the list will be more diverse. Hurricanes is one of the best bands in the scene right now, and the mood of their songs recaptures that '70s feeling like no other. Thunder in the Storm, in particular, is the best song here and is so '70s sounding that it's actually impressive. The songs are a bit loopy sometimes, but they are usually pretty good. I particularly love Blues Rock, and I'm glad to see some bands showcasing their love for this endangered genre. Also, there's some grand soloing here, which is basically extinct, and I love to see this rare display of solos. A band that won't interest most people, but if you miss that '70s Blues Rock, this album is probably as good as you can get.",
      "highlights": [
        "Thunder in the Storm"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/b2a53b7248c21c21235d29f859d5d315/10294843/samia-honey-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Samia",
      "album": "Honey",
      "year": 2023,
      "title": "When I finally forgive myself I'll be tired and sunburnt",
      "review": "I met Samia a few years ago through a cover of Daniel Johnston's True Love Will Find You in the End. It was not Daniel, but I saw a lot of potential in her. That's why I was disappointed with her debut. Honestly, I just gave this album a chance because it was one of the first albums released in the year. Everyone was saying bad things about it, though, and I wasn't expecting much. To my surprise, Samia kills it here. The production is just as impressive as it was in her other releases, but the lyrics and songwriting have improved drastically. It's just good, poppy singer-songwriter music. Much better than some supergroups around here *cof cof*. The songs also have a dreamy atmosphere that makes them even more beautiful. Her voice is stunning, and the unpretentiousness of the album makes it a very light listening.",
      "highlights": [
        "Charm You",
        "Honey",
        "Dream Song"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/0f99d888c28f31a1f85e25d9390548a4/11229865/ana-frango-eletrico-me-chama-de-gato-que-eu-sou-sua-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Ana Frango Elétrico",
      "album": "Me chama de gato que eu sou sua",
      "year": 2023,
      "title": "E se eu murchar, me regue, insista em mim",
      "review": "Great disco record. I'd be lying if I said I like how Ana Frango Elétrico changed her style from the MPB all-around of her previous record to this boogie, sophisti-pop Americanism. She still is rooted in Brazilian culture, and there's no problem with taking influences from other genres or other countries (as I am writing this in English myself). I only think she was much better in her previous sound. This kind of music doesn't allow her eccentric side to shine, and this sounds like an ordinary album, not something released by someone whose artist name contains Electric Chicken in it. Still, this is beautiful and perfectly produced, with pretty string arrangements and perfectly recorded bass lines. The songs might not be as catchy or impressive as what I got used to, but they are pretty decent overall. Camelo Azul and Insista Em Mim are simply gorgeous, with that Bossa Nova arrangement that makes it sound great. It is not the album we deserved, but it's a good one and proves how talented Ana is.",
      "highlights": [
        "Camelo Azul",
        "Insista Em Mim"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/b0f0e7c0dc7c37b6c2c4b9f6732801b4/10694043/jessie-ware-that-feels-good-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Jessie Ware",
      "album": "That! Feels Good!",
      "year": 2023,
      "title": "It's not that I gave up, I just stopped trying. I had my mind made up on no more crying",
      "review": "Several people are trying to replicate disco music in a modern way, but few can do it like Jessie Ware. She really captured the groovy, dancy, luscious vibes of the music and adapted it to the current music scene. The songs are well-written and well-structured, and I love the large array of influences the album has. This is the best dance record since Future Nostalgia and is another album that makes me question my own taste. This is a significant improvement for her in every aspect, from her singing (which was always excellent but is even better here) to the production to the songwriting. It's a bit irregular, but still, the evolution is impressive.",
      "highlights": [
        "That! Feels Good!",
        "Free Yourself",
        "Hello Love",
        "Freak Me Now"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/d014c2ec73941424ccb46d83eb45c8ce/10877711/snooper-super-snooper-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Snõõper",
      "album": "Super Snõõper",
      "year": 2023,
      "title": "Home grown, human clone",
      "review": "Snooper sounds like Melt-Banana if they had any concerns surrounding your hearing. A more melodic, better performed, and less noisy version of them, but that keeps the fast-paced, straight-ahead punk with high-pitched female vocals, which gives a very Japanese-esque sound to this. It's slightly short and underdeveloped in some aspects, but maybe that's the appeal, just blasting ideas in your face one after another. If you like punk, give it a chance. It's their debut, so I expect great things from them.",
      "highlights": [
        "Pod",
        "Xerox"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/8797ed127919218b89059c72ed0364c6/11461157/earl-sweatshirt-and-the-alchemist-voir-dire-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Earl Sweatshirt & The Alchemist",
      "album": "Voir Dire",
      "year": 2023,
      "title": "Had to stay afloat in a bottomless pit. The trick is to stop fallin'",
      "review": "After the disaster SICK! was, I wasn't expecting anything good by Earl any soon. To my (good) surprise, he teamed up with the unstoppable and fantastic The Alchemist, and the duo released a perfect comeback for Earl. The samples are great, the loopy and moody atmosphere is untouchable, and it works perfectly with Earl's monotonous and yet really engaging voice and rapping. I particularly love the guitars and the jazz elements in these tracks. The lyrics are some of his greatest as well, ranging from emotional bars to nerdy references to basketball, DC Comics, Harry Potter, and whatever other niches Earl's into. I still like Some Rap Songs better, but this is a close runner-up and returns to the exact sound that made me like that album.",
      "highlights": [
        "Vin Skully",
        "Sirius Blac",
        "Free the Ruler"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/97704b14c1c0299bab8f797908989db1/10894599/fruit-bats-a-river-running-to-your-heart-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Fruit Bats",
      "album": "A River Running to Your Heart",
      "year": 2023,
      "title": "Could I be your North Star? Or maybe a river running to your heart?",
      "review": "Fruit Bats is always a synonym for good time, beautiful, and sentimental indie folk. There's nothing I can say about them I haven't said before. This is the tenth record of Eric Johnson's project, and it sounds as fresh and urgent as ever. The capacity it has to put me in a peaceful state of mind is unique and untouched in the highlights here. It has fewer fantastic songs than Gold Past Life, but the best moments here are just as good.",
      "highlights": [
        "Rushin' River Valley",
        "The Deep Well"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/6782065a97336404cfb383fb3a8611d3/10738221/kara-jackson-why-does-the-earth-give-us-people-to-love-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Kara Jackson",
      "album": "Why Does the Earth Give Us People to Love?",
      "year": 2023,
      "title": "Some people take lives to be recognized. Lotta people gonna die to be recognized.",
      "review": "Kara Jackson is a National Youth Poet laureate. That's how I see everyone referring to her. By that, you imagine her lyrics are great, and they are indeed. But what makes Kara special is much more than that. She is a, in her own words, \"pretty top-notch\" singer and songwriter. The songs have a lot of bluesy influences in their folk sound and remind a lot of the late 60s Folk idols. The chamber and country elements are beautiful and give a lot of depth to her music. The melodies are beautiful and very catchy. The album gets a little tiring by the end, but it built enough during the beginning to still be lovely after all. Plus, Liquor is a fantastic song to end the album. Listen to Recognized (mostly poetry, but very catchy and the lyrics are awesome), No Fun / Party, Dickhead Blues (one of the best songs of the year - I want to cry almost every time she sings \"I'm not as worthless as I once thought\"), and Liquor.",
      "highlights": [
        "Recognized",
        "No Fun / Party",
        "Dickhead Blues",
        "Liquor"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/3ba958a2a126ebfbe06e672a0d512c57/11299233/sampha-lahai-Cover-Art.jpg",
      "score": "7.8",
      "artist": "Sampha",
      "album": "Lahai",
      "year": 2023,
      "title": "You're enough evidence for me",
      "review": "Contemporary R&B is a tough genre to appreciate. It became so nullified by the industry that it is basically soulless mainstream music. Sampha is fresh air in this saturated industry, making personal music with ethereal, lush, and spiritual songs, ending in a unique and inspired album. The lyrics are great and intimate, Sampha's voice is beautiful and soothing, and the production is fantastic, creative, and detailed. The album is pretty consistent as well - all songs here are enjoyable. I love how even being a very modern record, we have several influences from the early R&B songs, like in Evidence. The mood does get a bit tiring at some points, but this is a great album that proves how R&B can still be one of the best genres in music if made by people who put their hearts instead of their money into it.",
      "highlights": [
        "Spirit 2.0",
        "Suspended",
        "Can't Go Back",
        "Evidence"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/f098c0d68c0381da9db18805e96e6ae2/10920955/angelo-de-augustine-toil-and-trouble-Cover-Art.jpg",
      "score": "7.8",
      "artist": "Angelo De Augustine",
      "album": "Toil and Trouble",
      "year": 2023,
      "title": "A life where we find out why you're all I dream about",
      "review": "In Toil and Trouble, Angelo De Augustine takes a step away from his main inspiration Sufjan Stevens, while still keeping his influences in showcase. The production here is more complete and detailed, distancing from the naked production of his early records that reminisce Carrie & Lowell so much. I mean, Song of the Siren sounds more like Carrie & Lowell than any other song he wrote before, but the record as a whole tries to get somewhere else. Still, the songs are chill and laid-back, but they seem a bit too simple, to the point some of them are almost unappealing. Even so, the good songs are really gorgeous and catchy, and I like how Angelo always emphasizes the catchy melodies and harmonies, and not only the atmosphere. Some might still see him as a Sufjan rip-off, but he is a fantastic Sufjan rip-off.",
      "highlights": [
        "Memory Palace",
        "Another Universe",
        "Song of the Siren"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/aae7ac8fbd152ced0fb90037ad15ec7e/11454007/frog-grog-Cover-Art.png",
      "score": "7.8",
      "artist": "Frog",
      "album": "Grog",
      "year": 2023,
      "title": "But don't act like you've never lost something that you wanted bad enough to call your bluff or mine",
      "review": "Frog's debut ep was fantastic, and it took some time for Frog to find their feet in their early LPs. Count Bateman was fantastic, with a more laid-back and relaxed approach, but it changed a lot of the aspects that made the band so iconic. With Grog, the band returns to form, even if not at the same level. The record is a bunch of consistent lo-fi indie rock with several anti-folk influences. They always sounded like the personification of outsider music, living recluses of society, and here they sound like these weird duds grew up and became wise mountain hermits. Still, on the edge of society, we have some really great songs with really great lyrics that anyone who relates to or enjoys outsider music will appreciate. The vocals are fantastic and weird, and it really fills all my boxes of what I look for in Frog. It is a bit inconsistent, but it works splendidly as a whole, and I am glad to see these guys developing the quality I know they can do. I love the cover as well.",
      "highlights": [
        "U Shud Go 2 Me",
        "Maybelline",
        "So Twisted Fate"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/3b1f724865febee768c86b5f687c6b53/11532939/candelabro-ahora-o-nunca-Cover-Art.jpg",
      "score": "7.8",
      "artist": "Candelabro",
      "album": "Ahora o nunca",
      "year": 2023,
      "title": "Solo quiero descansar",
      "review": "Now, when the hell did Chile become strong in the indie scene? In the last few years, there have been several great indie acts coming out of it, and Candelabro follows the scene pretty well. Blending indie rock with psychedelic and chamber elements, and just a tad of emo music, they make a sound that is not unique by any means, but is so well done that it's impossible not to get trapped in their world. Refugio II will be a refugee for many indie kids out there, and songs like Dedo chico and Señales complement their catalog really well. I expected a lot from this emerging Chilean scene, and Candelabro will be in the forefront of it for me.",
      "highlights": [
        "Refugio II",
        "Dedo chico",
        "Señales"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/2b23f7e2ac6047bc8c740ece05fb08ea/11102515/olivia-rodrigo-guts-Cover-Art.jpg",
      "score": "7.8",
      "artist": "Olivia Rodrigo",
      "album": "GUTS",
      "year": 2023,
      "title": "Like AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHHHHHHHHHHHHHHHHH",
      "review": "Olivia Rodrigo keeps being the most authentic artist in the mainstream. Our generation's Fiona Apple or Alanis Morissette. In her sophomore record, she made a much more rock-oriented album, falling even deeper in the graces of the critics. Her lyrics are more mature, and her songs are more detailed and cathartic, characteristics that made the best moments in this album phenomenal. Still, I can't pretend it's a huge step forward because this album is much more irregular than the previous one. The bunch of stripped-back ballads in the middle of the album are incredibly flawed. From Making the Bed to The Grudge, there's not a single good moment. The details that made the other songs stand out are nonexistent here. Most of these songs are guided by a tedious and shy piano over her dramatic vocals and youthful lyrics. The other is Get Him Back!, which has one of Olivia's worst performances and a very annoying chorus. Still, she proved she is a great hitmaker and showed she can make a fantastic album, but I think her fantastic albums are still ahead of us. Without those fillers, it would be a masterpiece, though. All-American Bitch, Bad Idea Right?, Vampire (what a sequence!), Ballad of a Homeschooled Girl, and the perfect choice for the closer, Teenage Dream, are all fantastic. It's a shame she ruined such a great experience with so much filler, but I am still excited to see if she can keep up this quality.",
      "highlights": [
        "All-American Bitch", 
        "Bad Idea Right?", 
        "Vampire", 
        "Ballad of a Homeschooled Girl", 
        "Teenage Dream"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/e656f7fec6794604262fbb0a530a8fac/11297500/sophia-chablau-e-uma-enorme-perda-de-tempo-musica-do-esquecimento-Cover-Art.jpg",
      "score": "7.8",
      "artist": "Sophia Chablau e Uma Enorme Perda de Tempo",
      "album": "Música do esquecimento",
      "year": 2023,
      "title": "Eu não sei daonde vem toda essa angústia inconsolável desse coração",
      "review": "Sophia Chablau e Uma Enorme Perda de Tempo came as a very promising indie band under the wing of Ana Frango Elétrico, and in their sophomore album, they already surpassed her (at least in this year). The record is full of great melodies, lyrics no one dares to sing when someone might hear you, and intimate confessions over energetic instrumentals. The vocals are good, the guitar work is remarkable, and the hooks are pretty catchy. Indeed one of the best indie records Brazil has seen and one of the best albums this year. Listen to Quem vai apagar a luz, Segredo, As coisas que não te ensinam na faculdade de filosofia (which has a gorgeous chamber arrangement), and Baby missil (probably my favorite Brazilian song of 2023).",
      "highlights": [
        "Quem vai apagar a luz",
        "Segredo",
        "As coisas que não te ensinam na faculdade de filosofia",
        "Baby missil"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/b4894e92e2977aaeef7c3b142eef2c80/12341560/wednesday-rat-saw-god-Cover-Art.jpg",
      "score": "7.8",
      "artist": "Wednesday",
      "album": "Rat Saw God",
      "year": 2023,
      "title": "The kid from the Jewish family got the preacher's kid pregnant. They sent her off and we never heard too much more about it.",
      "review": "Wednesday's Rat Saw God introduced the band to the general public and achieved the success they deserve as one of the best alternative rock bands in the scene currently. Rat Saw God continues their exploration of suburban towns in an even noisier sound. MJ Lenderman seems to be consolidating his Alt-Country influences in the band now, and we can see a lot of Boat Songs in here (which I love). But I'm not gonna lie, I liked the more melodic approach of Twin Plagues over the absolute noise in here. It is very consistent, and the soundscapes generate a perfect mood that is sustained from start to finish, but it also sounds like every 90s indie rock band that ever existed. That is not a bad thing, 90s indie is amazing. I just can't help but feel they are too samey in here, considering the quality of the musicians here. Still, the songwriting is solid. The second half of Bull Believer is shoegaze heaven. Formula One seems to have come straight-up from MJ Lenderman's Boat Songs but with cleaner production. Quarry is a catchier, less dramatic version of The Burned Down Dairy Queen (and is just as good as the original). Turkey Vultures is Faye Webster gone noisy. Overall, it's a great record, with some wonderful songs and more influence from MJ Lenderman, but a bit too much noise for me at times.",
      "highlights": [
        "Bull Believer",
        "Formula One",
        "Quarry",
        "Turkey Vultures"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/15319d1707d5f776b09a28d9f8c580f5/11145212/lil-ugly-mane-singles-Cover-Art.jpg",
      "score": "7.9",
      "artist": "Lil Ugly Mane",
      "album": "Singles",
      "year": 2023,
      "title": "I could collapse any moment",
      "review": "Lil Ugly Mane tried suicide this year. I know this isn't cool to mention out of nowhere, but I just want to say how glad I am he's still with us, and I hope he gets better. I'd rather have a world in which he's alive and never release anything new than a world where he is dead and we get to see his demos like a way to profit out of misery. Get better soon, Travis. Aside from that, this is a compilation of the singles he has been releasing throughout 2022. This technically is not an album, but since it is a record that compiles songs never seen before in an album, I will allow it. Here we follow LUM's take on alternative rock that we saw in Volcanic Bird Enemy and the Voiced Concern, but without the psychedelic experimentation. The album has a cleaner, more direct sound, but still noisy and depressing. The lyrics are great (for those who relate to them at any level), and his performances are crushing. The album is shorter and more straight-ahead as well, and for that, it doesn't build up as much of a mood as his previous record. Of course, that wasn't a goal since this isn't even a proper album in the first place. The record is quite irregular, and some songs are very skippable. Still, many of them are fantastic and rival his best.",
      "highlights": [
        "Blue Sand",
        "Split Endz",
        "Ricochet"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/563865e68fbe8d69746382c169b8ab2b/10985651/slowspin-talisman-Cover-Art.jpg",
      "score": "8.0",
      "artist": "Slowspin",
      "album": "Talisman",
      "year": 2023,
      "title": "Not that slow of a spin",
      "review": "The Western world has been recently getting interested in South Eastern music. The likes of Arooj Aftab got a decent audience, and when I saw this record being recommended, I thought it would sound exactly like that. Fortunately, I was slightly wrong. Slowspin gets the sound of her home and mixes it with lush, beautiful chamber folk arrangements, with a soothing sound that ends up somewhere between Arooj Aftab and Ichiko Aoba. The songs are spacy and beautiful, contemplative in a gorgeous way. It is not an album to be listened to at any moment, but when you're in the mood for relaxed, beautiful ambient folk music, this record is one of the best options. I highly recommend it for fans of any of the artists previously mentioned.",
      "highlights": [
        "Piya",
        "Remains for Me",
        "Trails"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/12d51dc1ccd0e246770f73e3189420f5/11429205/reverend-kristin-michael-hayter-saved-Cover-Art.jpg",
      "score": "8.0",
      "artist": "Reverend Kristin Michael Hayter",
      "album": "SAVED!",
      "year": 2023,
      "title": "Jesus said, \"Get some new friends 'cause these ones are going to Hell\"",
      "review": "I must admit I never liked Lingua Ignota. All her music sounded like she was trying really hard to prove she was a great singer and could be experimental, and in the end, her songs had no musicality in them. It was a mash-up of two of my most hated tropes, the over-singer and the \"look at me I'm noisy and very experimental\"-er. With SAVED!, Kristin Hayter released a lo-fi gospel album that sounds much darker and more sinister than anything she released in her previous project. The lyrics are fantastic and downright morbid, and her singing is much more natural and emotional here (of course, we still get some show-off moments, but these are so emotional that they work perfectly). The album is really consistent, unique, sad, and sadistic. The music is sparse, ghostly, and beautiful, and the classic lo-fi recording in 4-track equipment completes the atmosphere. It also never sacrifices quality. She knows precisely when the lo-fi works and when cleaner production is the best choice. I'll give you that it is a bit monotone and can get tiresome at the end, mainly because many tracks are overextended, but the overall result is a powerful, twisted take on gospel music that shows a new side to the genre and promises great music in Hayter's future.",
      "highlights": [
        "I Will Be With You Always", 
        "May This Comfort and Protect You", 
        "I Know His Blood Can Make Me Whole"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/233637a9abccd4f98315d5c0399f81d7/10297048/paramore-this-is-why-Cover-Art.jpg",
      "score": "8.0",
      "artist": "Paramore",
      "album": "This Is Why",
      "year": 2023,
      "title": "You're either with us or you can keep it to yourself",
      "review": "In This Is Why, it's visible how much Paramore evolved and matured their sound, going from the pretentious Emo and Pop Punk from their early works to some pretentious but elaborate and a tad more mature Post-Punk. Being so, this is their most inspired album instrumentally speaking, with unique, different rhythmic patterns, that sometimes even remind me of early Arctic Monkeys. Of course, some songs are a bit formulaic, but that doesn't overshadow the several bright moments. Also, the great songs here are some of the best in the entire band's catalog. Hayley Williams seems to have realized that literally every song is better if the singer is not trying to show how great their range is every 5 seconds as well. That makes these her best performances overall. The cover is really cool as well.",
      "highlights": [
        "This Is Why",
        "The News",
        "C'est comme ça"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/cf26c55cd69879fd87f9668d72230227/10775791/mckinley-dixon-beloved-paradise-jazz-Cover-Art.jpg",
      "score": "8.0",
      "artist": "McKinley Dixon",
      "album": "Beloved! Paradise! Jazz!?",
      "year": 2023,
      "title": "All that glitters aint gold",
      "review": "When he is making Neo-Soul music hugely inspired by Jazz, McKinley Dixon proves himself one of the best songwriters of modern music. The lyrics are good, and so is his voice, both for singing and rapping. The usage of actual instruments gave it a lot of density and dynamic, the kind of feelings that electronic instruments can't ever capture. That alone makes him much better than any other Hip Hop artist. Some of the more rap-focused songs are not that good, and that makes the album a bit irregular. Even so, the good moments here are really something else, and this is a contender for the best rap album I've ever listened to. If you have any interest in a modern take on jazz or Hip Hop in general, give it a chance.",
      "highlights": [
        "Sun, I Rise",
        "Run, Run, Run",
        "Live! from the Kitchen Table",
        "Tyler, Forever"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/957b1e49932d0173ea02102bdfec94d4/11054580/sparklehorse-bird-machine-Cover-Art.jpg",
      "score": "8.0",
      "artist": "Sparklehorse",
      "album": "Bird Machine",
      "year": 2023,
      "title": "And when I dream, it almost seems like I've been with her a while",
      "review": "Bird Machine is a great collection of songs from one artist who left us far too soon. Beautiful, emotional, and great in every aspect the albums he released in life were. It is a shorter album, which is something good since it ended before getting overwhelming. It was recorded in 2009, so this was probably supposed to be his return to his old sound, which would be a pleasant return. The lo-fi alt-country here is on point, and the chamber pop songs are simply beautiful. It sounds like an ode to every part of his career in some way, and even if I wish he was alive to put it out to us, it is a beautiful ending to the journey of this great artist. May your legacy be remembered, Mark.",
      "highlights": [
        "Hello Lord",
        "Daddy's Gone",
        "The Scull of Lucia"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/25ad2b48502d9ffd35c962fd6cbd8f06/11229386/sufjan-stevens-javelin-Cover-Art.png",
      "score": "8.1",
      "artist": "Sufjan Stevens",
      "album": "Javelin",
      "year": 2023,
      "title": "I was the man still in love with you when I already knew it was done",
      "review": "This year was great for music, but it was terrible for musicians. The amount of people releasing deeply personal sad music is alarming. I'm sad Sufjan had to go through that, but the inspiration resulted in music that will surely help several people go through a lot of stuff. Here, Sufjan brings back influences from every phase of his career in another gorgeous record. From the sad existentialism in Carrie & Lowell to the electronic influences from The Age of Adz, and the chamber production of Illinois and the pre-Illinois records, on we go. His voice seems more limited than usual (maybe even because of his health state?), and he doesn't bring a lot of new sides to his music. Lyrically speaking, it is one of his weakest efforts to date as well (which by his standards only means it's not utterly heartbreaking). Still, it is a great addition to his discography with some very impressive pieces of music and a general gorgeous feeling. You know you can't go wrong with Sufjan.",
      "highlights": [
        "Goodbye Evergreen",
        "Will Anybody Ever Love Me?",
        "So You Are Tired"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/b115611b40f094ca27713495c90b1d00/11646854/willy-rodriguez-wetdream-Cover-Art.jpg",
      "score": "8.1",
      "artist": "Willy Rodriguez",
      "album": "Wetdream",
      "year": 2023,
      "title": "'Cause dashers coming up to worry me tonight",
      "review": "Sounds like Weatherday, but feels like Car Seat Headrest. In Wetdream, Willy Rodriguez drastically changes their sound to something much bigger and more ambitious than the band was accustomed to. The band now incorporates noise perfectly, giving more depth, rawness, and weight to the songs. It's never used as a way to mask or overcome the lack of quality in the songwriting, but as a perfect balance to the creative melodies, great instrumentation, vocals, lyrics, strong climactic structures, detailed mixing, and an impactful emotional tone. There's still some fillers, though, and the last song had no need to be this long since it's smashing together seven songs that don't have much coherence between themselves. Some people theorize about themes of abuse, but the band apparently said the songs were all written separately. Still, some of its segments are devastatingly beautiful. Overall, it's one of the best and most creative indie albums I've listened to in a long time, with some of the most beautiful and catchy melodies. The acoustic guitars here are lovely as well. The Waiting For the Day drum pattern in Rosemary is also a fantastic reference, one of the most iconic drum lines ever.",
      "highlights": [
        "*Untitled*",
        "Stop Calling",
        "Parts 4 and 5 of Revisited"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/69b56c7dd752157030ee746a50388c22/10988195/hail-the-sun-divine-inner-tension-Cover-Art.jpg",
      "score": "8.2",
      "artist": "Hail the Sun",
      "album": "Divine Inner Tension",
      "year": 2023,
      "title": "I'll never change, I am the way I fluctuate",
      "review": "Hail the Sun is one of the definitive emo bands for me. The way they mixed Post-Hardcore with Prog-Rock is still one of the most groundbreaking and unexpected mixes of genres I know. I love their melodic choruses and heavy instrumentals. As an emo kid and prog nerd wannabe myself, it's impossible not to be happy with this comeback to the fantastic Wake sound. Well, this album is much more inconsistent than Wake, and it's easy to get tired towards the end. Even so, the highlights here are so groundbreaking that it's impossible not to be impressed. The beginning of the album is especially fantastic. The lyrics are great, and the band is maybe in their best form (there are some truly killer instrumentals here). The guitar tone is fantastic, the production is grand, the drumming is intense, and I love Donovan Melero's vocals. Mind Rider (this Chris Squire-like bass is perfect), Chunker, and 60-Minute Session Blocks are the go-to songs here.",
      "highlights": [
        "Mind Rider",
        "Chunker",
        "60-Minute Session Blocks"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/22e53facdd0f0bfe9711f7349e60a801/10281948/the-murder-capital-gigis-recovery-Cover-Art.jpg",
      "artist": "The Murder Capital",
      "score": "8.2",
      "album": "Gigi's Recovery",
      "year": 2023,
      "title": "I always wanted it to be like this for us. Having our first kid, name her Ethel",
      "review": "Gigi's Recovery is an ode to all the 80s Gothic Rock bands that marked our lives. I mean, we have a lot of Post-Punk bands nowadays that it's inconclusive if they are trying to replicate or update the magic of these bands, but most of them fail miserably in doing both or end up making something unique that doesn't resemble their influences. The Murder Capital captures that feeling perfectly and gives a more modern, indie-esque approach. We have everything: the great melodies and hooks, the fast-paced guitars that shouldn't work with such sad lyrics - but do work, and, of course, the constant sadness in both the mood of the song and the lyrics. The album is very consistent and has several songs that could easily become emo anthems if only released in the '00s. Ethel particularly breaks me, an ode to everyone who saw more future in a relationship than the other person. So I'd recommend this to all the emo and goth people who are still around for beautiful melodies and feelings. Listen to Crying, Ethel, and Only Good Things.",
      "highlights": [
        "Crying",
        "Ethel",
        "Only Good Things"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/12007cb306a215c41385600b272e0f61/10816435/geese-3d-country-Cover-Art.jpg",
      "score": "8.3",
      "artist": "Geese",
      "album": "3D Country",
      "year": 2023,
      "title": "The day the cowboy cried and I gave up on love and you gave up on light",
      "review": "Geese changes their sound to something much in my realm. In 3D Country, they leave some of the punk nature of their previous work to focus on a sing-along Indie Rock with Soul, Contry, and lots of Blues and Roots Rock influences embedded in it. The band shows a fantastic knack for melodies, and are able to perfectly balance the ballads and the heavy songs. Although not bringing nothing absolutely new to the game, tha band blands all their influences in a very unique and authentic way, making a very creative record. I really enjoy the singing and the guitar work in here, and although it is not the most cohesive work I've ever listened to, it is full of highlights and the essence of the group is always there. When they try to be too experimental, the songs end up slightly upsetting, but the best songs compensate for those. 2112 sounds like a noisy version of The White Stripes and opens up kicking everything away. I See Myself sounds like something off of Brothers-era The Black Keys, Crusades is something that Lou Reed could easily have written, Gravity Blues sounds like John Mayer Trio live, and still, they still sound unique in each of these songs. A great band overall, making a great throwback to sounds that I love (garage rock, bluesy country rock,...).",
      "highlights": [
        "2122",
        "3D Country",
        "Cowboy Nudes",
        "I See Myself",
        "Crusades"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/3c6c12376a6a010726332bcb3ac95207/10875269/oracle-sisters-hydranism-Cover-Art.jpg",
      "score": "8.4",
      "artist": "Oracle Sisters",
      "album": "Hydranism",
      "year": 2023,
      "title": "Modern love on your mobile phone, in a dark room, all alone, texting someone you used to know",
      "review": "Every now and then, YouTube pops up a video clip of a random band I never heard about in my home. Usually, the song is forgettable, but Tramp Like You caught my attention immediately. After listening to the entire record, I realized it wasn't just a good song but a work of a very talented band. The album is a bunch of beautiful, well-crafted pop songs that throwback to the '60s without sounding retro. I love the production here. The instruments are perfectly recorded, sounding loose and airy, and simply fit the songs like a glove. The songs are all pretty and sweet, and they all have nice melodies that make each of them catchy and unique. I love the singing too (both male and female), and there's enough variation so the album never gets boring. A beautiful, chill, and melodically creative record that never fails to give you a great time. That kind of unpretentious pop music seems to be gone since the 70s, and I'm thankful for them to make such a gorgeous record that is very emotional even so.",
      "highlights": [
        "Tramp Like You",
        "RBH",
        "Cigale Song",
        "Sailor Song",
        "Modern Love"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/604d2cf7dcc3de73e60d2e41809c11df/11191833/wilco-cousin-Cover-Art.jpg",
      "score": "8.4",
      "artist": "Wilco",
      "album": "Cousin",
      "year": 2023,
      "title": "I outlived my dreams",
      "review": "Wilco might be the band that has lyrics I most relate to, so I always go to a Wilco record expecting something good. This album is honestly one of Wilco's best. I mean, it's like 5th, but that is a fantastic position in Wilco's discography. The album is set somewhere between the magic simplicity of Sky Blue Sky and the psychedelic experimentations of The Whole Love. Though we have plenty of gorgeous, melodic, contemplative tracks, we also have a lot of synths and psychedelic experimentation going on in the background, adding depth and nuance to these simple compositions. Lyrically speaking, this is one of Wilco's best as well, with plenty of soul-crushing lines that made me cry. Pittsburgh's confessional lyrics include some of their most memorable passages, like \"I've always been afraid to sing [...] Somehow, that's all I do\". The self-defeat in Evicted's \"I'd laugh until I die, if it wasn't my life\" and \"I'm never gonna see you again. I'm evicted from your heart, I deserve it\". The disaster in Tweedy's voice while singing \"And I'm lost\" in Sunlight Ends. I went back to this record a lot throughout the year, and it even made me go back to the entirety of Wilco's discography. Twice. So yes, this is a fantastic release by one of my favorite bands, which I honestly thought was now just lost in the past (after a few very dismissable records).",
      "highlights": [
        "Infinite Surprise",
        "Evicted",
        "Sunlight Ends",
        "Pittsburgh",
        "Meant to Be"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/aee871644664e8291857b9760a5f57e1/11007527/foo-fighters-but-here-we-are-Cover-Art.jpg",
      "score": "8.4",
      "artist": "Foo Fighters",
      "album": "But Here We Are",
      "year": 2023,
      "title": "There's no getting over it",
      "review": "Foo Fighters was one of my formative bands. They helped introduce me to rock music and helped me fall in love with it. So when I heard that Taylor Hawkins passed away, it was actually sad to me. But I think that in the end, we all knew that Grohl would eventually overcome the death of his best friend and bandmate and keep on going because that's what Taylor would want him to do. Adding it to Dave's mother's death, we have But Here We Are. A record about dealing with loss. And few people have more experience to talk about it than Dave. And this album is fantastic. Dave gets in the drums once again (great choice. If there's someone who should replace Taylor, it was him) and provides us a great set of powerful songs. We still have great riffs and nice solos, and Grohl's vocals are just as good as in his prime, with his iconic screamings more emotional than ever. The songs go through some classic Foo Fighters like the title track, Nothing at All, and Rescued, but also add enough variation to surprise me. We have some ballads - they are a bit corny, yes, but the lyrics are some of his best. They also flirted with shoegaze in tracks like Show Me How, The Teacher, and Rest. God, we even got some Big Me-like Power Pop in Under You (contender for best song of the year, I wish I didn't cry so many times to this song). The production is quite rough sometimes, especially in the shoegaze tracks, but nothing that ruins the experience. Overall, this is a great record, with some of the best lyrics from the band, and songs ranging through various influences, once again facing life's obstacles heads up and giving us one banger after another. I recommend Rescued, Under You, The Glass, and Nothing at All, plus Rest if you can get through the terrible production in the second half.",
      "highlights": [
        "Rescued",
        "Under You",
        "The Glass",
        "Nothing at All",
        "Rest"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/a89078df46e56e875f5bbd99505007ec/11102391/black-country-new-road-live-at-bush-hall-Cover-Art.jpg",
      "score": "8.7",
      "artist": "Black Country, New Road",
      "album": "Live at Bush Hall",
      "year": 2023,
      "title": "Don't waste your pearls on me, I'm only a pig",
      "review": "I think every BCNR fan was worried about what Isaac Wood's departure meant for the band. Thankfully, it doesn't mean much more than that Isaac is not around anymore. The group decided to record a new bunch of songs right away to keep the good streak, and that was a terrific decision. Avoiding the pressure to make the studio follow up on their fantastic sophomore effort, they also decided to release these songs in a live album, another flawless move. Altogether, they decided to split the vocals between the band members, not having a fixed someone taking Isaac's role. They literally did everything right. Of course, none of this would matter if the songs weren't as good as they were when he was around, but they proved what we kind of already knew from the start: the writing is a group effort. And what a group effort! The songs here are a bit poppier (probably because of the decrease in the number of guitars) but always extraordinarily tasteful and beautiful. They are always quite experimental and unique but never getting close to being hard to digest. With three records, each one of them sounding pretty unique both in their discography and in general terms, the common point in all of them is that they have the perfect measure of accessibility and experimentation. This is a bit more irregular than Ants From Up There, but it only means that not every song is absolutely amusing. However, the best moments are just as good, and pretty much everything is worth listening to. The instrumentation is as gorgeous as ever and they all handled the vocals wonderfully, especially Tyler Hyde. I'm delighted they handled the difficult situation perfectly and released two albums of the year back to back.",
      "highlights": [
        "Up Song",
        "Across the Pond Friend",
        "Laughing Song",
        "Turbines / Pigs"
      ],
      "honorable": 0
    }
  ],
  "awards": [
    {
      "title": "Best Alternative Album of the Year",
      "nominees": [
        "Cousin - Wilco",
        "This Is Why - Paramore",
        "Bird Machine - Sparklehorse",
        "Singles - Lil Ugly Mane",
        "Wetdream - Willy Rodriguez"
      ],
      "winner-sentence": "A return to form and a very personal one",
      "prize-picture": "https://i0.wp.com/fitabruta.com.br/wp-content/uploads/2011/09/wilco_2011.jpg?fit=1200%2C740&ssl=1"
    },
    {
      "title": "Best Electronic Album of the Year",
      "nominees": [
        "Ooh Rap I Ya - George Clanton",
        "Intercepted Message - Osees",
        "O Amor, o perdão e a tecnologia irão nos levar para outro planeta - FBC"
      ],
      "winner-sentence": "Just like all Clanton's albums, this is very chill and calm, but never gets boring or uninventful.",
      "prize-picture": "https://www.100percentelectronica.com/cdn/shop/collections/george-clanton-247050.jpg?v=1702967402"
    },
    {
      "title": "Best Experimental Album of the Year",
      "nominees": [
        "Oh Me Oh My - Lonnie Holley",
        "Softscars - Yeule",
        "Picture of Bunny Rabbit - Arthur Russell"
      ],
      "winner-sentence": "Lonnie talks about the oppression of black people in a way that many pretentious rappers wish they did. A deeply emotional and intimate record, but that after everything he's been through, gives a positive and hopeful message. Nice experimentations and a true journey through black music influences, from Soul to Jazz experimentalism, guided by a lot of poetry.",
      "prize-picture": "https://npr.brightspotcdn.com/dims4/default/c9eef5d/2147483647/strip/true/crop/700x700+0+0/resize/880x880!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F3b%2F9f%2Fc3eb957c44dca7c1a948e0c6776f%2Flonnie-003-1620924420.jpeg"
    },
    {
      "title": "Best Folk Album of the Year",
      "nominees": [
        "Javelin - Sufjan Stevens",
        "Talisman - Slowspin",
        "SAVED! - Reverend Kristin Michael Hayter",
        "Toil and Trouble - Angelo De Augustine",
        "Why Does the Earth Give Us People to Love? - Kara Jackson"
      ],
      "winner-sentence": "It's Sufjan. If you want to cry to beautiful music, you know where to go.",
      "prize-picture": "https://rollingstone.com.br/wp-content/uploads/2023/10/sufjan-stevens-photo-by-kevin-winter-getty-images.jpg"
    },
    {
      "title": "Best Heavy Album of the Year",
      "nominees": [
        "Divine Inner Tension - Hail The Sun",
        "Super Snõõper - Snooper",
        "Ontological Mysterium - Horrendous",
        "PetroDragonic Apocalypse; or, Dawn of Eternal Night: An Annihilation of Planet Earth and the Beginning of Merciless Damnation - King Gizzard and The Lizard Wizard",
        "93696 - Liturgy"
      ],
      "winner-sentence": "This year had many returns to form. This is another one, and it happened to one of the bands I wanted the most. One of the best Post-Harcore / Emo bands I know.",
      "prize-picture": "https://f4.bcbits.com/img/0013968358_25.jpg"
    },
    {
      "title": "Best Hip Hop Album of the Year",
      "nominees": [
        "Beloved! Paradise! Jazz!? - McKinley Dixon",
        "Voir Dire - Earl Sweatshirt & The Alchemist",
        "Burning Desire - MIKE"
      ],
      "winner-sentence": "Jazz Rap that actually has jazz instrumental and not just a blow in a saxophone every 10 seconds. One of the best rap albums I've ever heard.",
      "prize-picture": "https://i.scdn.co/image/ab67616d00001e027f225e8158d390c5074f1909"
    },
    {
      "title": "Best Jazz Album of the Year",
      "nominees": [
        "Knower Forever - KNOWER",
        "New Blue Sun - André 3000",
        "Seeking the Sources of Streams - Cicada"
      ],
      "winner-sentence": "Not a great year for jazz. I mean, I liked the record, and I'm the President and Do Hot Girls Like Chords? are pretty good songs, but it's very irregular and predictable at times. Still, I like the funky bass and the vocals in the songs. It's probably the least jazzy album of those 5, but again, it's not a good year for the genre.",
      "prize-picture": "https://f4.bcbits.com/img/0032231318_25.jpg"
    },
    {
      "title": "Best Pop Album of the Year",
      "nominees": [
        "Hydranism - Oracle Sisters",
        "GUTS - Olivia Rodrigo",
        "That! Feels Good! - Jessie Ware",
        "Honey - Samia",
        "Azul - Maria Luiza Jobim"
      ],
      "winner-sentence": "A gorgeous album and a great throwback to times in which the beauty laid in the simplicity and sincerity of the songs.",
      "prize-picture": "https://lastfm.freetls.fastly.net/i/u/ar0/4ea97ba5692f542fc7c1cb0d5d5cd88b.jpg"
    },
    {
      "title": "Best R&B Album of the Year",
      "nominees": [
        "Lahai - Sampha",
        "Me chama de gato que eu sou sua - Ana Frango Elétrico",
        "Erotic Probiotic 2 - Nourished by Time"
      ],
      "winner-sentence": "One of the best producers in mainstream music makes the best and least mainstream album a mainstream artist could've done.",
      "prize-picture": "https://pyxis.nymag.com/v1/imgs/294/3af/215ca83d30ad0e77d84af4eeea7dda8ce2-Sampha-by-Renell-Medrano.1x.rsquare.w1400.jpg"
    },
    {
      "title": "Best Rock Album of the Year",
      "nominees": [
        "Live at Bush Hall - Black Country, New Road",
        "But Here We Are - Foo Fighters",
        "3D Country - Geese",
        "Gigi's Recovery - The Murder Capital",
        "Hurricanes - Hurricanes"
      ],
      "winner-sentence": "I like this New Road they're following.",
      "prize-picture": "https://media.timeout.com/images/106023914/750/422/image.jpg"
    },
    {
      "title": "Best Foreign Album of the Year (Africa)",
      "nominees": [
        "Zango - Witch [Zambia]",
        "Sorry I Haven't Called - Vagabon [Cameroon]",
        "Struggler - Genesis Owusu [Ghana]"
      ],
      "winner-sentence": "Witch was one of the most successful and relevant Zamrock bands, and to see that their popularity growth thanks to the internet culminated in a return including a new record is fantastic. This album is more influenced by African rhythms than any of their other records, and by so, it is much more jammy and has much less psychedelic inspiration. It's still pretty good, but I like their psychedelic days better. Even so, the mere existence of this record is something to be happy with. The opener is my favorite song here, check it out.",
      "prize-picture": "https://www.rollingstone.com/wp-content/uploads/2023/04/WITCH.jpeg?w=1581&h=1054&crop=1"
    },
    {
      "title": "Best Foreign Album of the Year (Asia)",
      "nominees": [
        "Talisman - Slowspin [Pakistan]",
        "Softscars - yeule [Singapore]",
        "Seeking the Sources of Streams - Cicada [Taiwan]",
        "After the Magic - Parannoul [South Korea]",
        "Dreamglow - Asian Glow & sonhos tomam conta [South Korea]"
      ],
      "winner-sentence": "A very unique album from this debuting artist. I expect a lot from her in the future, and it's a shame she's not getting much recognition",
      "prize-picture": "https://images.squarespace-cdn.com/content/v1/5fd390d91143884777b1598b/9df76ac8-0645-4f65-870d-d7d1d2690a88/Zeerak+Ahmed+%3A+Slowspin+2023+-+Alyse+Nelson.jpg"
    },
    {
      "title": "Best Foreign Album of the Year (Europe)",
      "nominees": [
        "Hydranism - Oracle Sisters [France]",
        "Gigi's Recovery - The Murder Capital [Ireland]",
        "Le Cri du Caire - Le Cri du Caire [France]",
        "Blómi - Susanne Sundfør [Norway]",
        "Chaos for the Fly - Grian Chatten [Ireland]"
      ],
      "winner-sentence": "It's elegant in a way only a stereotyped French could be",
      "prize-picture": "https://substackcdn.com/image/fetch/$s_!m8r-!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0eac25bb-b046-4b06-ae5e-578dfbf9161a_2400x1600.jpeg"
    },
    {
      "title": "Best Foreign Album of the Year (North or Central America)",
      "nominees": [
        "Nico Paulo - Nico Paulo [Canada]",
        "The Loveliest Time - Carly Rae Jepsen [Canada]",
        "My Name Is... - what is your name? [Canada]",
        "The Enduring Spirit - Tomb Mold [Canada]"
      ],
      "winner-sentence": "Beautiful, lovely folk music. It lacks catharsis but works pretty well in general.",
      "prize-picture": "https://therodeomag.com/wp-content/uploads/2023/04/Nico_by_Matt_Horseman_2-scaled.jpeg"
    },
    {
      "title": "Best Foreign Album of the Year (South America)",
      "nominees": [
        "Música do Esquecimento - Sophia Chablau e Uma Enorme Perda de Tempo [Brazil]",
        "Ahora o nunca - Candelabro [Chile]",
        "Me chama de gato que eu sou sua - Ana Frango Elétrico [Brazil]",
        "Hurricanes - Hurricanes [Brazil]",
        "Vol. 01 1976-1977 - Roberto Niederauer [Brazil]"
      ],
      "winner-sentence": "I didn't learn that in philosophy university.",
      "prize-picture": "https://f4.bcbits.com/img/0033313272_10.jpg"
    },
    {
      "title": "Best Foreign Album of the Year (Oceania)",
      "nominees": [
        "What's on TV - Tee Vee Repairmann [Australia]",
        "PetroDragonic Apocalypse; or, Dawn of Eternal Night: An Annihilation of Planet Earth and the Beginning of Merciless Damnation - King Gizzard and The Lizard Wizard",
        "Fronzoli - Psychedelic Porn Crumpets [Australia]"
      ],
      "winner-sentence": "I'd let him repair my TV.",
      "prize-picture": "https://i.ytimg.com/vi/mKD1KK0TAFc/hqdefault.jpg?sqp=-oaymwEmCOADEOgC8quKqQMa8AEB-AGOBYAC4AOKAgwIABABGGUgYCg7MA8=&rs=AOn4CLAK3_rolA_blZqUMjmA0BAVOtsrOg"
    },
    {
      "title": "Best Debut of the Year",
      "nominees": [
        "Hydranism - Oracle Sisters",
        "Talisman - Slowspin",
        "Why Does the Earth Give Us People to Love? - Kara Jackson",
        "Super Snõõper - Snooper",
        "Hurricanes - Hurricanes"
      ],
      "winner-sentence": "I really loved it and deeply wish someone else liked them as much as I do. Very promising stuff here.",
      "prize-picture": "https://northerntransmissions.com/wp-content/uploads/2025/01/unnamed-2025-01-19T180609.869.jpg"
    },
    {
      "title": "Best EP of the Year",
      "nominees": [
        "The Brightest Days - Origami Angel",
        "New Heart Designs - Turnstile & BADBADNOTGOOD",
        "GUTS: The Secret Tracks - Olivia Rodrigo",
        "Big Ego, No Self Esteem - Jonabug",
        "going…going…GONE! - hemlocke springs"
      ],
      "winner-sentence": "I know this is actually a mixtape, but it has an EP duration so I thought it would be unfair to put it in the list with long records. Still, I said it in last year's year-end list about Sobs' Air Guitar, but I'll say it again: \"I'm a simple person - show me a bittersweet summer afternoon Power Pop song, and I will enjoy it.\". Now take one of my favorite bands of current days, and make them Power Pop. I'm sorry elitists, but I just can't pretend I don't like it. Sure, it's not as majestic and ambitious as Somewhere City, but it surely never intended to be, even the format of its release (mixtape) shows it. <br><br> The essence of the band is still here: the gorgeous melodies and vocals by Ryland Heagy above the beautiful power chords, followed by heavy, Hardcore breaks that guide you through a beautiful, nostalgic, and sentimental journey. This time, they make the melodic parts even more easy on the ears, approaching an easycore style, but not losing any of the urgency in their sound. The lyrics are happier and not as deep as in Somewhere City nor in some of the Gami Gang tracks, but they are still great and profound. The array of influences here are also much more extense. Thank You, New Jersey has Surf Rock (mainly Beach Boys) inspired parts, Kobayashi Maru (My Very Own) has even some ska-ish guitars, and is the most shameless Power Pop song here, even if it ends with one of their classic Hardcore breaks. Some other songs have great ukulele laid-back parts as well. By the way, I love how the album starts in this laid-back approach, goes through many stages and emotions during the middle songs, and finishes with that same section, making the record a beautiful loop. The album is extremely consistent and every track suits the aesthetic perfectly, adding up to a very good expierence. The electronic influences in the last two songs didn't please me much, but they were well blended in their style. <br><br> It is, yes, Origami Angel's least emotional album, but its energetic and poppier nature is a welcome change of pace, and the lack of pretentiousness added up with their great songwriting here make it a great release. A great record, that just didn't make the list because of its short length, but otherwise would be easily a contender for top 1.",
      "prize-picture": "https://f4.bcbits.com/img/0032644579_171.jpg"
    },
    {
      "title": "Best Album of The Year",
      "nominees": [
        "Live at Bush Hall - Black Country, New Road",
        "But Here We Are - Foo Fighters",
        "Cousin - Wilco",
        "Hydranism - Oracle Sisters",
        "3D Country - Geese"
      ],
      "winner-sentence": "Back-to-back winner of the award. Now that's impressive",
      "prize-picture": "https://i0.wp.com/www.madsound.com.br/wp-content/uploads/2023/05/black-country-new-road.jpg?resize=1170%2C658&ssl=1"
    }
  ],
  "last_modified":"January 11, 2026 at 00:19"
}