{
  "list": [
    {
      "cover": "https://e.snmc.io/i/600/w/e0913955db2084ad7a6e0b56e3ddab7f/11511397/brittany-howard-what-now-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Brittany Howard",
      "album": "What Now",
      "year": 2024,
      "title": "Does anyone even care that we don't smile with our eyes anymore?",
      "review": "It's a very moody and chill Soul record. Brittany is by now a veteran in the industry, and after more than a decade of making throwback Soul music with modern edges, she hasn't lost the ability to make consistently interesting albums. This one is a bit more psychedelic than her usual but still pretty close to the rest of her career, with great vocals, polished production, and nice instrumentation.",
      "highlights": [
        "I Don't",
        "Every Color in Blue"
      ],
      "honorable": 1
    },
    {
      "cover": "https://e.snmc.io/i/600/w/cb72c8a1da839cfa72618259c365eebc/12101108/twikipedia-for-the-rest-of-your-life-Cover-Art.jpg",
      "score": "7.7",
      "artist": "twikipedia",
      "album": "For the Rest of Your Life",
      "year": 2024,
      "title": "Eu só queria ser o que eu quero, o que você quer é impossível",
      "review": "twikipedia is heavily compared to Parannoul, and while she draws a lot from this new wave of emo that Parannoul is inserted in, having monumental emotional heights buried in beautiful melodies guided by hazy instrumentation, twikipedia has a much bigger pop sensibility. The album has a huge emphasis on melodies, hooks, and choruses, and not so much on the atmosphere like Parannoul. The production here is also much cleaner and interesting, with the vocals being actually audible. Also, she does something that Parannoul is unable to do, which is ending the songs before they become just a loop. All in all, twikipedia sounds like a step forward in the new emo wave, incorporating emo-pop and indie-rock in a very emotive sound.",
      "highlights": [
        "Room for One",
        "Figure Me Out",
        "Final Feliz"
      ],
      "honorable": 1
    },
    {
      "cover": "https://e.snmc.io/i/600/w/5cc6c665577593fed4eaceec0061abec/12669807/squee-squee-Cover-Art.png",
      "score": "7.7",
      "artist": "Squee",
      "album": "Squee",
      "year": 2024,
      "title": "'Cause once I'm back alone, I wanna hear you call",
      "review": "While alex/drug bug/star starer gets all the praise for the work with Willy Rodriguez, by listening to their solo stuff, it's clear that gabe/Squee/Midwestern Roadkill is the actual core of their music - melodic and emotional, but very abrasive, with lots of heavy rock and punk influences. Holy could easily be a Willy Rodriguez song, for example. The screaming is sometimes too much, and the mix is absolute shit - but that's the aesthetic they were going for, and honestly, it works. The instrumentation is very good, and it's incredible how beautiful some of these melodies are despite the overall tone of the record being so abrasive. A short album consisting of really good rock music, both in sound and spirit.",
      "highlights": [
        "Wasted",
        "Solanin"
      ],
      "honorable": 0
    },
    {
      "cover": "https://e.snmc.io/i/600/w/1d0805dd015c8bcc792e5388817d88c2/12176936/jesus-molina-selah-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Jesús Molina",
      "album": "Selah",
      "year": 2024,
      "title": "The bop is dead once again :(",
      "review": "Jesus Molina is the best jazz artist out there now. I mean, there will be other jazz-related albums higher on this list, but Molina carries the old-school jazz and all its essence in his very talented fingers. His 2019 and 2020 albums are fantastic and showed a lot of promise for the scene as a whole, backing up Kamasi Washington in bringing the Bop back to the spotlight. Selah, however, followed toward a more fusion approach, with some Ponty-esque songs, plus more piano balladry that doesn't really fill my goals when listening to jazz. Caf is a fantastic song, the musicianship is as great as ever (even if most songs don't really give the artist that much space to shine), and the album as a whole is still a pretty good listen, but I can't help but feel like a few more albums like Departing were needed in this world.",
      "highlights": ["Caf"],
      "honorable": 0
    },
    {
      "cover": "https://e.snmc.io/i/600/w/6134ca33cc142f6efbc09b2bfc34545d/12533242/nubya-garcia-odyssey-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Nubya Garcia",
      "album": "Odyssey",
      "year": 2024,
      "title": "Triumphant",
      "review": "I couldn't really pinpoint what about Nubya's debut held me back from liking it - it seemed a bit too stale, even if well-performed and written. With Odyssey, Nubya incorporates bigger, more impactful arrangements that give that little punch her debut lacked. The songs are also shorter and make better use of their time. There's still some weak explorations on dub (?) rhythms, but overall, the album is much more consistent and interesting. The drumming in Solstice is amazing and makes it the best song here.",
      "highlights": [
        "Solstice",
        "In Other Words, Living"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/0cec16b246f0f237de23d490bc9040c4/12436037/caxtrinho-queda-livre-Cover-Art.png",
      "score": "7.7",
      "artist": "Caxtrinho",
      "album": "Queda livre",
      "year": 2024,
      "title": "Prego 'n' chinelo",
      "review": "Caxtrinho is part of this new wave of experimental vanguardists in São Paulo, but he seems very unique in the scene. His deep voice and accent are unlike any others, and the mix of Rock, Samba, Experimentalism, and MPB is made in a very singular way as well. I can't say every song is a masterpiece, and some of the criticism in the lyrics is superficial to the point that it doesn't make sense. Still, it is a very good record and debuts a very promising career for this artist.",
      "highlights": [
        "Cria de Bel",
        "Branca de Trança"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/1c7d550e03de4e1b992407ff15ad301d/12700997/this-is-the-glasshouse-867-Cover-Art.jpg",
      "score": "7.7",
      "artist": "This Is the Glasshouse",
      "album": "867",
      "year": 2024,
      "title": "Tomorrow when the farm boys find this freak of nature they will wrap his body in newspaper and carry him to the museum",
      "review": "This Is the Glasshouse is a Canadian one-man project that makes a very interesting sound blending Indie Rock with chamber arrangements and Prog influences. The melodies and arrangements are beautiful. Still, I can't help but feel like this is an album by someone who wants to make complex music even though they don't have the skills to do so. Again, the songs are really well-written, but it seems like if he had a skilled band backing up his compositions, this could reach a whole different level. The drumming is especially weak, and the album extends itself a bit too much, with some songs that seem to wander without any goal. Even when it works, like in Robinson, it exposes the repetitive nature of the record. Also, there are some songs here that sound like (or actually are) reworks from his previous record. I see a lot of potential here, and with some reworking, most of these songs could be fantastic. But in the way it is delivered here, there's still room for improvement.",
      "highlights": [
        " Streetlight by Streetlight",
        "Two-Headed Calf",
        "Robinson"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/bbf8d8afcf334d73f4d518b8070b7229/11824637/hannah-frances-keeper-of-the-shepherd-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Hannah Frances",
      "album": "Keeper of the Shepherd",
      "year": 2024,
      "title": "I want to be shaped by the love I have, not haunted by the lack",
      "review": "Hannah is a very talented singer-songwriter, with a knack for a very moody aesthetic in her indie-folk setting. She is a great guitarist, with some outstanding fingerpicking performances, and a great singer as well. Keeper of the Shepherd is a pretty consistent album, that lacks a little bit of stand-out moments but is inspiring from start to finish. My favorite song here is Floodplain, one of the best, most emotional songs in the entire year.",
      "highlights": [
        "Floodplain"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/2a247271ab40b06852a6a9f2e34494d2/13820443/kelly-moran-moves-in-the-field-Cover-Art.png",
      "score": "7.7",
      "artist": "Kelly Moran",
      "album": "Moves in the Field",
      "year": 2024,
      "title": "Where's the fork sound?",
      "review": "Kelly Moran trades her signature prepared piano with... well, a traditional one. It sounds cleaner and much more melodic, making her music more intimate and delicate, full of beauty in each note. The playing is above average and the album is really consistent and varying considering it's a minimalistic instrumental solo piano album.",
      "highlights": [
        "Butterfly Phase",
        "Sodalis (II)"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/150e3bdaa803c8bd0c775d084065e633/12078889/kamasi-washington-fearless-movement-Cover-Art.jpg",
      "score": "7.8",
      "artist": "Kamasi Washington",
      "album": "Fearless Movement",
      "year": 2024,
      "title": "Each day I sing a song for you",
      "review": "After the disappointment that Heaven and Earth was, it seemed that Kamasi released his three great albums as a single one and now didn't have much more to show us. The atmospheric, spiritual sound of the first album was a bit lost in the second release, having less of a mood and sounding a bit too ordinary. So coming to this album, I was afraid that he kept trying to do the same and had the same issues he had before. Kamasi seems to have gone to a new route, though. While keeping the style that gave him his name in some of the tracks, most of the time here is spent exploring different sides of black music. Blending Jazz and Soul is not new to him, and the funky tracks of his last album are expanded here. But what's truly new is Kamasi exploring Hip Hop. I can't say I enjoy it, most of the songs would be much better without the rapping, but I get how important the Jazz Rap genre is for younger people to get into jazz, so I'll take what I can get. But as this trip to different genres ceases in the second half of the record, we have one amazing journey after another, almost resembling The Epic. I mean, the best tracks here are not as good as the best in The Epic, but the consistency in the latter half is the same. The album is shorter, but it's still quite long, and to have the entire first half being as weak as this was really tears it down a notch. Still, the last half makes up for it.",
      "highlights": [
        "Together",
        "Prologue"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/ab9a537d52c29e69bba3e339bab69632/12301754/magdalena-bay-imaginal-disk-Cover-Art.jpg",
      "score": "7.8",
      "artist": "Magdalena Bay",
      "album": "Imaginal Disk",
      "year": 2024,
      "title": "Never really noticed you're a sentimental guy",
      "review": "As someone who doesn't listen to much mainstream music, it's always funny to see a mainstream audience getting to know artists who have their creativity above the average of the market. For them, a concept album is something mind-blowingly innovative, not a thing present in music since at least 80 years ago. The concept here is also very vague and loose, and the lyrics are so weak that the concept becomes almost nonexistent. Even so, the production here is fantastic, the vocals are strong, and the album has quite some diversity in sound. The more artsy and rocky moments are the ones I like the best, with the string arrangements being another highlight. The dance songs, however, are pretty weak and generic. It's also a big improvement from their debut, after listening to that, I'd never expect to have them in my year-end list. Overall, as good and catchy as some of the songs are, the album isn't the revolutionary psychedelic experience some will lead you to believe it is. The best songs here are Tunnel Vision (the second half gets increasingly better), That's My Floor, which is by far the best song here, and the catchy The Ballad of Matt & Mica.",
      "highlights": [
        "Tunnel Vision",
        "That's My Floor",
        "The Ballad of Matt & Mica"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/f2bdd56c043171daacc4c83d29325a12/12307628/hoovaranas-tres-Cover-Art.jpg",
      "score": "7.8",
      "artist": "Hoovaranas",
      "album": "Três",
      "year": 2024,
      "title": "I probably should stop listening to instrumental albums, I can't really think of anything to say here",
      "review": "Great instrumentation, nice production, and great riffs and drumming. I feel like the fact that they come from such a close place to mine and are so young makes it feel even more impressive. Ask any Brazilian outside this site, they probably never even heard of Math Rock. I think the songs lack a little bit of variety in their structure and are quite repetitive throughout considering that it is just an instrumental record. With vocals, this would be perfection, but the lack of another instrument and lyrics demands more creativity in the structure of the songs. Still, they seem self-aware enough in that and made a concise record, and what they came up with is beautiful and great. The best songs are truly great.",
      "highlights": [
        "Frenesi",
        "Refazendo"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/6ff407611eb1b3992c3e39a8fe9462f3/12297646/king-gizzard-and-the-lizard-wizard-flight-b741-Cover-Art.jpg",
      "score": "7.8",
      "artist": "King Gizzard and The Lizard Wizard",
      "album": "Flight b741",
      "year": 2024,
      "title": "'Cause death to me is a life lived safely",
      "review": "For the surprise of a total amount of 0 people, King Gizzard is back with an album that transitions into a totally different style from most previous albums of theirs. This time, we have a Boogie, Roots Rock record with lots of Country influences. The songwriting is light and easy-going, and it's just a pretty good time. The melodies are very good, and the heavier moments remind me a bit of the great Status Quo, but with guitars containing Gizzard's psychedelic pitches. The harmonicas are also always a pleasure to listen to - we need more bluesy rock records again. The vocals here are a bit worse than the usual Gizzard albums, and I can't deny that some songs are just kinda of plain. Still, it's such a good homage and throwback to a style that I love, so I can't pretend I didn't enjoy it. I can't say I wish they keep this style, as I think they are still better with their psychedelic envisions, but this is still a great moment in their career.",
      "highlights": [
        "Le risque",
        "Daily Blues"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/d118b42997e4a4a0844ea267ef249d0e/11502016/friko-where-weve-been-where-we-go-from-here-Cover-Art.jpg",
      "score": "7.8",
      "artist": "Friko",
      "album": "Where We've Been, Where We Go From Here",
      "year": 2024,
      "title": "Starting to believe the puzzle never solves because it's all chemical",
      "review": "Friko's debut came out of nowhere with a very 2000s sound, reminding a bit of Arcade Fire, with the same chamber arrangements and care for beautiful melodies, but a lot noisier. They are really good at balancing the beauty in the ballads with the intensity in the rockier songs. I also really liked the vocals, the singer's got a great voice. It's a bit inconsistent, but in terms of Indie Rock, they're one of the most promising bands right now.",
      "highlights": [
        "Crimson to Chrome",
        "Chemical",
        "Statues"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/b8c64b1206092d14f202e04d6edd4044/11709561/adrianne-lenker-bright-future-Cover-Art.jpg",
      "score": "7.9",
      "artist": "Adrianne Lenker",
      "album": "Bright Future",
      "year": 2024,
      "title": "Been searching for your eyes",
      "review": "My opinions on this album are similar to my opinions on every other Adrianne Lenker-related album: inconsistent, but hits hard when it does. Even so, this is probably her most consistently beautiful album. Is it overrated? Sure, like everything she does, people get so stunned by the best moments that they forget there aren't many other moments. For example, this album's version of Vampire Empire is criminally weak compared to Big Thief's. But also like everything she does, this has some devastatingly beautiful tracks that will forever be remembered and constitute a hall of very dear songs for me, like Sadness as a Gift and Free Treasure.",
      "highlights": [
        "Sadness as a Gift",
        "Free Treasure"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/2103f5a4d28c1ea0ddddbc2695a133df/11390766/judas-priest-invincible-shield-Cover-Art.jpg",
      "score": "7.9",
      "artist": "Judas Priest",
      "album": "Invincible Shield",
      "year": 2024,
      "title": "Blind synthetic wisdom",
      "review": "As a Black Sabbath fan, I'd never give the most influential title to any other band, but Judas is the only other band I can completely agree with the position of most influential Heavy Metal band ever. They influenced the more straight-ahead sound, the fantasy elements, and later even Power and Speed Metal. And even years after their heyday, I'm all in for this new wave of Judas' records. Another classic rock band with members in their 80s who are still delivering great records, largely above the average of rock bands in modern days. The riffs are menacing, the sound is grand, the vocals still retain the same magic Halford always had, and overall it's a pretty consistent album. I have some issues with some filtering in Rob's voice in a few songs, in which it sounds like Ozzy in his latest records (meaning it sounds like an effect-loaded ass), but most of the time it's just killer song after killer song. If you like your Judas Priest, this record won't disappoint you.",
      "highlights": [
        "Panic Attack",
        "Invincible Shield",
        "Escape From Reality"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/87732579b73484413cd660583f585f30/11951069/cindy-lee-diamond-jubilee-Cover-Art.png",
      "score": "7.9",
      "artist": "Cindy Lee",
      "album": "Diamond Jubilee",
      "year": 2024,
      "title": "I could've sworn I heard you call my name",
      "review": "Diamond Jubilee is one of the most interesting records of the year. Being a new moniker for Patrick Flegel after Women broke up, Cindy's mysterious figure was always a matter of speculation that was never truly explained. And this mystique, added by the lo-fi throwback aesthetic of the Brill Building movement makes this a one-of-a-kind album. The guitar work is pretty good and nostalgic, and the vocals and harmonies are gorgeous. The lyrics are also great, being emotional but keeping the innocence and simplicity that the early pop music industry had. The album still has a bit of the experimental nature the earlier records had, but it's toned down and usually blends well with the song. The main issue with the album is actually quite obvious - it's a double album. A two-hour double album. It's hard for any artist to make a nostalgic, moody sound that is still fresh and interesting even after two hours. The first disc is entirely great, but the second one gets a significant drop in quality. Disc 2 starts with several 5-second bass loops that are very alike, with occasional uninteresting guitars. It gets a lot better as it develops, but the abyss of quality between the two records is still insane. So yeah, I'm using the \"if it was a single album\" argument here. It still is a great listen and shows potential for Cindy to become a staple in modern music.",
      "highlights": [
        "Diamond Jubilee", 
        "All I Want Is You", 
        "Wild One", 
        "Flesh and Blood", 
        "Kingdom Come", 
        "Whats It Going to Take"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/43d51b590d133ef424efc4be973a63ec/12580470/papangu-lampiao-rei-Cover-Art.jpg",
      "score": "8.0",
      "artist": "Papangu",
      "album": "Lampião Rei",
      "year": 2024,
      "title": "Vento quente a definhar",
      "review": "Papangu is back, changing from the Prog Extreme Metal of Holoceno to a more direct Art Rock with still lots of Prog influences but leaning more towards craft than heaviness. The album tells the hi(maybe?)story of Lampião, a Cangaceiro (kind of a cowboy in Northern Brazil) who is an icon of class conflict in our country. Well, some people see him as a Brazilian Robin Hood, while other fonts say his group used to rape women in cities they looted, as well as some other very unethical stuff. His legend came to a point that it's impossible to know what's real or if we should really celebrate his legacy. But, even with such a figure and a story, the lyrics here are still very weak and pointless, just like their debut. Where we really see the improvement is in the songwriting: the lighter approach to their music opened space for much better riffs and broader usage of different instruments. The riffs here are catchy and rhythmic, and the compositions are mostly great. It sometimes feels like the album can't ever reach that point of greatness, but it borderlines that point throughout the whole record, which is great by itself. Also, seeing more Prog in Brazil is a dream come true. We had so many great artists in this niche that were forgotten over time. Even popular bands gone prog have that phase of their career erased, so it's great to see people talking about it again.",
      "highlights": [
        "Oferenda No Alguidar",
        "Sol Raiar (Caminhando Na Manhã Bonita)"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/3a158528e4102d787978cc4fc14a4b9a/11737870/the-messthetics-and-james-brandon-lewis-the-messthetics-and-james-brandon-lewis-Cover-Art.jpg",
      "score": "8.0",
      "artist": "The Messthetics & James Brandon Lewis",
      "album": "The Messthetics and James Brandon Lewis",
      "year": 2024,
      "title": "I showed it to my dad and he loved it",
      "review": "Though Fugazi's heart, soul, and brains were composed of Ian MacKaye and Guy Picciotto, Joe Lally and Brendan Canty were the flesh and bones of the group. They made the body of their music. And when I heard about this jazz project from Fugazi's rhythm session, I imagined the exact sound that is here. If you know Fugazi, this will sometimes sound very familiar. It is jazzier, a bit more elaborated, experimental at times, and much less political and wild, but the body is the same. Analyzing it from the perspective of a Jazz fan and not a Fugazi fan, it is also a very unique album, with some very heavy moods and an interesting interplay between the sax and the guitars. Those, by the way, are fantastically played, with complex rhythms, great solos, and interesting work overall. It's great how the guitars balance their heavy and melodic aspects throughout the songs. Also, the songs are structured pretty much like rock songs while arranged in a very jazzy way, giving it a very different feel to fusion. It doesn't always reach the perfection of Emergence or Boatly, but it's still a great record overall, and those two songs are landmarks for music.",
      "highlights": [
        "Emergence",
        "Boatly"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/3590c11e9b5d1056229a2f8f7a41055c/13814960/cameron-winter-heavy-metal-Cover-Art.jpg",
      "score": "8.0",
      "artist": "Cameron Winter",
      "album": "Heavy Metal",
      "year": 2024,
      "title": "Love takes miles, love takes years",
      "review": "A very, very beautiful and atmospheric record, that knows how to play with silence and space to craft hazy, gorgeous soundscapes. Still, the record has its problems. Cameron was never the greatest singer, but his quirkiness worked in his favor and helped a lot in the maximalist 3D Country. Now, in his solo chamber folk rock album, this quirkiness is not so welcome, as it sometimes make the intimist songs sound like a big joke. When he sings more directly, it sounds better and more cohesive in the context. His maximalist style still plays some role here, with lots of chamber creativity that backs up the songwriting. This does help as some songs are a tad repetitive and don't shine a lot by themselves, adding consistency as those collaborate with the highlights. We also have several soul influences, and just like 3D Country, it blends in perfectly. The lyrics are pretty good as well, to me even improving from Geese's and leaning more to a poetic side of Cameron. Also, the highlights here are some of the best songs he ever wrote, really something else. All in all, this is a great album, with lots of great tracks and beautiful production, but that sometimes could do with some better performances. You must listen to Love Takes Miles, though. That song is devastatingly beautiful.",
      "highlights": [
        "Love Takes Miles",
        "Can't Keep Anything"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/5b0c2df32172e2784afbb4e21c160435/12546934/ulcerate-cutting-the-throat-of-god-Cover-Art.jpg",
      "score": "8.0",
      "artist": "Ulcerate",
      "album": "Cutting the Throat of God",
      "year": 2024,
      "title": "The dread of totality is self-realising",
      "review": "Ulcerate is not really my cup of tea. I'm not that much into extreme metal, and I'll always prefer good melodies over people screaming their lungs out and punching the drums for no reason whatsoever. That said, this album is absolutely fantastic. Its ability to be extreme, intense, and heavy while being atmospheric and progressive is unique. I mean, I know Prog Metal is a genre, but it's not nearly as brutal as this, nor as tasteful, since most Prog Metal bands are just making speed contests and don't give a shit about actually being progressive. But here, we get some fantastic guitar work, cadenced, with great tones, but still heavy. Going back in their catalog, it's almost unbelievable how great this album is. As with every extreme metal record I've ever heard, this is a bit tiring, as there's not much change of pace, but the best songs here are absolutely fantastic. Further Opening the Wounds is the best metal song of the year.",
      "highlights": [
        "To Flow Through Ashen Hearts",
        "Further Opening the Wounds"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/f682e422c556370e308a9a3e5935450c/12790452/3776-the-birth-and-death-of-the-universe-through-mount-fuji-Cover-Art.jpg",
      "score": "8.0",
      "artist": "3776",
      "album": "The Birth and Death of the Universe Through Mount Fuji",
      "year": 2024,
      "title": "Who needs a physics degree when you get a Japanese idol's educative album about the origin and end of the universe?",
      "review": "3776 is one of the weirdest Japanese acts ever to exist. And that's a huge thing since Japan is a weirdness-making machine. But somehow, after their year-themed sophomore release, the idol group performed only by Chiyono Ide whose sole songwriter is Akira Ishida got further into weirdness, making an educative album about the origin of the universe through the perspective of Mount Fuji. And somehow, it still is really, really good. The great, maximalist production of the other albums remains here, having lots of great synths and guitars. The melodies are maybe the cutest and most Japanese they ever sounded. Every song is catchy and creative in its own way, and even if the immense tracklist does bring the consistency down, it's still a great listen. Saijiki is still better for how consistent it was, but the best moments in here are just as good. The Death of Life on Earth might be their best song ever.",
      "highlights": [
        "The Birth of Earth",
        "The Death of Life on Earth",
        "The Death of the Atom"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/b53d56191d929a426183ba55bff1f4c5/12250474/mj-lenderman-manning-fireworks-Cover-Art.jpg",
      "score": "8.0",
      "artist": "MJ Lenderman",
      "album": "Manning Fireworks",
      "year": 2024,
      "title": "It falls apart, we all got work to do",
      "review": "Manning Fireworks takes the live arrangements from songs on MJ Lenderman's previous album and expands them into a full album. At the same pace that the approach becomes a bit formulaic through the tracklist, I start missing the lo-fi aesthetic of the earlier albums. The only noisier segment is the 6 minutes of noise at the end of Bark At The Moon - but that didn't work well. Still, the more unashamedly country influences make this a great, different experience in his discography. The lyrics remain as emotional as ever, the arrangements are gorgeous, and the grander production fits these songs pretty well. The performances are strong, the choruses are memorable, and there's some truly remarkable guitar work. The songs are also warm and easy on the ears, which makes the album a good journey. I particularly love the references to classic rock sprinkled throughout the lyrics; they add a layer of charm and familiarity and help build the landscapes he describes. Some songs even feel a bit like Neil Young's Zuma. Overall, Manning Fireworks combines his trademark heartfelt songwriting with a bigger, more polished sound. While it might lack some of the rawness and variety of Lenderman's earlier work, it proves he can still deliver a moving, compelling, and captivating record. One of the geniuses of our generation.",
      "highlights": [
        "Manning Fireworks",
        "She's Leaving You",
        "You Don't Know the Shape I'm In"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/7ea6c01c53d35c35d7d4270b5c0c8437/11780602/the-lemon-twigs-a-dream-is-all-we-know-Cover-Art.jpg",
      "score": "8.1",
      "artist": "The Lemon Twigs",
      "album": "A Dream Is All We Know",
      "year": 2024,
      "title": "'Cause in the blink of an eye, I'll watch these golden years fly by",
      "review": "The Lemon Twigs are now a well-established duo that has been releasing retro-rock for almost a decade. These kinds of groups tend to become very derivative very quickly, but the brothers are reinventing their sound with each album since its debut, and that's impressive. This one is much less original than their previous albums, and you can clearly listen to the influences in each song. Church Bells is pure early days The Beatles, A Dream Is All I Know is pure McCartney & The Wings, Sweet Vibration alternates between Beatles and The Beach Boys, Peppermint Roses is almost a Lennon outtake from Rubber Soul, Rock On is pure T. Rex, and so on. Even then, as evident as their influences are, the duo is indeed able to write some gorgeous, catchy music and recapture the feeling of these groups like no one else could do in modern times. Their harmonies are angelic and prove that they truly understand where they are coming from. As much as people try to diminish groups who are not reinventing the wheel, there's some magic inherent in recapturing the sound from a period in time that's now long gone. I love what the twigs are doing, and I hope this step in their ever-changing sound is carried to more releases. The lyrics, as simple as they are, also have some very beautiful lines.",
      "highlights": [
        "My Golden Years",
        "A Dream Is All I Know",
        "Sweet Vibration"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/b7e3c0f09df47b96430a8cc32c580deb/12522337/haley-heynderickx-seed-of-a-seed-Cover-Art.jpg",
      "score": "8.1",
      "artist": "Haley Heynderickx",
      "album": "Seed of a Seed",
      "year": 2024,
      "title": "There's an artistry in the day-to-day",
      "review": "At first, Seed of a Seed was a huge disappointment. It sounds so much like every Americana act of current music, it barely resembles the indie-folk of her early entries that helped shape so many of these mainstream acts of today. Still, with every relisten, the songs start to touch you more and more. It is a simpler album, and the lyrics might not touch so much on the isolation aspect that her debut focused on, but the arrangements are still very beautiful, and the lyrics too. The guitar work has fewer riffs, but a lot of magic fingerpicking makes up for it. Also, nothing sang by her can sound actually bad. So overall, while this is a weaker album than her debut made me expect from her, and the new approach is not exactly what I envisioned for her work, this is still some very magic folk music and keeps her as one of the best artists out there. My favorites are Gemini, Spit in the Sink (which might be the only song in the style of her early records), and the closer Swoop, with its beautiful lyrics about her mother and grandmother.",
      "highlights": [
        "Gemini",
        "Spit in the Sink",
        "Swoop"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/d7ef708ab7482fd30581537a7f7fcf2b/11689457/faye-webster-underdressed-at-the-symphony-Cover-Art.jpg",
      "score": "8.1",
      "artist": "Faye Webster",
      "album": "Underdressed at the Symphony",
      "year": 2024,
      "title": "I'm depriving myself of happiness",
      "review": "The AOTY algorithm recommended Here Comes the Cowboy by Mac DeMarco as a \"You May Also Like\" for this album. Coincidence or not, I believe this is one of the best comparisons this album could get: an album more leaned towards Soft Rock and hugely over-hated by the artist's own fanbase. Even so, I actually agree with most of the criticism made towards this album. Faye was always careful with the mood and atmosphere of her music, and the result was always some of the most beautiful music I've heard. This album keeps it, and I'd say it is even more relaxing and detailed than every other album of hers, but that comes in exchange for some of the focus she used to put into the vocal melodies and the fluency of the songs. Here, they are often very repetitive and extend themselves until their beauty is lost (and you have to overextend a lot for these songs to lose their beauty). Plus, with all due respect to Yatchy, his overcompressed and filtered vocals don't fit at all with Faye's music. I mean, it's a cool collab and all, but it simply didn't work, and it even influenced Faye to make the same with her vocals on songs like Feeling Good Today, which could've easily been the best song in the album if not for it, and in He Loves Me Yeah!, that was less affected by it but would be better without it as well. But, even with these major issues, Faye still manages to impress with her unique ability to create beautiful and peaceful atmospheres followed by sentimental lyrics. We have a bigger focus on the lush arrangements here (following the Car Therapy Sessions style) and I think the overall result is pretty good, even if she made a few mistakes here and there.",
      "highlights": [
        "But Not Kiss",
        "Wanna Quit All the Time",
        "Underdressed at the Symphony",
        "Lifetime"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/a6f3e0507b50f0954572394f334ad11a/12312967/clairo-charm-Cover-Art.jpg",
      "score": "8.2",
      "artist": "Clairo",
      "album": "Charm",
      "year": 2024,
      "title": "I'd rather be alone than a stranger",
      "review": "I've never been a Clairo fan. If something, I was closer to being a hater of her. But Charm is such a... charming record. The songs are soft, beautiful, with great melodies and a calm, relaxed aesthetic. The synths and pianos are very beautiful, and the chamber details are so meltingly beautiful. The production plays a huge role in this lovely sound. Her voice is also very fitting in the context, even if not being nothing all that special, it still sounds just as delightful as everything else. Throw away your concepts of her and give this record a try.",
      "highlights": [
        "Nomad",
        "Second Nature",
        "Slow Dance",
        "Terrapin"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/0e165e6f84677bead72f7cab0ed7642b/12580846/cuni-prescribed-burn-Cover-Art.jpg",
      "score": "8.2",
      "artist": "cuni",
      "album": "Prescribed Burn",
      "year": 2024,
      "title": "You are a song that I can't sing",
      "review": "Every year there's at least one album that absolutely nobody listened to but, as soon as I saw the cover, I knew I'd like it. cuni's Prescribed Burn is this year's. A blend of several Emo-adjacent genres, cuni's sound resembles a more math early MCR, with lots of Post-Hardcore influences, beautiful melodies, great instrumentation, a nice guitar tone, and a calm/intense dynamic in both the instrumentation and the vocals (interchanging melodic and screaming vocals). The album is a bit repetitive in tone, but the songs are so well-written that it doesn't get tiring. The short length also helps it not to get too repetitive. The instrumentation is top-notch, and the vocals are very good. Also, even if the lyrics are not as great as I expect my emo to be, it still does a good job at sounding emotional.",
      "highlights": [
        "Intro",
        "YDNMA",
        "Didymus"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/528dae81ced84ab44a956a86b539e577/12169975/badbadnotgood-mid-spiral-Cover-Art.jpg",
      "score": "8.2",
      "artist": "BADBADNOTGOOD",
      "album": "Mid Spiral [Compilation]",
      "year": 2024,
      "title": "I've made the GOODGOODNOTBAD joke already, so I'm out of things to say here",
      "review": "BADBADNOTGOOD released a series of three EP's, which ended up in this compilation that is, basically, their latest album. And well, they continue their ascension here. Every EP follows a more dense, vibey approach, different from the more intense songs we heard in their last few albums. Alex's drums are a bit contained here, which is a shame knowing what he can do, but the songwriting is brilliant and every song is beautiful. The record is 80 minutes long and I really didn't bother the length at all, which is something that almost no album that is 50 minutes long or more can do. It keeps the rockier and jazzier approach, distancing the band's sound even more from their early Hip Hop influences, and includes some tropical feel to several of the songs. Chaos EP is consistent and beautiful, while the middle EP, Order, drags a bit and just keeps the aesthetic of the first one with less enthusiasm and creativity. But it's the third EP, Growth, that really shines. Pretty much every song in it is fantastic and a highlight. The bonus track is also very good but outshined by plenty of the others. My favorites here are Mid Spiral, First Love, Audacia, Ways of Seeing, and White Light.",
      "highlights": [
        "Mid Spiral",
        "First Love",
        "Audacia",
        "Ways of Seeing",
        "White Light"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/52a794bab0637858aafd77a1f8eabf9f/11705776/gumshoes-cacophony-Cover-Art.jpg",
      "score": "8.3",
      "artist": "Gumshoes",
      "album": "Cacophony",
      "year": 2024,
      "title": "You can cry like no one's staring, 'cause nobody is",
      "review": "Gumshoes is a very wronged artist. People seem to disregard him as some second-tier piano-based indie artist, but he is much more than that. His songs are pretty emotional, his lyrics are very poetic, his albums have creative concepts, his voice is beautiful and unique, and the arrangements are interesting and charming without taking away any of the instant catchiness of his songwriting. Cacophony follows the journey through the minds of the bandmates of the fictional DIY punk band Cacophony, exploring constant concepts in underground music, carrying the punk ethos to songs that are pretty much everything this ethos is against - catchy, beautifully crafted music. The folk-ish approach of his previous works is changed to this more piano-based indie pop, guided by beautiful vocal melodies, more contained structures, and less frenetic vocals, but the same amount of emotion in each note performed. It is a different approach, but just as good as the previous one, as Gumshoes proves himself a noteworthy pop songwriter. The shorter tracklist allows a more consistent album as well, and by the end, I don't feel like it's lacking anything. There are some weaker tracks, like the title track, but overall the album is just one beautiful melody after another.",
      "highlights": [
        "The Real Thing", 
        "Clair De Lune 2", 
        "Nobodies",
        "Low Fantasy"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/61e97739f030f4cd23e53d9514e8a99e/12550970/the-cure-songs-of-a-lost-world-Cover-Art.jpg",
      "score": "8.3",
      "artist": "The Cure",
      "album": "Songs of a Lost World",
      "year": 2024,
      "title": "I never thought I'd need to feel regret for all I never was",
      "review": "The Cure is back after 16 years since their last album. People didn't seem to mind the band anymore (and so didn't I), so I was caught by surprise both with the release of the album and the absurd acclaim it got. And this is the kind of record that within the first few notes, you could tell it would be great. This is very well performed, the best and most monumental the band ever sounded. It feels like a more concise and guitar-oriented version of Disintegration, which is more in conformity with my taste. It has the same long instrumental passages, but fewer synths and more orchestral elements and guitar layers used for the atmosphere. Also, the lyrics seem just as emotional, though a bit more mature. It is a bit formulaic - it starts with the instrumental section and jumps for the lyrics, calming down a little towards the end. Also, sometimes they just drone and keep going nowhere. Still, this is a truly remarkable comeback to the most influential gothic band ever. My favorites are the overwhelmingly beautiful orchestral And Nothing Is Forever, the catchy heartbreak of A Fragile Thing, and I Can Never Say Goodbye.",
      "highlights": [
        "And Nothing Is Forever",
        "A Fragile Thing",
        "I Can Never Say Goodbye"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/f1baab366544662edc57a5146d6a9ede/13024704/jack-white-no-name-Cover-Art.jpg",
      "score": "8.3",
      "artist": "Jack White",
      "album": "No Name",
      "year": 2024,
      "title": "If God's too busy then I'll bless myself",
      "review": "Jack White is back! After several years of weak releases, he returns with an album in the mold of what the White Stripes were doing in the beginning. This time though, we have a lot of lo-fi production qualities, to simulate the old-time garage bands and LOTS of Hard Rock and Punk Influences. I mean, listen to the keys in the first song. IT'S GODDAMN 70s HARD ROCK. The punk ethos is shown even in his decision not to release the album digitally at first. The guitar work and vocals are absolutely amazing, and the consistency here is impressive. The different rhythmic patterns in White's vocals inspired by Post-Punk are incredible and bring a lot of diversity. Honestly, I think this is his best work in terms of vocals ever. He might not be reinventing the wheel, and the second half is quite weaker than the first, but Jack returns to his old sound and adds new flavors and twists to it, with amazing production and great throwback references, making probably the best album in his whole career and bringing the Punk ethos back again to a wider audience in rock. Truly remarkable album.",
      "highlights": [
        "Old Scratch Blues",
        "Bless Yourself",
        "Underground"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/63ad7ca33aeb34e56ceb8ee63c547e3f/12764796/%EA%B9%80%EB%9C%BB%EB%8F%8C-meaningful-stone-%EC%B2%9C%EC%82%AC-%EC%9D%B8%ED%84%B0%EB%B7%B0-Cover-Art.jpg",
      "score": "8.3",
      "artist": "김뜻돌 [Meaningful Stone]",
      "album": "천사 인터뷰 [Angel Interview]",
      "year": 2024,
      "title": "When Our Hearts Beat at the Same Pace",
      "review": "Meaningful Stone has been one of my favorite alternative acts in current music. While her debut tackled a more chill indie pop aesthetic with lots of folk influences and chamber arrangements, Angel Interview went in an all-around Alternative Rock album, with lots of Dream Pop influences. Her angelic voice fits the songs perfectly, making a fluffy sound of it. The production is simple but very effective, the guitar work improved, and the songwriting is simply great. The first 10 tracks follow that aesthetic, when suddenly Esc starts as a Nu Metal song and transitions to an Electronic track? How did we come from Dream Pop to that? Those are good songs, but they surely should be kept for a deluxe version or something, they really feel out of place here. In the end, this is a beautiful album that keeps the high level of songwriting we saw in her debut. Maybe a bit less regular, but with much more memorable moments, like Supernova, 10AM (this one reminded me a lot of Sobs), Red Car, When Our Heart Beat at the Same Pace, and Yogananda.",
      "highlights": [
        "Supernova", 
        "10AM", 
        "Red Car",
        "When Our Heart Beat at the Same Pace", 
        "Yogananda"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/fb45451d46949083b24f29d6a490fac7/11440905/tapir-the-pilgrim-their-god-and-the-king-of-my-decrepit-mountain-Cover-Art.jpg",
      "score": "8.4",
      "artist": "Tapir!",
      "album": "The Pilgrim, Their God and the King of My Decrepit Mountain",
      "year": 2024,
      "title": "Let it go, there's no shame in giving up",
      "review": "Compiling their two EPs with the final and third part of the story, Tapir!'s debut is a consistent, beautiful, creative, and charming record. Drawing a lot from their contemporaries in the Windmill Scene, they have a much more folk-ish approach to that Post-Rock experimentalism of the scene. Sounding like a mix of that with the more down-to-earth and spiritual approach of folk music, they still have that knack for alternativisms that remind me of Radiohead (referenced in Untitled, I believe) and, sometimes, even Sparklehorse. There's a lot of minimalism in the melodies as well, specially shown in Gymnopédie, which is an ode to Satie. The intro, Act 1 (The Pilgrim), immediately shows that this is unique and special, so start with that and let the journey suck you into it.",
      "highlights": [
        "Act 1 (The Pilgrim)",
        "The Nether",
        "Eidolon",
        "Untitled",
        "My God"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/971269503dadbe30e229c2e37d3525f5/12071604/carly-cosgrove-the-cleanest-of-houses-are-empty-Cover-Art.jpg",
      "score": "8.5",
      "artist": "Carly Cosgrove",
      "album": "The Cleanest of Houses Are Empty",
      "year": 2024,
      "title": "I watched all of my forevers last a month, maybe less",
      "review": "The emo Nickelodeon kids come back with their sophomore album. Poppier and cleaner than the debut, but with a lot of rhythmic phrases and raw energy, the band got a more qualified production team that allowed them to have a fuller sound and make a grander project. The composition became more consistent, and the same topics of isolation and depression were touched with even more depth here. This all is backed up with some very strong hooks and hymnal melodies singing angsty lyrics, and the improvement in the vocal performances makes it all even better. While I feel like this is a huge improvement, I think the full potential of the band is so big it is yet to come, adding a bit more of the midwest sound of the debut back to the formula. Still, songs like You Old Dog, Fluff My Pillow, and Zoloft shatter me completely, and the amount of times I came back to this album throughout the year is unwritten. If you're in for strong emo-pop hooks with beautiful, personal, and relatable lyrics, this is a full plate",
      "highlights": [
        "You Old Dog",
        "We Don't Want Your Cookies",
        "Fluff My Pillow",
        "Zoloft",
        "What Are You, a Cop?"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/a2c4b1974b7771c43736167975805561/12339509/origami-angel-feeling-not-found-Cover-Art.jpg",
      "score": "8.5",
      "artist": "Origami Angel",
      "album": "Feeling Not Found",
      "year": 2024,
      "title": "I waited for the perfect time not to try",
      "review": "Feeling Not Found is a deeply personal album that explores the experience of being terminally online, where the internet becomes your comfort zone because the real world fills you with anxiety, and the lack of reality in your life becomes a paradoxical anxiety. As Stereogum precisely puts it, \"The internet has a way of convincing us we're at a deficit in every aspect of life - relationships, money, the things we wear and do. It might be inescapable at this point, but Feeling Not Found is a lesson in seeking true fulfillment regardless\". This captures not only the essence of the album but the essence of the band, and reinforce the reason I love them so much. Here, the band wholly approaches the Power Pop style they developed in their mixtape and shows probably their most creative vocal melodies, followed by fantastic lyrics on par with the rest of the band catalog. While Feeling Not Found is poppier and less emo than their previous releases, the guitar work remains fantastic, and we have some of the best Pat Doherty transitions here. It admittedly has some weaker tracks, but the amount of great melodies and fantastic songs here is just absurd. Dirty Mirror Selfie and Where Blue Light Blooms are two of their best songs, with amazing lyrics and captivating melodies. The latter is also quite similar to their old style, showing that the band remains in their roots, even with the new sound. We also have their signature Pokémon reference in HM07 Waterfall, so yeah, you can't say the band is not the same. Fruit Wine is fantastic and has insane screams, Sixth Cents (Get It?) has great melodies and makes good criticism towards the current music industry, and Secondgradefoofight is just great in every aspect you'd expect from the band. One thing I consistently love about Origami Angel is how their albums are conceptually grand. Somewhere City was about finding a place to belong, Gami Gang was about nostalgia and the search for happiness, and Feeling Not Found tackles the fluidity of the digital age. Even if not as great as its predecessors, the highlights remain just as good as anything else the band has done, and prove how consistent and dedicated they are to their art and to give comfort to everyone who feels not found.",
      "highlights": [
        "Dirty Mirror Selfie",
        "Where Blue Light Blooms",
        "Fruit Wine",
        "Sixth Cents (Get It?)",
        "Secondgradefoofight"
      ],
      "honorable": 0
    },
    {
      
      "cover": "https://e.snmc.io/i/600/w/de2943c71f952620d5e9504cf3c5a08e/12430773/geordie-greep-the-new-sound-Cover-Art.jpg",
      "score": "9.1",
      "artist": "Geordie Greep",
      "album": "The New Sound",
      "year": 2024,
      "title": "And I want you to look at me as if I'm attractive",
      "review": "The first two black midi albums never really spoke with me. With Hellfire and its brutal prog sound, Black Midi started to sound like a spawning decade-defining group. So when I discovered the group ended just when I started liking them, I felt disappointed. That's when Geordie Greep appeared with a new solo record, which I cautiously approached. <br><br> Blues starts playing with its Pixies-inspired surrealistic lyrics full of emotional depth and its frenetic, insane riff. The song ends, and the tropical, Latin-style Tera Tera starts, only to show how diverse this album will be. After that, Holy, Holy comes as a mix of the maniac opener with the tropicalisms of the second track. The album progresses that way, blending Rock, Prog, Jazz, Fusion, and Latin Rhythms, sounding like an alternative reality in which Santana and Zappa teamed up with Black Midi. <br><br> The instrumentation is great and shows how many great studio musicians are hidden behind the big names on the album covers. Recorded between London and São Paulo, the tracks recorded in Brazil show the Jazzier and tropical elements of the sound, while the ones recorded in England show the British essence we came to expect from him. <br><br> The lyrics, which seem to be a negative topic for several people, are extremely well-written and profound. In fact, they were so well-structured that Geordie dedicates sections of songs entirely to recite them, putting some experimentation in the background but not letting the music distract you from what he's saying. They talk about living in an imaginary world, about traveling in a delusion you create of life to feel safe in a world that makes you insecure about everything. It uses fake confidence, intellectualism, and masculinity as facades for the insecure frightened characters. It's about people pretending to have perfect lives, but also about people who get thrown down because they don't have a perfect life and end up isolated, frightened, daydreaming, locked in their rooms building up plans, and imagining the lives they want to get while fearing never getting. It is also about prostitutes and STDs... well, at least in parts. <br><br> The entire concept of the album seems to have come from the song If You Are But a Dream, which is covered here and closes the album, and we also have a remake of the Black Midi concert-only song Lumps, which became Walk Up. My favorites are the already mentioned Blues and Holy, Holy, as well as the Black Country, New Road-esque The Magician, which is monumental and gorgeous. <br><br> The title, The New Sound, is no exaggeration. This album is unlike anything else, delivering a bold, genre-spanning masterpiece that cements Geordie Greep as one of the most inventive and definitive artists of our time.",
      "highlights": [
        "Blues",
        "Holy, Holy",
        "The Magician",
        "Through a War",
        "Bongo Season"
      ],
      "honorable": 0
    }
  ],
  "awards": [
    {
      "title": "Best Alternative Album of the Year",
      "nominees": [
        "Feeling Not Found - Origami Angel",
        "The Cleanest of Houses Are Empty - Carly Cosgrove",
        "Angel Interview - Meaningful Stone",
        "The Cure - Songs of a Lost World",
        "Prescribed Burn - cuni"
      ],
      "winner-sentence": "I may not feel found, but I'm not as lost as I used to be",
      "prize-picture": "https://i.scdn.co/image/ab6761610000e5eb3dd60a357263b6392e0183e8"
    },
    {
      "title": "Best Electronic Album of the Year",
      "nominees": [
        "Mahōgakkō - Hakushi Hasegawa",
        "Endlessness - Nala Sinephro",
        "Three - Four Tet",
        "Girl With No Face - Allie X",
        "PHASOR - Helado Negro"
      ],
      "winner-sentence": "Hakushi gets progressively more elctronic and, therefore, less appealing to me. Still, they're much better than anyone else in this realm. Unironically, my favorites here are the piano ballads, like Forbidden Thing",
      "prize-picture": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR5IgPLPdsPZ_ov_5EmkE4kIhb613p4W4d1TA&s"
    },
    {
      "title": "Best Experimental Album of the Year",
      "nominees": [
        "The Birth and Death of the Universe Through Mount Fuji - 3776",
        "Queda Livre - Caxtrinho",
        "Sentir que no sabes - Mabe Fratti",
        "To All Trains - Shellac",
        "She Reaches Out to She Reaches Out to She - Chelsea Wolfe"
      ],
      "winner-sentence": "Akira Ishida was probably higher than Mount Fuji when making this thing",
      "prize-picture": "https://m.media-amazon.com/images/M/MV5BMDBhZjQwZmQtYjVlMC00NmMxLWI4MzAtNWQxZmY5NTJhZTRmXkEyXkFqcGc@._V1_QL75_UX388_.jpg"
    },
    {
      "title": "Best Folk Album of the Year",
      "nominees": [
        "The Pilgrim, Their God and the King of My Decrepit Mountain - Tapir!",
        "Underdressed at the Symphony - Faye Webster",
        "Seed of a Seed - Haley Heynderickx",
        "Heavy Metal - Cameron Winter",
        "MJ Lenderman - Manning Fireworks"
      ],
      "winner-sentence": "Black Country, New Road gone folk. I'm all in.",
      "prize-picture": "https://bootlegsocial.co.uk/wp-content/uploads/2024/11/382467743_298922436216361_1818918889863851105_n.jpg"
    },
    {
      "title": "Best Heavy Album of the Year",
      "nominees": [
        "Cutting the Throat of God - Ulcerate",
        "Invincible Shield - Judas Priest",
        "Squee - Squee",
        "Absolute Elsewhere - Blood Incantation",
        "Artificial Bouquet - Frail Body"
      ],
      "winner-sentence": "Edgy me likes it.",
      "prize-picture": "https://www.rollingstone.com/wp-content/uploads/2020/03/Ulcerate.jpg"
    },
    {
      "title": "Best Hip Hop Album of the Year",
      "nominees": [
        "Por cesárea - Dillom",
        "Samurai - Lupe Fiasco",
        "Scrapyard - Quadeca",
        "I LAY DOWN MY LIFE FOR YOU - JPEGMAFIA",
        "No Hands - Joey Valence & Brae"
      ],
      "winner-sentence": "Thankfully, I've listened to this before his debut. If it was the other way around, I'd never get to this album, that's how hard his debut sucks. Still, Dillom seems to be following this trend of trappers migrating to alternative rock and making a blend that will soon receive a weird and pointless denomination in RYM. Can't wait for that. The record is pretty decent when making this blend, but when focusing only on rap it gets less entertaining. La novia de mi amigo and Cirugía are the best songs here, give them a try.",
      "prize-picture": "https://www.viapais.com.ar/resizer/v2/DE475ZE6QNBTNL3R5X332A7FA4.jpg?quality=75&smart=true&auth=cd144658d111425a737cebf8299c2d68004f2f539756e7f0b8e6b1484a4ce23a&width=980&height=640"
    },
    {
      "title": "Best Jazz Album of the Year",
      "nominees": [
        "The New Sound - Geordie Greep",
        "Mid Spiral - BADBADNOTGOOD",
        "The Messthetics and James Brandon Lewis - The Messthetics and James Brandon Lewis",
        "Fearless Movement - Kamasi Washington",
        "Odyssey - Nubya Garcia"
      ],
      "winner-sentence": "Santana-core jazz",
      "prize-picture": "https://musicainstantanea.com.br/wp-content/uploads/2024/08/Geordie-Greep.jpg"
    },
    {
      "title": "Best Pop Album of the Year",
      "nominees": [
        "Cacophony - Gumshoes",
        "Charm - Clairo",
        "A Dream Is All We Know - The Lemon Twigs",
        "Imaginal Disk - Magdalena Bay",
        "Something in the Room She Moves - Julia Holter"
      ],
      "winner-sentence": "Just so catchy and inventive.",
      "prize-picture": "https://e.snmc.io/i/600/w/52a794bab0637858aafd77a1f8eabf9f/11705776/gumshoes-cacophony-Cover-Art.jpg"
    },
    {
      "title": "Best R&B Album of the Year",
      "nominees": [
        "What Now - Brittany Howard",
        "As Grande As - Grande Mahogany",
        "Small Changes - Michael Kiwanuka",
        "Love Heart Cheat Code - Hiatus Kaiyote",
        "Submarine - The Marías"
      ],
      "winner-sentence": "Definition of soul",
      "prize-picture": "https://yt3.googleusercontent.com/QgcgYnr60UIRmGRnbaaXhnlxe9Y9Z4r50W9arX0z3ahUDWvSQMy9FXj1KY6iFsA3fpodLjtH3dg=s900-c-k-c0x00ffffff-no-rj"
    },
    {
      "title": "Best Rock Album of the Year",
      "nominees": [
        "No Name - Jack White",
        "Lampião Rei - Papangu",
        "Flight b741 - King Gizzard and The Lizard Wizard",
        "Saviors - Green Day",
        "Wine on Venus - Grace Bowers"
      ],
      "winner-sentence": "No name marked its name in history of rock",
      "prize-picture": "https://celulapop.com.br/wp-content/uploads/2024/07/2024_jackwhite_getty_2000x1270.jpg"
    },
    {
      "title": "Best Surprise of the year",
      "nominees": [
        "Por cesárea - Dillom",
        "Viva Hinds - Hinds",
        "Memoir of a Sparklemuffin - Suki Waterhouse"
      ],
      "winner-sentence": "👍 Surprisingly good",
      "prize-picture": "https://es.rollingstone.com/wp-content/uploads/2024/04/dillom_DSC0309v2-scaled.jpg"
    },
    {
      "title": "Best Foreign Album of the Year (Asia)",
      "nominees": [
        "Angel Interview - Meaningful Stone [South Korea]",
        "The Birth and Death of the Universe Through Mount Fuji - 3776 [Japan]",
        "TORCH - Necry Talkie [Japan]",
        "Mahōgakkō - Hakushi Hasegawa [Japan]",
        "Paramainomeni - Hoplites [China]"
      ],
      "winner-sentence": "One of the few Korean alternative acts I truly praise. Also, this is one of the few years in which Japan doesn't win here.",
      "prize-picture": "https://www.gethucinema.com/wp-content/uploads/2024/07/Meaningful-Stone-7-5QQBnK6910-768x958.jpg"
    },
    {
      "title": "Best Foreign Album of the Year (Europe)",
      "nominees": [
        "Romance - Fontaines D.C. [Ireland]",
        "As Grande As - Grande Mahogany [Finland]",
        "Endlessness - Nala Sinephro [Belgium]",
        "Rong Weicknes - Fievel Is Glauque [Belgium]",
        "Les chants de l'aurore - Alcest [France]"
      ],
      "winner-sentence": "Indie-ish Alt-Rock with Britpop mannerisms. It's much more predictable, upbeat, and mainstream, with less engaging production, having a tamer, less emotional sound than the band used to have. This concept the band follows of always changing their style results in never mastering any approach and always being subpar to what they could've been. That said, there are several catchy moments, and the performances are very sharp. Favourite is one of their best as well, so even if simpler and less interesting, the album is still able to give us some of the most inspired songs of the year",
      "prize-picture": "https://i.guim.co.uk/img/media/62157437af170c42a8afb21bd1164f39fb332871/0_2134_2740_1644/master/2740.jpg?width=1200&height=900&quality=85&auto=format&fit=crop&s=de77f29b7ff12b6ea552ca656b774b74"
    },
    {
      "title": "Best Foreign Album of the Year (North or Central America)",
      "nominees": [
        "Mid Spiral - BADBADNOTGOOD [Canada]",
        "Diamond Jubilee - Cindy Lee [Canada]",
        "867 - This Is the Glasshouse [Canada]",
        "Sentir que no sabes - Mabe Fratti [Guatemala]",
        "Girl With No Face - Allie X [Canada]"
      ],
      "winner-sentence": "Good",
      "prize-picture": "https://musicainstantanea.com.br/wp-content/uploads/2024/01/BADBADNOTGOOD.jpeg"
    },
    {
      "title": "Best Foreign Album of the Year (South America)",
      "nominees": [
        "Lampião Rei - Papangu [Brazil]",
        "Três - Hoovaranas [Brazil]",
        "Selah - Jesus Molina [Colombia]",
        "Queda Livre - Caxtrinho [Brazil]",
        "For the Rest of Your Life - twikipedia [Brazil]"
      ],
      "winner-sentence": "Misericórdia sepultada",
      "prize-picture": "https://sonylacerda.com.br/wp-content/uploads/2024/11/creditos-adri-l-4-1.jpg"
    },
    {
      "title": "Best Foreign Album of the Year (Oceania)",
      "nominees": [
        "Cutting the Throat of God - Ulcerate [New Zealand]",
        "Flight b741 - King Gizzard and The Lizard Wizard [Australia]",
        "Rebuild Repeat - Hockey Dad [Australia]",
        "Love Heart Cheat Code - Hiatus Kaiyote [Australia]",
        "Glimpse of the Dawn - Tarot [Australia]"
      ],
      "winner-sentence": "New Zealand representation for once",
      "prize-picture": "https://i.scdn.co/image/ab6761610000e5ebc11ea5a3b067a3bdb09aac3c"
    },
    {
      "title": "Best Debut of the Year",
      "nominees": [
        "The New Sound - Geordie Greep",
        "The Pilgrim, Their God and the King of My Decrepit Mountain - Tapir!",
        "Prescribed Burn - cuni",
        "Heavy Metal - Cameron Winter",
        "Where We've Been, Where We Go From Here - Friko"
      ],
      "winner-sentence": "If you count Black Midi, this would be far from a debut. But considering this as his solo debut, it's absurd how great it is.",
      "prize-picture": "https://www.nme.com/wp-content/uploads/2024/09/geordie_greep_2.jpg"
    },
    {
      "title": "Best EP of the Year",
      "nominees": [
        "Twice Around the Sun - Ugly",
        "Lucky Star EP - Faerybabyy",
        "Hot Sun Cool Shroud - Wilco",
        "I Will Be Pretty When I Die - I Will Be Pretty When I Die",
        "Winter Break - Five Point Palm Exploding Heart Technique"
      ],
      "winner-sentence": "Does it have enough length to be considered an LP? Yes, but if it identifies as an EP, who am I to decide it's not? I mean, I often do it, but only if it's over 40 minutes. Anyways, Ugly brings that Windmill sound we're getting used to, with horns and a lot of details in the structure of the song. Wheel opens the record with a melody that sounds very much like Gentle Giant, and that's absolutely amazing, making this the best song in the record. I can't think of any other band that was able to sound like them. They also have a folkier approach, but sound very different from Tapir!, almost as if the folk and the rock parts were happening simultaneously in parallel, instead of a blend of the two. So yes, like most of the Windmill artists, they are a huge amalgam of influences that ends up in a very unique and fantastic record. Can't wait for when they decide to say their albums are albums.",
      "prize-picture": "https://pbs.twimg.com/profile_images/1730189398224855040/TvfEbgQz_400x400.jpg"
    },
    {
      "title": "Best Album of The Year",
      "nominees": [
        "The New Sound - Geordie Greep",
        "Feeling Not Found - Origami Angel",
        "The Pilgrim, Their God and the King of My Decrepit Mountain - Tapir!",
        "The Cleanest of Houses Are Empty - Carly Cosgrove",
        "Angel Interview - Meaningful Stone"
      ],
      "winner-sentence": "A definitive album for our time, will probabluy just grow with time",
      "prize-picture": "https://i.guim.co.uk/img/media/2438b65afab9f482ab96f19d2daa3acc4ab298b2/308_2285_3594_2156/master/3594.jpg?width=1200&height=1200&quality=85&auto=format&fit=crop&s=1c73e345e11eaec4a679e0fe901a0f01"
    }
  ],
  "last_modified":"January 14, 2026 at 15:54"
}