{
  "list": [
    {
      "cover": "https://e.snmc.io/i/600/w/7820cf3ce289148eb9d687cb140d9ccb/13249019/king-gizzard-and-the-lizard-wizard-phantom-island-Cover-Art.jpg",
      "score": "7.7",
      "artist": "King Gizzard and The Lizard Wizard",
      "album": "Phantom Island",
      "year": 2025,
      "title": "Transcend this life",
      "review": "Phantom Island is basically Flight b741 with an orhcestral skin, keeping the same melodies and boogie rock songwriting, only with those horns and strings in the beackground every now and then. Even so, the melodies are so beautiful and fall so easy on the ears. The album is pretty consistent as well, even if it lacks a bit in highlights. Another instance of the ever-growing genres King Gizzard has explored.",
      "highlights": [
        "Grow Wings and Fly"
      ],
      "honorable": 1
    },
    {
      "cover": "https://e.snmc.io/i/600/w/b9d4f80f8b230fd90f0800b5e6375085/13471244/psychedelic-porn-crumpets-carpe-diem-moonman-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Psychedelic Porn Crumpets",
      "album": "Carpe Diem, Moonman",
      "year": 2025,
      "title": "In Chinese whispers",
      "review": "The aussies from Psychedelic Porn Crumpets started as great Gizzard clones and quickly became stale, making a good bunch of decent but unimpressive records. In \"Carpe Diem, Moonman\", however, they gathered everything they learned throghout the years and display a show of creativity. The album has ecletic, great songwriting, with above the average instrumentation and a lot of new territories for the band. A lot of these songs have a Sludge Metal feel to them, while Qwik Maff is a Math Rock song and Concrete & Cola has a very indie, dreamy sound. This all coexists with the more Garagy and Psychedelic style they were known for, making an album that is sometimes a bit too out there, but that does a decent job in each style it tries to experiment with. The vocals here are also much better than the usual for the band, representing a significative improvement, and the guitar work has some impressive stand-outs as well. I think the main problem with the album is the structure of the songs, that is always confusing and lacks dynamics for the most part. It makes songs inconsistent, and therefore the album lacks truly groundbreaking moments. The first song is fantastic, but all other songs are either a bit underdeveloped or just kind of derivative. Still a strong album, though.",
      "highlights": [
        "Another Reincarnation"
      ],
      "honorable": 1
    },
    {
      "cover": "https://e.snmc.io/i/600/w/3cfb5489e8fb86d1cee1107a4cc1b8ba/12733719/horsegirl-phonetics-on-and-on-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Horsegirl",
      "album": "Phonetics On and On",
      "year": 2025,
      "title": "They walk in two's; Da da da da da da da da da da da da da ",
      "review": "Horsegirl released a deserving follow-up to their debut, with a sophomore album even more straight-forward and simple than the debut. They retain their slacker lo-fi production but with much better melodies that resemble the Twee Pop aesthetic. The guitars are not very skilled but they somehow still sound so nice and comforting. The vocals sound better and I really like the singer's accent. The album lacks standout moments, but it's really consistent and aesthetically homogenous in a good way. The songs are a bit too simple sometimes, but they're really creative, so it works well in the end. Also, the album has some obsession with the number two, which is... cool, I guess.",
      "highlights": [
        "2468",
        "Well I Know You're Shy"
      ],
      "honorable": 1
    },
    {
      "cover": "https://e.snmc.io/i/600/w/78b30b1e90aac351fedaa3d1d4115ae0/12986981/black-country-new-road-forever-howlong-Cover-Art.png",
      "score": "7.7",
      "artist": "Black Country, New Road",
      "album": "Forever Howlong",
      "year": 2025,
      "title": "Chopped off your beautiful purple hair",
      "review": "While the absence of Isaac Wood didn't affect Live At Bush Hall, it is very clear in their studio follow-up. With Forever Howlong, the band leans towards a much poppier approach. That's not an issue by itself, but the result is very unfocused, with much less dynamics - everything has that soothing sound and never escalates - and a disappointing underuse of their incredible musicianship. The country influences in some songs worked very poorly as well. The songs are repetitive and long as well, contributing to the unfocused feeling this record brings. It gets the worst concepts in Bush Hall and expands them. The lyrics in most songs mean absolutely nothing as well, being a huge counterpoint to the emotionally driven songs that all their other albums had. \"I'm a walking TikTok trend\" makes me wonder what the hell happened to \"show me the place where he inserted the blade\".<br><br>The lack of electric guitars also annoys me - Live At Bush Hall had plenty of piano-led songs, and they were great in that way, but here the songs seem to lack body, and I think this could've been filled with guitars. Also, there's an evident lack of highlights. For the First Time wasn't perfect, but its best moments were groundbreaking. The best songs here are not even close to that. The only true highlight here to me is The Big Spin, which, as great as it is, sounds more like an amalgam of the melodies in Live at Bush Hall. Listen to this song after or before that album; it would be a great opener or closer in that context. So yeah, I'm saying a lot of bad things about the album, but the beautiful, dramatic arrangements, great vocals, and complex structures are still present. The band is still one of the most unique ensembles in modern music. The melodies are not as creative and unique as they used to be, but they're nice as well. The instrumentation lacks that punch and dynamics it had before, but that doesn't make everything inherently bad. The album is very disappointing, considering what they've released before, but still considerably above the average.",
      "highlights": [
        "The Big Spin"
      ],
      "honorable": 0
    },
    {
      "cover": "https://e.snmc.io/i/600/w/2e4bd1364f46b62c52c0201173fc7dc9/13094466/hesse-kassel-la-brea-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Hesse Kassel",
      "album": "La Brea",
      "year": 2025,
      "title": "Una vida polar, higiénica, poética, estética, estéril o minimalista",
      "review": "Very beautiful Post-Rock with jazz and chamber elements that come straight from Black Country, New Road. A lot of spoken word influences that come from Slint as well. It sounds like the more moody parts of For The First Time, which were the best part of their debut, so I really liked it. The indie scene in Chile was very close to culminating in something like that, and I'm very happy it did. Though the BCNR influences are very evident, I think we really need more BCNR copies out there, since they themselves are going for a more poppy sound. We are having a lot of bands inspired by this Windmill sound (and some of them will be mentioned later in the list), so it's really nice to see how influential Ants From Up There was. The atmosphere here is really good, and though the songwriting is very strong, the songs lack a bit of emotional commitment. The length of the songs and the album as a whole is a bit too much as well. It's not that the album is not nice throughout its entirety; it is. Still, such massive songs make some of the appeal fade into the background. People saw the Jazzers, later the Proggers, and even more recently the Post-Rockers write long songs and want to do that as well, but they don't always understand that what made those work was the constantly changing ideas and expansive sounds. So all in all, a very ambitious and strong album, that shows how great the Chilean indie scene is.",
      "highlights": [
        "Postparto",
        "Vida en Terranova"
      ],
      "honorable": 0
    },
    {
      "cover": "https://e.snmc.io/i/600/w/11830267687080fce24254c030d9215e/13177399/cmat-euro-country-Cover-Art.jpg",
      "score": "7.7",
      "artist": "CMAT",
      "album": "Euro-Country",
      "year": 2025,
      "title": "I'm twenty-three and everyone is having fun except for me",
      "review": "A pretty strong Pop Rock record, with slight country influences here and there. Her voice is really good, with a great range, and she plays well with her voice in the songs, giving good variation in the songs. She has a very Irish feeling in the way she sings, which is nice as well. The melodies are beautiful, the instrumentation above the average of a pop record, and the vibe is just very light and cozy, with lyrics portraying creative perspectives on a young girl's sentimental journey.",
      "highlights": [
        "Euro-Country",
        "The Jamie Oliver Petrol Station",
        "Iceberg",
        "Coronation St."
      ],
      "honorable": 0
    },
    {
      "cover": "https://e.snmc.io/i/600/w/4a5a008c112e3b975a6b652bc9e0fba2/13351018/laufey-a-matter-of-time-Cover-Art.jpg",
      "score": "7.7",
      "artist": "Laufey",
      "album": "A Matter of Time",
      "year": 2025,
      "title": "At least I'm self-aware",
      "review": "In her debut, Laufey focused on very throwback Vocal Jazz and Traditional Pop. In Bewitched, she tried going for a more modern approach, more in touch with modern Pop music, reaching a more mainstream audience with mixed results for the fans of her debut. In her third record, she finds a good middle point between both approaches in Chamber Pop - mixing the strings and orchestral arrangements of the past with indie white girls lyrics and vocal melodies, she's able to make a very beautiful and touching album, that is very mainstream but also able to be distinctive with its arrangements. The lyrics are kind of bad, but that was never the reason I listened to her. Even so, she's very creative with the arrangements, with some very intricate and unique details here and there. The more singer-songwriter songs here are not as good, but I love her take on Vocal Jazz, and tracks like Clockwork and Lover Girl are absolute treats. Her voice is maybe even better here than in the debut, which is impressive, because I already thought she was one of the best voices of the industry. A great album and return to form for Laufey.",
      "highlights": [
        "Clockwork",
        "Lover Girl",
        "Tough Luck"
      ],
      "honorable": 0
    },
    {
      "cover": "https://e.snmc.io/i/600/w/bca8022abd0a73d71f4a94276506ebcf/13101077/honningbarna-soft-spot-Cover-Art.png",
      "score": "7.7",
      "artist": "Honningbarna",
      "album": "Soft Spot",
      "year": 2025,
      "title": "Igjen, igjen, igjen",
      "review": "The Norweigian beasts are back with another great album full of fun punk songs. Second half gets much worse and honestly, a bit generic, but the first few songs are banger after banger. The vocals are furious and great, and the guitar work is heavy and really well-played, contrasting greatly with the catchy vocal melodies. The noisy elements work greatly, giving depth and even more energetic dynamics. It is a bit less impressive in terms of the melodies than Animorphs, but the best songs in here are just as good. In fact, Festen som aldri stopper is my favorite song of the band.",
      "highlights": [
        "Amor fati",
        "Festen som aldri stopper"
      ],
      "honorable": 0
    },
    {
      "cover": "https://e.snmc.io/i/600/w/7a379b39bc3ce28ecbc2da2934a11832/13324520/nourished-by-time-the-passionate-ones-Cover-Art.jpg",
      "score": "7.8",
      "artist": "Nourished By Time",
      "album": "The Passionate Ones",
      "year": 2025,
      "title": "Maybe I'm afraid of the future",
      "review": "A slight improvement on the debut, with a slicker production, more synths, and even more Soul elements, which I liked. Still, I feel that the problem of being too airy and atmospheric has worsened in here. I mean, the mood is fantastic, but his best efforts happen when he focuses on the melodies. Even so, there are more highlights, and the great moments here are really special.",
      "highlights": [
        "Max Potential",
        "Baby Baby",
        "Tossed Away"
      ],
      "honorable": 0
    },
    {
      "cover": "https://e.snmc.io/i/600/w/00ff64b8feb6afc7c55a990229514d87/13235153/no-buses-nb2-Cover-Art.jpg",
      "score": "7.8",
      "artist": "No Buses",
      "album": "NB2",
      "year": 2025,
      "title": "No reason to wait, but I'm waiting",
      "review": "Keeping the noisier and more experimental tone of their sophomore album and the moodier, denser sound of their third record, NB2 finds a nice, comfortable middle ground between both sides of the band. The sound is still sometimes too light and smooth to me, lacking the energy that made the first album so good, and not being as creative and melodically challenging as the second album. The drums sound like shit as well. I don't know what it is with some indie bands that can make their drums sound like trash when literally a phone in distance can record it decently. Still, there's a lot of nice experimentation here, and the mathier sound worked well. Highlights are Inaho, the very experimental, almost Radiohead-ish Kaze, and the fantastically emo Them Us You Me.",
      "highlights": [
        "Inaho",
        "Kaze",
        "Them Us You Me"
      ],
      "honorable": 0
    },
    {
      "cover": "https://e.snmc.io/i/600/w/be3c6b5806a55dab73a7f8ca78624cc3/14052848/mac-demarco-guitar-Cover-Art.jpg",
      "score": "7.8",
      "artist": "Mac DeMarco",
      "album": "Guitar",
      "year": 2025,
      "title": "My love must be broken",
      "review": "A very, very chill Mac. His music always had this bittersweet meditative feel to them, but this one is just in another level. The songs might not be as catchy or well-developed as some of his other work, but the stripped-back production allows a very open, naked feeling showcase. His guitar work is also very decent, as shown in songs like Rock and Roll. The vocal performances are also a standout, very intimate and beautiful. It also has some of his most beautiful and haunting lyrics, like in Phantom. I feel like people dismissed the album for being too simple, but that was always Mac's biggest strength - he knows how to connect with you and finds beauty in the sadness and in the simplicity, in the mundane. It's just very casual, unpretentious, but still profound in its own meditative way. In Guitar, he redefines the simplicity and still lends a very good album. Just like most of his work, it's inconsistent, but the best moments are amongst his best material.",
      "highlights": [
        "Shining",
        "Phantom",
        "Nightmare"
      ],
      "honorable": 0
    },
    {
      "cover": "https://e.snmc.io/i/600/w/2b7040d4505356091f1f4ab74cf4c407/13852910/haley-heynderickx-and-max-garcia-conover-what-of-our-nature-Cover-Art.jpg",
      "score": "7.8",
      "artist": "Haley Heynderickx & Max García Conover",
      "album": "What of Our Nature",
      "year": 2025,
      "title": "It's easy being quiet, but it ain't easy being alone",
      "review": "While Haley took around 6 years between her debut and sophomore album, her third record came only a year later. Here, she teams up again with Max and expands even further the sound from the previous record. Even more traditionally american, this album leans in a much more political side of both, trying to recapture Woody Guthrie's political songwriting. Like I said last year, I think Haley is too talented to trade her authenticity to a more traditional side of folk, but still, things are what they are. Even so, the duo delivers a strong traditional folk record. The great instrumentation remains here, even if Haley's voice seems to become less unique with time. I like how Max's lyrics are more politically-charged and more similar to traditional protest songs, while Haley's songs focus more on the emotional impact of the political conflicts in the world. Some of the lyrics here are really strong, by the way, even if I'm still more fond with the ones in her previous albums. Also, both their styles are very outlined in the songs, which is cool but also seems more like an album split in half than an actual collaboration. So all in all, an album full of its ups and downs, but that shows a different side of these artists, showing great criticism while still delivering some strong highlights.",
      "highlights": [
        "Song for Alicia",
        "In Bulosan's Words",
        "Fluorescent Light"
      ],
      "honorable": 0
    },
    {
      "cover": "https://e.snmc.io/i/600/w/ef5e22a5e7c78115920395fec65a0ecf/12740749/mac-miller-balloonerism-Cover-Art.jpg",
      "score": "7.9",
      "artist": "Mac Miller",
      "album": "Baloonerism",
      "year": 2025,
      "title": "What does death feel like?",
      "review": "I never liked Mac's rapping, but the instrumentation and the singing parts in here are absolutely stunning. There are some very jazzy moments that I love, as well as some very psychedelic and abstract moments, like the closing track. The production is great as well, very detailed, with ambient recording, proving this was an album of proper recordings by him, not just scraps, like many posthumous albums are. It apparently was assembled as a successor of Faces, and that would make sense. The album really does sound like an evolution of Faces, unbloating it and only keeping the best parts of the former. The organic instrumentation here is also fantastic, and mainstream music really needs to return to this sound. My main issue with the record, besides the rapping, is how the album changes between the great, emotional lyrics that make him so talented and some romanticization of the drug abuse that ended up killing him. All in all, the album is a little irregular, and some of the lyrics are actually pretty weak, but the moody, abstract sound with vivid production makes this one of the strongest album in Hip Hop in a long time. He was really building up the sound that I would end up loving in Circles.",
      "highlights": [
        "5 Dollar Pony Rides",
        "Funny Papers",
        "Rick's Piano"
      ],
      "honorable": 0
    },
    {
      "cover": "https://e.snmc.io/i/600/w/b41048044b4aadeed6fb13ffad050754/13735406/john-michel-and-anthony-james-egotrip-Cover-Art.png",
      "score": "8.0",
      "artist": "John Michel & Anthony James",
      "album": "Egotrip",
      "year": 2025,
      "title": "Eternally searching for validation",
      "review": "Egotrip is one of these Hip Hop albums that seem not to be too attached to the constraints of the genre. It's not that this album is extremely experimental, but it blends Jazz and Soul music so well that the Hip Hop itself starts to feel less important. To some people, this might be a detriment. To me, this is the best form that Hip Hop can achieve. I loved the instrumentation, and it interacts really well with John Michel's voice, which is really deep, intense, and melodic. Most of the samples worked really well, especially those with a strong guitar presence. I mean, I'm biased when talking about guitars, but still, \"World's End\" is undeniably great. The first songs have awful pop samples, though, and this pattern repeats in a few songs. Those chipmunk choruses didn't land in me here. The lyrics are also not always that effective, and they are often ego trips (the title was not lying about that). Even so, the songs are so good and flow so well, marking a very consistent record, that I can't help but love them.",
      "highlights": [
        "Egotrip",
        "Admit My Guilt (Interlude Pt. 2)",
        "World's End",
        "Sunday Morning, Genesis."
      ],
      "honorable": 0
    },
    {
      "cover": "https://e.snmc.io/i/600/w/4c98a64aa235c18effbf0cc2423e0177/13672127/racing-mount-pleasant-racing-mount-pleasant-Cover-Art.jpg",
      "score": "8.0",
      "artist": "Racing Mount Pleasant",
      "album": "Racing Mount Pleasant",
      "year": 2025,
      "title": "I'm a mess",
      "review": "Look, it's a BCNR clone. Another BCNR clone. Not even the last BCNR clone on this list. The horns' pitch and position are unashamedly identical. The way the singer calls to Emily, just like Isaac does with Concorde, is plain plagiarism. Yes, they do have folk influences, but if you want a Windmill Scene band that has incorporated folk in an authentic way, drinking from multiple influences, you can listen to Tapir!. This one has a very evident influence. When listening to Kingfisher, it's even clearer how they were influenced by the band, considering they didn't sound remotely like this before Ants From Up There. That said, in a year when BCNR changed their sound to something much more pop and less emotionally charged, having a BCNR clone inspired by Ants From Up There is not a bad thing. <br><br> The melodies are absolutely stunning, and the production is really soft and enduring. The performances are not on par with BCNR, but they're still great. The songwriting is also very strong. It is not as cathartic and emotionally charged as my favorite bands in the style, only achieving this grandiose sound in the opener and the closer, but they take a more meditative approach that works well with their style. Lyric-wise, the band is not that special, to be honest. Now, I thrashed this album to death, but even with all this criticism, it's still a fantastic album, with beautiful, well-structured songs. The band's biggest flaw here is being so evidently inspired by a group much better than them. But for those orphans of Isaac (like me), this is a really great record, able to recapture part of that magic. It just lacks a bit of authenticity. Simply being able to be compared to BCNR is a great feature by itself.",
      "highlights": [
        "Your New Place",
        "Seyburn",
        "Your Old Place"
      ],
      "honorable": 0
    },
    {
      "cover": "https://e.snmc.io/i/600/w/1ea57826218f8c7df96d0805961e9ba6/12977744/deafheaven-lonely-people-with-power-Cover-Art.jpg",
      "score": "8.1",
      "artist": "Deafhaven",
      "album": "Lonely People With Power",
      "year": 2025,
      "title": "All hail now the panopticon",
      "review": "Deafhaven is that kind of band that transcends its genre. I'm not the biggest fan of extreme metal, but I really like Deafhaven's discography, and I know several other people who share the same view. The way they blend shoegaze's textures and beauty with the weight and guttural vocals of black metal is still the best I've ever seen. In their sixth album now, the band makes a lighter, more melodic approach to their Blackgaze style, but that keeps all the intensity they always had. The instrumentation is much more than just blasting the drums and the guitar, with good timing, textures, and structures that value catharsis. The shorter length of the tracks works in favor of them as well, and the balance between melody and weight is mastered here. It's also impressive how the singer can be so melodic while literally screaming. Amongst the best extreme metal vocalists I know. All in all, Lonely People With Power is a masterpiece of extreme metal that even those outside of the bubble can love.",
      "highlights": [
        "Doberman",
        "Body Behavior",
        "Winona"
      ],
      "honorable": 0
    },
    {
      "cover": "https://e.snmc.io/i/600/w/1ed2a03e4950efa37b69ba3fdf4dbe9d/13649650/hannah-frances-nested-in-tangles-Cover-Art.jpg",
      "score": "8.2",
      "artist": "Hannah Frances",
      "album": "Nested In Tangles",
      "year": 2025,
      "title": "Learning to trust, in spite of it, is life's work",
      "review": "Hannah keeps her foray into the wilderness with her meditative folk. In this album, however, she explores a more dazzling, experimental sound, delving into new textures, horns, angular rhythms, polyrhythm, and avant-garde structures. Even so, her stunning melodies and great voice remain the moving force here, leading the strong, creative proggy arrangements into a refreshing sound in the folk scene. Regardless, it's undeniable that her best moments are still when she fingerpicks her guitar with the gentleness and emotion that only she can perform. There are a lot of melodies that I recognize from her previous records, but I don't mind because it really sounds like this is the ultimate version of those. I admitedelly am not a huge fan of the spoken-word sections as well. All in all, the mixing of the experimental and lush sides of the album complements each other in a fantastic way, resulting in the best album of her career.",
      "highlights": [
        "Nested in Tangles",
        "Life's Work",
        "Survivng You"
      ],
      "honorable": 0
    },
    {
      "cover": "https://e.snmc.io/i/600/w/58ada0482d6f8538fe8091848315b1d7/12905230/destroyer-dans-boogie-Cover-Art.jpg",
      "score": "8.2",
      "artist": "Destroyer",
      "album": "Dan's Boogie",
      "year": 2025,
      "title": "To have loved and lost is the same thing as nothing at all",
      "review": "The middle point between the chamber arrangements of Destroyer's middle phase and the hazy ambient production of the Kaputt-era records. And, honestly, it works fantastically. The songwriting is great, the lyrics are as enigmatic, idiosyncratic, and reality-bending as ever, and his performances are some of the best he's ever had. As always, I'm less enthusiastic about the more Kaputt-styled tracks than most people seem to be, even because this record has one of the worst productions of all Destroyer records, including the lo-fi phase. The instruments are all blended together in a noisy amalgamation of compressed instruments, which makes some songs much weaker than they could have been. Sun Meet Snow, for example, would be a fantastic jammy rocker if not for the crescendo being so terribly mixed. The drums, particularly, sound like shit, which is a shame, because the drum lines here are very interesting. Not all songs are terribly produced, but all of them leave a taste of over-compression. Aside from the production, I think this is one of Destroyer's best albums in a long time, maybe the best since Rubies for my taste. My favorite tracks are the eerie, poetic opener in The Same Thing as Nothing at All, the Rubies-like Dan's Boogie, and the simple yet beautiful closer Travel Light.",
      "highlights": [
        "The Same Thing as Nothing at All",
        "Dan's Boogie",
        "Travel Light"
      ],
      "honorable": 0
    },
    {
      "cover": "https://e.snmc.io/i/600/w/75b2cf39da593af78fb788f0a8af9c62/12966954/frog-1000-variations-on-the-same-song-Cover-Art.png",
      "score": "8.3",
      "artist": "Frog",
      "album": "1000 Variations on the Same Song",
      "year": 2025,
      "title": "If I had the balls, I'd marry you",
      "review": "With a more traditional sound, the oddballs of Frog release one of their best album yet. Inspired by variations in classical musical, like the Goldberg Variations by Bach or the Diabelli Variations by Beethoven, Bateman wanted to make an album that could never end. He didn't want the songs to be exactly just variations like the classical interpretations of the genre, but wanted them to be similar enough and hold the same mood. And man, he nailed the perfect mood for a project like this. The songs are atmospheric, lo-fi, nostalgic, and just really beautiful. It is more toned-down, sounding a bit like Count Bateman did. The quirky vocal melodies lead by his falsetto register remain here, being their trademark and the best part about Frog. The songwriting here is more simple and direct to facilitate the mood consistency, with more common structures and a more piano-centered sound, but with enough space for guitars to shine as well. I'd say it's somewhere between Indie Rock, Indie Pop, Folk, and Piano Rock. There's room even for mathy guitars in Top of the Pops, for example. The result also gives probably the most consistent album in their repertoire, with very few songs that doesn't work. I admit that the lyrics here are weaker than most of their work, though. They're a bit too abstract and sometimes doesn't find a foot in the emotional landscape as they used to do. Even so, we still got masterpieces like a modern, stoner New-Yorkers version of Arthur McBride. A great record, that gathers a lot of what makes Frog work and group in a big, concise journey.",
      "highlights": [
        "Stillwell Theme",
        "Top of the Pops Var. I",
        "Blaming It All on the Lifestyle Var. V ",
        "Mixtape Liner Notes Var. VII",
        "Arthur McBride on the Lower East Side Var. X"
      ],
      "honorable": 0
    },
    {
      "cover": "https://e.snmc.io/i/600/w/46d94bf05a8b929e40da239ded3d756f/13804732/jeff-tweedy-twilight-override-Cover-Art.jpg",
      "score": "8.3",
      "artist": "Jeff Tweedy",
      "album": "Twilight Override",
      "year": 2025,
      "title": "Feel free to fall in love with the people you know, and fall harder with the people you don't",
      "review": "Jeff is one of, if not THE best songwriter in current music. His work with Wilco is outstanding, and it's impressive how much great music he keeps consistently releasing through time. His solo stuff so far was not quite in the same level, until Twilight Override. In this triple album, Jeff releases his three best solo albums all at once. They are all very warm and fantastically produced, with a soothing yet kind of depressing tone to them. The three discs are very similar in tone, but all of them have enough creativity and difference in songs so it rarely gets tiring. The textures and palettes in the production make every song unique, and the more upbeat, band numbers, also help with pacing. Of course, a triple album is bound to have some weaker tracks, but the amount of highlights is impressive, and even the setbacks work really well in the context of the listen. <br><br>This is not an album for you to wash the dishes with, but an album for you to open your window in a summer night and think about life, love, mortality, and let all your feelings pour out. You noticed I'm describing a Wilco album, right? That's because it is the most Wilco sounding record of his solo career yet, and probably the reason why it's the best as well. There's a lot of textures and interesting experimentation going on that resemble the sound of Cousin, but it's more rooted in the a folksy and warm sound, becoming something of its own. The lyrics here are also on par with the best from his career, which is absolutely amazing. We have amazing one-liners like \"Are you far away or are you close enough to be betrayed?\", \"I get so far behind I forget I'm following\", and \"'Cause rock and roll is dead, but the dead don't die\" in Lou Reed Was My Babysitter, one of Tweedy's best odes to Rock music. All in all, a great, extremely consistent album. A long stretch, yes, but one worth the course.",
      "highlights": [
        "Caught Up in the Past",
        "Love Is for Love",
        "Betrayed",
        "KC Rain (No Wonder)",
        "New Orleans",
        "Feel Free",
        "Lou Reed Was My Babysitter",
        "Saddest Eyes",
        "Enough"
      ],
      "honorable": 0
    },
    {
      "cover": "https://e.snmc.io/i/600/w/b9a9581d4476482edb8f38de2c6fe52f/12614579/lambrini-girls-who-let-the-dogs-out-Cover-Art.jpg",
      "score": "8.4",
      "artist": "Lambrini Girls",
      "album": "Who Let the Dogs Out",
      "year": 2025,
      "title": "Your woke persona is completely fucking terrifying",
      "review": "My first time listening to it, I thought I could read an article for college meanwhile. After the first few seconds in Bad Apple, I was already aware that this would need my full attention. Their debut EP was recommended to me back in the day and, despite some awfully online lyrics, I liked the overall attitude, heavy instrumentation, and melodic vocals.<br><br>While their debut album is still a bit terminally online, they are much more mature and make much better and more profound criticism than \"all men suck!\". The lyrics are honestly almost a sociological and political study in some songs, with themes ranging from autistic struggles, difference in gender treatment in offices, gentrification, eating disorders, between others. Like I said, much more mature. It's easy to compare their more mature style in songs like Company Culture and Nothing Tastes as Good as It Feels, which have fantastic lyrics, with their EP style in Big Dick Energy, in which the narrator is belittling someone because they act like toxic heteros while not having that big of a penis. I think they try to make some comedic approach to some of these lyrics, and though it works sometimes, when you're yelling a bar with your goddamn soul, you better as well be serious, because you're going to sound like you mean it. Still, the moment she sings \"Also, diet drinks taste like absolute fucking shit. Give me full fat, you fucking bastards\" with a very British accent after such heavy, well-written, and emotional lyrics in Nothing Tastes as Good as It Feels is comedy gold.<br><br>The instrumentation also got, somehow, much better after the band was reduced by half. The riffs are great, some melodic and others leaning into a heavier sound, but all of them are just very catchy, well-performed, and really impressive. The song structures also improved a lot, with some really epic songs with amazing bridges. Her vocals are also even better than in the EP. No Homo has a very Green Day-esque chorus to me, which is always pretty cool.",
      "highlights": [
        "Bad Apple",
        "Company Culture",
        "Nothing Tastes as Good as It Feels",
        "You're Not From Around Here",
        "Special Different"
      ],
      "honorable": 0
    },
    {
      "cover": "https://e.snmc.io/i/600/w/d265b3bcc976fa479c9559ef9cbaf0f9/13592904/geese-getting-killed-Cover-Art.jpg",
      "score": "8.6",
      "artist": "Geese",
      "album": "Getting Killed",
      "year": 2025,
      "title": "My love takes a long time, longer than a lover can survive",
      "review": "In Getting Killed, Geese crafts a much more consistent and cohesive album, with a well-established sound that builds upon the best of 3D Country. The album is incredibly consistent, and every single track here is extremely beautiful and meticulously crafted, with not a single weak song. The album also greatly balances their intricate and idiosyncratic melodicism and creativity with a more experimental and elaborate undertone that actually works this time. It is probably a reflex of the overall increase in the band's ability as well, as they sound much tighter and make a more creative and detailed usage of their instruments. The basslines, in particular, are fantastic in here, bit it extends to every instrument really. This is a direct outcome of the resurgent interest in ensembles and groups, instead of single artists with rotating supporting bands. Now the bands actually have time to find their styles, improve their abilities, and become the best they can be. And as I said before, Geese was able to get everything that worked in 3D Country and improve it. The opener in Trinidad is an incredible throwback to 2122, opening the record chaotically, loudly, and abrasively, and showing that, while going for a different route, they still have the Punk in them. They get the style of songs like 3D Country and Cowboy Nudes, extract the Roots Rock essence in them, add a cup of the nasally, high-pitched chants of Heavy Metal, and a spoon of Winter's poetry to create this very spiritual, yet rootsy rock album. Long Island City Here I Come is a fantastic closer that packs together everything the album has been building up in a striking song. I particularly love the more meditative songs, such as Cobra and Husbands. All in all, Getting Killed is the culmination of all the great ideas in 3D Country becoming cohesive and coherent. A unique piece of music and a breath of fresh air in modern rock",
      "highlights": [
        "Trinidad",
        "Cobra",
        "Husbands",
        "Getting Killed",
        "Long Island City Here I Come"
      ],
      "honorable": 0
    },
    {
      "cover": "https://e.snmc.io/i/600/w/4c765cec4f95ef4b07542c6e4c3bc5ce/13882217/candelabro-deseo-carne-y-voluntad-Cover-Art.png",
      "score": "8.8",
      "artist": "Candelabro",
      "album": "Deseo, carne y voluntad",
      "year": 2025,
      "title": "Dame algo en qué creer; No lo soltaré",
      "review": "As I mentioned in Hesse Kessel, the Chilean Indie scene was slowly evolving into some Post-Rock influenced sounds, and Candelabro inevitably followed the BCNR path. Like I already said sometimes in here, this Windmill style is certainly the best thing to appear in music since the 2000s, maybe since the 1970s. So, even if the comparisons are inevitable, I love some BCNR clones, and I think that Candelabro is one of the most authentic artists in this wave. They're able to blend this style with their unique chanting, melodic, emo-like vocals, like in Domingo de ramos, or in the jazzy Prisión de carne, in the ending of Ángel, or the chorus of Fracaso. The constant references to Chile's politics and art also make it very authentic to them, something that most Windmill variants aren't able to reproduce. The performances here are absolutely outstanding, marking a very significant improvement over the debut, that was already great. Matías Ávila's vocals are particularly great, one of my favorite voices in music right now. The band do take the explorations a bit too far and fill the record with too many songs, and many of them are a bit derivative, but the arrangements are so sublime that it still holds up.<br><br>What is curious, though, is how the best moments of the record are exactly the ones in which the band sound the most like themselves, blending this more avant-garde, maximalist, complex instrumentation with their incredible melodies instead of just being adventurous. That makes the length even more tiresome, because the best parts are usually the least explored ones. Another complaint I have is that the lyrics, although great, seem more distant and political than they were in the debut. It's not an actual problem, and the lyrics in here are great, but I prefer more emotional lyrics over this style. I could also add that the crescendos tend not to be as abrasive or emotionally destructive as BCNR, for example. Of course, that's an unfair fight, and it only means it's not the best album of the decade, but it doesn't diminish its greatness.<br><br>Regardless, the amazing songwriting allied with the incredible arrangements and instrumentation, and the great concept of using religion as a framework to discuss the topics they usually talk about in their songs, make this a fantastic record. The best from this fantastic indie scene in Chile.",
      "highlights": [
        "Domingo de ramos",
        "Prisión de carne",
        "Ángel",
        "Fracaso",
        "Cáliz"
      ],
      "honorable": 0
    }
  ],
  "awards": [
    {
      "title": "Best Alternative Album of the Year",
      "nominees": [
        "1000 Variations on the Same Song - Frog",
        "Dan's Boogie - Destroyer",
        "Guitar - Mac DeMarco",
        "NB2 - No Buses",
        "Phonetics On and On - Horsegirl"
      ],
      "winner-sentence": "I feel like we're getting closer to the time in which Bateman will ribbit in his songs...",
      "prize-picture": "https://thedailymusicreport.com/wp-content/uploads/2025/02/Frog-1000-Variations-on-the-Same-Song-press-1024x683.jpg"
    },
    {
      "title": "Best Electronic Album of the Year",
      "nominees": [
        "Switcheroo - Gelli Haha",
        "I Love My Computer - Ninajirachi",
        "She Comes From Nowhere - Neggy Gemmy"
      ],
      "winner-sentence": "One of the most fun records of the year. The melodies are simple but realy catchy, and the production is really well done, with lots of great textures and interesting electronic touches",
      "prize-picture": "https://i.guim.co.uk/img/media/b8c6231d082ac423b2da3635fc515284a3074bd1/891_405_5101_4079/master/5101.jpg?width=465&dpr=1&s=none&crop=none"
    },
    {
      "title": "Best Experimental Album of the Year",
      "nominees": [
        "La Brea - Hesse Kassel",
        "Don't Trust Mirrors - Kelly Moran",
        "It's a Beautiful Place - Water From Your Eyes"
      ],
      "winner-sentence": "Chile is becoming the Latin America equivalent of the UK, and I'm loving that",
      "prize-picture": "https://images.genius.com/a15356f3174496aa377da94cce73275d.845x845x1.jpg"
    },
    {
      "title": "Best Folk Album of the Year",
      "nominees": [
        "Twilight Overdrive - Jeff Tweedy",
        "Nested In Tangles - Hannah Frances",
        "Racing Mount Pleasant - Racing Mount Pleasant",
        "What of Our Nature - Haley Heynderickx & Max García Conover",
        "Baby Man - Fruit Bats"
      ],
      "winner-sentence": "It's a habit to have Wilco winning this section whenever they release an album. Guess it's time to add Tweedy's solo output to this tradition!",
      "prize-picture": "https://www.chicagotribune.com/wp-content/uploads/2025/10/CTC-L-jeff-tweedy-salt-shed010_644b5f.jpg?w=1800&resize=1800,1800"
    },
    {
      "title": "Best Heavy Album of the Year",
      "nominees": [
        "Who Let the Dogs Out - Lambrini Girls",
        "Lonely People With Power - Deafhaven",
        "Soft Spot - Honningbarna",
        "Mar da Deriva - Vauruvã",
        "private music - Deftones"
      ],
      "winner-sentence": "If you want political conscience yelled at you, that's a great album!",
      "prize-picture": "https://www.nme.com/wp-content/uploads/2024/12/Lambrini-Girls-hero-credit-Joseph-Bishop-for-NME@2000x1270.jpg"
    },
    {
      "title": "Best Hip Hop Album of the Year",
      "nominees": [
        "Egotrip - John Michel & Anthony James",
        "Balloonerism - Mac Miller",
        "Lotus - Little Simz",
        "Showbiz! - MIKE",
        "Magic, Alive! - McKinley Dixon"
      ],
      "winner-sentence": "I'm loving this wave of Hip Hop artists that add actual musicians and true instrumentation to their songs.",
      "prize-picture": "https://f4.bcbits.com/img/0040266742_25.jpg"
    },
    {
      "title": "Best Jazz Album of the Year",
      "nominees": [
        "A Matter of Time - Laufey",
        "OUT THERE - Hiromi's Sonicwonder",        
        "CORRE Y SUELTA A LOS PERROS - César y su Jardín"
      ],
      "winner-sentence": "Is it too much to ask for modern takes on vocal jazz like this?",
      "prize-picture": "https://www.nme.com/wp-content/uploads/2025/08/Laufey_Press-Exclusive_Crown-3-PC-Emma-Summerton-1-1-696x442.jpg"
    },
    {
      "title": "Best Pop Album of the Year",
      "nominees": [
        "EURO-COUNTRY - CMAT",
        "Forever Howlong - Black Country, New Road",
        "Melt - Not for Radio",
        "The Cords - The Cords",
        "Bugs Forever - Gumshoes"
      ],
      "winner-sentence": "Another year, another white teen girl pop album for some reason resonating with me",
      "prize-picture": "https://getinherears.com/wp-content/uploads/2020/09/cmat-pic.jpg"
    },
    {
      "title": "Best R&B Album of the Year",
      "nominees": [
        "The Passionate Ones - Nourished By Time",
        "Um Mar Pra Cada Um, - Luedji Luna",
        "Paradise Now - Obongjayar",
        "Sincerely, - Kali Uchis",
        "Antes que a Terra acabe - Luedji Luna"
      ],
      "winner-sentence": "Hopefully this album will nourish with time",
      "prize-picture": "https://substackcdn.com/image/fetch/$s_!5c1I!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb5e1eddb-7db3-4831-93df-924118364a1a_5472x3648.jpeg"
    },
    {
      "title": "Best Rock Album of the Year",
      "nominees": [
        "Deseo, carne y voluntad - Candelabro",
        "Getting Killed - Geese",
        "Carpe Diem, Moonman - Psychedelic Porn Crumpets",
        "moisturizer - Wet Leg",
        "Blindness - The Murder Capital"
      ],
      "winner-sentence": "Chilean Black Country, New Road is exactly what I needed, I guess",
      "prize-picture": "https://www.latercera.com/resizer/v2/PAH73WJAARB6TFL6S5LOYPHRYY.jpg?auth=6c55729644ccc6adc7c245b80eeff9d72a2ea47601e878b60e26045f8575e017&smart=true&width=800&height=450&quality=70"
    },
    {
      "title": "Best Foreign Album of the Year (Asia)",
      "nominees": [
        "NB2 - No Buses [Japan]",
        "OUT THERE - Hiromi's Sonicwonder [Japan]",
        "Luminescent Creatures - Ichiko Aoba [Japan]"
      ],
      "winner-sentence": "I think No Buses passed the point of no return to the sound of their debut, but at least they are getting their creative spark back",
      "prize-picture": "https://preview.redd.it/nietzu237d351.jpg?width=694&format=pjpg&auto=webp&s=a7c7b06fddaa07064492d70d1e038ae888139e57"
    },
    {
      "title": "Best Foreign Album of the Year (Europe)",
      "nominees": [
        "Soft Spot - Honningbarna [Norway]",
        "A Matter of Time - Laufey [Iceland]",
        "EURO-COUNTRY - CMAT [Ireland]",
        "Blindness - The Murder Capital [Ireland]",
        "the world is still here and so are we - mclusky [Wales]"
      ],
      "winner-sentence": "I love mumbling literally anything and pretending I'm singing along.",
      "prize-picture": "https://jonaskroon.com/wp-content/uploads/2025/01/honningbarna_960x960.jpg"
    },
    {
      "title": "Best Foreign Album of the Year (North or Central America)",
      "nominees": [
        "Guitar - Mac DeMarco [Canada]",
        "Melt - Not for Radio [Puerto Rico]",
        "CORRE Y SUELTA A LOS PERROS - César y su Jardín [Mexico]"
      ],
      "winner-sentence": "I stereotype every Canadian to be exactly like Mac.",
      "prize-picture": "https://rollingstone.com.br/wp-content/uploads/2025/08/mac-demarco-2022-foto-steve-jennings-wireimage.jpg"
    },
    {
      "title": "Best Foreign Album of the Year (South America)",
      "nominees": [
        "Deseo, carne y voluntad - Candelabro [Chile]",
        "La Brea - Hesse Kassel [Chile]",
        "Mar da Deriva - Vauruvã [Brazil]",
        "Carne - Todos Mis Amigos Están Tristes [Chile]",
        "Pequena Vertigem de Amor - Sessa [Brazil]"
      ],
      "winner-sentence": "Viva Chile! (It's not just a generic sentence, it's actually a sentence from the album and one of the main themes and I think I'm overexplaining myself but I just wanted to let you know that my sentences are uncreative but not that much)",
      "prize-picture": "https://tercerparlante.com/wp-content/uploads/2023/11/candelabro-chile-2023-1.jpg.webp"
    },
    {
      "title": "Best Foreign Album of the Year (Oceania)",
      "nominees": [
        "Carpe Diem, Moonman - Psychedelic Porn Crumpets [Australia]",
        "Phantom Island - King Gizzard and The Lizard Wizard [Australia]",
        "I Love My Computer - Ninajirachi [Australia]"
      ],
      "winner-sentence": "When the student becomes master, PPC will get this prize instead of KGLW",
      "prize-picture": "https://i.scdn.co/image/ab6761610000e5eb297306756ca66c92788978c9"
    },
    {
      "title": "Best Debut of the Year",
      "nominees": [
        "Who Let the Dogs Out - Lambrini Girls",
        "Racing Mount Pleasant - Racing Mount Pleasant",
        "Egotrip - John Michel & Anthony James",
        "La Brea - Hesse Kassel",
        "Melt - Not for Radio"
      ],
      "winner-sentence": "I love how the look like Taylor Swift fans but are the antithesis of it",
      "prize-picture": "https://hashbrandnew.com/Artist/image-thumb__68433__large/Lambrini-Girls-CO25-Corinne-Cumming-6953.jpg.webp"
    },
    {
      "title": "Best EP of the Year",
      "nominees": [
        "jabbermouth - Faerybabyy",
        "More - Wallows",
        "It's All Feast or Famine - Touchdown Jesus"
      ],
      "winner-sentence": "It's technically her debut album, but it's so short I'll consider it an EP. Here, Faerybabyy continues with her catchy, bubbly, energetic, bratty, yet atmospheric, dense, and sad Post-Punk. It's a bit less consistent, but the highlights are just as good, if not better, than in the previous EP. Listen to the title track and \"I Could Never Stay Mad at You\", which has one of the best and simplest melodies I've heard this year.",
      "prize-picture": "https://belongmedia.net/wp-content/uploads/2025/02/IMG_6796-1018x1024.jpg"
    },
    {
      "title": "Best Album of The Year",
      "nominees": [
        "Deseo, carne y voluntad - Candelabro",
        "Getting Killed - Geese",
        "Who Let the Dogs Out - Lambrini Girls",
        "Twilight Overdrive - Jeff Tweedy",
        "1000 Variations on the Same Song - Frog"
      ],
      "winner-sentence": "No me desampares por favor",
      "prize-picture": "https://www.latercera.com/resizer/v2/2CA5MWTCR5EGFB5AV7NLZ5F4PM.jpg?auth=6188f4fa1c32949cc20255929b6d7cadccb319a70229f12a60f17825b1eb1517&height=533&width=800&smart=true"
    }
  ],
  "last_modified":"January 19, 2026 at 17:27 "
}